[
  "А что бы сделать с этим? Может кто знает где и как петицию составить и начать сбор подписей? Или в прокуратуру какую заявление?",
  "Контентный счёт. Хотя у автора в посте есть скрин, что и он не работает в Мегафоне, в МТС пашет точно, все подписки отрезает. Подключать ногами через Маринку в салоне.\nЕщё есть услуга блокирующая контент в МТС, подключается через оператора колцентра.\nЕщё — спецтарифы, типа МТС для своих. Там автоматом все запреты на контент подключены.",
  "У жёлто-полосатого тоже есть контент-счёт, но как выяснилось он не работает, как минимум подписки самого билайна идут в обход этого счёта.",
  "У красно-белого также, «брендированные» подписки идут в обход контентного счета.",
  "А что значит «брендированные подписки»? Пример?",
  "С примерами сейчас сходу не скажу, давно не работаю в этой сфере, но общая концепция примерно такая:\nЕсть контент-провайдеры (КП), они предоставляют различные услуги для абонентов ОпСоСа, чтобы их подключать выделяются различные каналы (SMS на короткий номер, USSD запрос, пункт в sim-меню, etc). Для оплаты услуг КП предназначен контент-счет, плюс для подключения таких услуг нужен AoC (Advice of Charge), то бишь абонент должен дополнительно подтвердить согласие с тарифом и условиями списания и предоставления услуги (фактически оферта).\nНо! не все КП работают по такой схеме, часть услуг они оказывают абоненту не напрямую, а под брендом ОпСоСа, т.е. оператор их может спокойно подключать в обход контент-счета и не всегда нужен AoC (т.к. обычно это прописывается в договоре на оказание услуг связи). КП при этом получает меньшую долю средств с 1 подключения, но может получить в сумме больше подключений, чем в первом случае (что довольно очевидно), плюсом КП прикрыт большим братом от разбирательств с абонентами.",
  "Теория понятна — перепродажа под юрлицом оператора. Пример хочу, что МТС перепродает? Кто что ловил мимо контентного? \nПока примеров нет (а у меня десяток знакомых в МТС подключили такой счет год-полтора назад и бед не знают) мое мнение обнозначно — подключение контентного в МТС — серебряная пуля против подписок.",
  "Ловил гондон гандон у билайна викторину за 15 в день, отключили и вернули деньги со скрипом. Отключить возможность подписки отказались, сказав что технически невозможно. После начала процесса переноса в йоту, все стало возможным, с тех пор никакой рекламы и подписок.",
  "Это же би, я пишу про МТС и его лечение. Поэтому и вопрос у меня только по МТС — нужен пример ловли контента с контентный счётом в МТС",
  "После начала процесса переноса в йоту, все стало возможным\nМощный «инструмент». Сейчас многие люди путем попытки переносы номера выбивают себе разнообразные скидки и бонусы к тарифу за отказ от переноса номера, например 50-70% к Тарифищу от МТС, разные бесплатные доп.пакеты сверх тарифа, безлимитные инеты и т.п.",
  "Ну да, помимо отсутствия подписок еще и -50% к тарифу :)\nНо это чисто бонус, главное все же были долбанные подписки и реклама.",
  "у меня вот такая услуга подключена\nbelgorod.mts.ru/personal/mobilnaya-svyaz/uslugi/mobilnaya-svyaz/zapret-priema-informacionnih-sms-i-mms-s-sayta-mts\n\nвроде бы когда-то через оператора подключал.",
  "У жёлто-полосатого тоже есть контент-счёт, но как выяснилось он не работает, как минимум подписки самого билайна идут в обход этого счёта.\n\nИменно так. Переписывался с Билайном месяц, деньги так и не вернули. Есть и контентный счёт и все возможные запреты, бесполезно. Времени заниматься не было, но зуб остался, и все материалы тоже.",
  "Пишите заявление в онлайн-приемную РКН — rkn.gov.ru/treatments/ask-question Все возвращают как миленькие!",
  "Увы, не всегда :( Была у меня эпопея бодания с Мегафоном, в ходе которой я добрался до телефонного разговора с начальником какого-то департамента РКН, в ходе которой он мне жаловался на жизнь, и поведал, среди прочего, что, например, даже проверить ОПСоса они не всегда могут, даже при наличии жалоб. Типа, вот у него стоит система биллинга, вот на неё сертификат, и он, формально, подтверждает, что она работает правильно. Ваши логи (на самом деле, логи программы Мегафон-модем, которую Мегафон официально распространяет со своими GSM-модемами) никаких сертификатов не имеют, так что это ваши проблемы, а Мегафон — прав.\n\nP.S. Это я не к тому, что заявления писать не нужно. Писать нужно! Только стоит заранее готовиться к непростым вариантам.",
  "Подтверждаю. В позапрошлом году МТС что-то затеял на своей стороне, и у меня вместо 50 Гб в месяц стало или 10 или даже меньше. По неизвестным причинам программа или оборудование на стороне оператора стало считать, что я в Москве, а не в области. Бодался, бодался с ними, плюнул, написал в Роспотребнадзор, оттуда переправили в конечном счёте в РКН. Рассматривали несколько недель, а потом мне очень вежливо звонит девушка из МТС, мол, как можем закрыть этот вопрос. Ну, я говорю: мне главное, чтобы было всё как по договору 50 Гб в месяц. В общем, мне всё сделали и компенсацию на 3 месяца даже дали. И очень потом просили продублировать письмом в РКН, что претензий больше не имею.",
  "В те времена они (МТС) баловались якобы плохо работающими программами и плохо отвечающими операторами. Вот это «недоразумение» habr.com/en/post/317984 с «задолженностью» автоматически решили только после написания официальной претензии к МТС на их бланке через 4 месяца после их «ошибки» (без РКН и прокуратуры).",
  "Спасибо за подсказку. В моём случае полтора года прошло с момента списания денег Билайном, если срок давности не вышел — напишу.",
  "У Билайна тяжелее всего вытянуть деньги обратно. На втором месте — Мегафон, а легче всего — МТС.\nВ позапрошлом году удалось вернуть для 6 знакомых абонентов сумму, набежавшую почти за год, в 150 тыс.! Т.е. 150 штук были попросту украдены со счетов абонентов.\nЕсть даже целые форумы, где неустановленные лица работают по схемам\nЗаработок в Интернете. Мобильные подписки searchengines.guru/forumdisplay.php?f=35\nБиржа мобильных подписок exchangeconvert.ru",
  "Подтверждаю. \nУ меня вирусы на телефоне есть, они и оформляют подписки. В этой части не спорю.\nНо контентный счёт не спасает. Подписки билайна идут в обход этого счёта.",
  "Зачастую, это не вирусы.\n\nАвтор поста рассказал о еще культурном случае «подписывания».\n\nЗачастую, вся «подписка» заключается в рекламном баннере на полстраницы сайта, либо — баннере, находящемся аккурат на первой странице контента сайта( в случае с мобильным ) и выглядящего почти как контент.\nПри клике как по нему, так и по фону, открывается новый сайт. Он мигом делает несколько редиректов и… вот вы и подписались.\nНикаких глупостей вроде «Подтверждаю», «Продолжить» при этом, разумеется, нет.",
  "Так а бывает же и когда кнопочные телефоны подключают, ну да, может по USSD, но большие сомнения есть.\nП.С. У Теле2 появилась услуга мобильный перевод и при подписке через нее уходят деньги, в ЛК, это нигде не отображается, только в детализации и отдельным блоком.",
  "Всё проще \"про ворота\" — симка пытается вывести (она умная да) предложение с подпиской по запросу сетм а телефон (модем) как-то так отрабатывает, что выходит что вы согласились, основная причина возникновения такой проблемы, это то что какой-то нехороший человек в своё время решил что в угоду простоте обслуживания операторам разрешается считать достаточным для осуществления платной услуги ответ по полностью контролируемым ими каналам связи с устройства которое контролируется их же ПО (в сим карте).\nВопрос решается за 5 минут запретом операторам списывать с абонентских счетов любые средства кроме средств по оплате тарифа и услуг связи, да это убъёт весь этот многомиллионный \"бизнес\" подписок, и заодно заденет немного того что \"рядом\" (парковки), но зато раз и навсегда решит проблему.",
  "Запрет контента работает, но не спасает на препейде от подключения услуги «Интернет без настроек» (подстава для монохромовых).\nМорковный оператор не даёт оплачивать аб.плату в отрицательный баланс (хотя раньше заявлен «кредит доверия»).\nБолотным оператором не пользуюсь со времён продажи бестарифных симок в жёлтых ларьках с триколором, которым отдали вбивать тарифы вручную (сотрудницы вбивали всё что им удобно несмотря на подписанный договор). И обоим было класть болт на действия своих сотрудников.",
  ">>>но не спасает на препейде от подключения услуги «Интернет без настроек» \nОна идет почти во всех тарифах по умолчанию как обязательная, то есть ее ловишь при смене тарифа и при первоначальной активации комплекта. \nЭто же вообще не контент, контентный счет и не должен ее ловить. Благодаря этой услуге 99,9% абонов вообще не знают что такое APN и где настраивается, так что хз зло это или нет.",
  ">Морковный оператор\n>Болотным оператором\n>жёлтых ларьках с триколором\nназвания конкретных брендов вам религия не позволяет поминать всуе?",
  "У нас же уголовку за «клеву» ввели, не?",
  "Я бы писал б-лайн, который, очевидно, не имеет никакого отношения к ПАО «Вымпел-Коммуникации».",
  "Роскомнадзор (разрешенная на территории России организация) тут же правила рассказал как надо плохие слова зацензуривать, капсом и в твиттере, как и положено. Так что это б… н, если я правильно понял правила.",
  "Молодой, проблемы с ассоциациями или религия корпоративная этика запрещает смеяться? Если последний, то ваши руководители выбирали «небрендовые лица» для компаний.",
  "<wimp>Любители параненормального логики негодовали все выходные, но никто даже не предложил и варианта. Конечно, проще выполнять задачи, алгоритм на которые уже отлажен или не имеет серьёзных энергозатрат (высмеять соседа, мемчики перепостить)</wimp> :3",
  "Поддерживаю) Я, например, ни по одному из слов не могу догадаться, о каком операторе идёт речь...",
  "Ну желтые ларьки это видимо Евросеть. А вот остальное тоже загадка",
  "Морковный — красный, то бишь оператор из трёх букв, на М начинается, на С кончается, болотный — зеленый, называется как устройство для усиления речи на митингах. Желто-полосатый как пчела, думаю понятно, что это за оператор, есть ещё монохромный оператор, чёрно-белый, с цифрой в названии.",
  "Морковный, так-то ближе к оранжевому, а болотный так и вовсе отдельный цвет. А вот «жёлтые ларьки с триколором» вообще понять можно как угодно — я например, подумал про таджиков, которые у метро левыми симками торгую.\n\nВполне понимаю тех, у кого ваша терминология вызвала затруднения.",
  "Морковь бывает и белая и черная. Под болотным, полагаю, многие подразумевают зелёный. А желтые ларьки с триколором… вы Евросеть не видели ни разу?",
  "Морковь бывает и белая и черная.\nПолагаю она и название имеет соответствующее, и уж наверняка не «морковь морковного цвета».\n\nА желтые ларьки с триколором… вы Евросеть не видели ни разу?Ну видел когда-то, и чего? Или вы считаете, что все вокруг вас держат в голове информацию о брендах? Мне вот, например, на их логотип и корпоративные цвета вообще плевать, как и на логотипы абсолютного большинства брендов, которые меня окружают. Я только после этой ветки с комментами загуглил и обнаружил, что у Евросети раньше триколор был в логотипе.\n\nОпять же, из всех ваших рассуждений, до сих пор не понятно что же вам мешает название бренда сразу написать.",
  "Лошадь цвета сирени вас, наверное, должна в ступор ввести.\nЯ не считаю, что все держат информацию о брендах в голове. Но многие (не говорю, что большинство) всё же поймут, что желтые ларьки с триколором — евросеть, ибо их раньше было везде много. А название бренду писать не всегда есть смысл, желание, либо отсутствует уважение к оному и соответственно используется некое иносказательное описание, в частности цветовое. Дискуссия ни о чём на самом деле. Вы поняли в итоге о чем речь, кто-то понял «с первых строк».",
  "Контентный счет – это челобитная опсосу: \n«я умный, замечаю, когда вы меня обманываете. Очень прошу, не воруйте мои деньги, воруйте лучше у тех клиентов, которые не столь продвинутые. Скажем, у пенсионеров, домохозяек, рассеянных».\nГоворят, это помогает. Но только на время.",
  "Не работает контентный счёт у обпсосов. Или не срабатывает у других. Тут уж вопрос. Пытался проблемы у близких родственников с подписками решить посредством контентного счёта. Не помогло у билайна. Погода, анекдоты, викторины. У мегафона без контентного просто услуги подключаются, всякие гудки-шмудки.\nЖелаю всем им в загробной жизни вечно слушать гудок, заменённый на шансон.",
  "Есть у Меги отдельный контентный счёт, сам на днях подключал, как всегда не без эксцессов. На месте не смогли, не давалась им сия операция. Пришлось через поддержку с виртуальным оператором пообщаться. Теперь, когда звоните в техподдержку, сразу говорите — соединить с оператором. А то там Алиса местного разлива на том конце сидит ))",
  "Или в чате пишите-«оператор». На мтс в чате умный бот, когда ему пишешь «бот уходи», он отвечает «я здесь нужен».",
  "Увы, попросить можно, но потом иногда бывает долго ждать оператора. \nАлису местного разлива зовут Еленой, если память не изменяет.",
  "Пробовал. Как только не вызывал — не понимает. Только когда даю боту ответить на те вопросы что он знает, минимум 2 штуки, он спрашивает есть ли ещё вопросы, тогда к оператору перенаправляет. ",
  "roi.ru \nчто-то похожее там есть уже www.roi.ru/48366",
  "С удовольствием напоминаю о том, насколько эффективна РОИ\n\nВсего инициатив: 14944\nРешение принято: 33\nРеализовано инициатив: 17\nИз них инициатив, не прошедших порог в 100к голосов: 15",
  "Ну что поделать. С другими сайтами подачи петиций возможна такая же ситуация.",
  "С другими сайтами подачи петиций такая же ситуация неизбежна, поскольку roi.ru — единственный сайт, имеющий особый статус в соответствии с документом Указ Президента РФ от 4 марта 2013 г. N 183\n«О рассмотрении общественных инициатив, направленных гражданами Российской Федерации с использованием интернет-ресурса „Российская общественная инициатива“",
  "15 не прошедших? В контексте выглядит так, будто 14929 порог в 100к всё же прошли.\nДля других читателей вашего комментария отмечу, что это не так. Реализовано 17 инициатив, из них 2 набрали голоса, а 15 — не набрали (но их реализовали без голосов).",
  "Реализовано инициатив: 17\nИз них инициатив, не прошедших порог в 100к голосов: 15",
  "Прочитать можно по-разному. Вы можете настаивать, что нужно читать так, что 15 относятся именно к 17 принятым, а кто прочитал по-другому — неграмотный. Ваше право, если захотите. А я просто уточнил. \nОднако я не говорю, что ваше написание неверно, просто оно мутновато. Лично я как раз наоборот прочитал, удивился, стал перепроверять.",
  "Это, конечно, всё серьёзно, но сделать пару кликов мышью не так уж и сложно. Да и Абызов уже сидит — кто знает как теперь этот ROI будут курировать…",
  "Только не говорите, что вы считаете, будто Абызов сидит благодаря инициативе на ROI",
  ":) нет конечно. Но имхо если что-то раньше не работало практически совсем, то при переменах шанс заработать лучше чем прежде увеличивается. В общем-то с учетом того что у меня этот комментарий написать заняло больше времени чем проголосовать — я просто не вижу места для дискуссии.",
  "Я раньше тоже предлагал пользоваться сайтом ROI до тех пор пока не прочитал эту статью:\nhabr.com/ru/post/244753\nНа Change.org и другие подобные сайты, как я понимаю, власти вообще не обращают внимания.",
  "НЛО прилетело и опубликовало эту надпись здесь",
  "Желание должно быть деятельным. \nПобухтеть в интернете — не обратят внимания.\nПисать жалобы, ходить на приемы и митинговать — игнорировать сложнее. Но этим занимаются сотни, а надо сотни тысяч.",
  "Change.org сам по себе конечно ни к чему власть не подтолкнет. Он является лишь одним из рычагов давления и организации людей. А вот если таких рычагов власти в задницу напихать побольше, то результат все-таки бывает. Но надо совмещать это с оглаской в СМИ, публичными акциями и т.п., действовать комплексно.",
  "Change.org нужен лишь для того, чтобы собрать и продать данные о вас и ваших предпочтениях (и вы сами добровольно их предоставляете!). Да, он что-то из стотысячных петиций и проталкивает, но это побочный эффект.",
  "Нет никакого давления, поскольку нет никаких(!) рабочих механизмов от накрутки голосов (у РОИ это обязательное использование подтверждённой УЗ портала ГосУслуг)",
  "В калькуляторе дырочку просверлить тоже можно (ц)Городок.\nНакручивать голоса можно и инсертами в базу напрямую, система закрытая (РОИ), проверять кто будет?",
  "Речь шла о внешней накрутке (не обязательно именно массовой). Например, если у человека аккаунты в нескольких соцсетях, поддерживаемых сервисом, он потенциально может отдать голос от каждого аккаунта, по сути, не завода лишних. И от этого по сути не может быть надёжной защиты",
  "С этим я и не спорю, защититься от такого практически нереально.",
  "ну там политические инициативы. С ними все понятно.\nТут вроде как неполитическая. Можно предположить, что при 100к голосов, будет дан какой-то ход, хотя бы ради пиара власти.\nХотя какое взаимодействие у лобби опсосов и министерства. курирующего РОИ, фиг знает конечно.",
  "Это очень сложный вопрос. \n\nПонятно, что писать в прокуратуру или полицию бесполезно. Эти люди заняты более важными вопросами — преследуют людей за покупку диктофонов и трекеров для коров, публикацию архивных фотографий и негативных комментариев в соц сетях. \n\nОжидать, что они внезапно займутся расследованием мошеннических действий со стороны опсосов — по меньшей мере нелепо. \n\nЕдинственное, что реально возможно сделать — организовать инициативную группу, которая объявит о сборе средств для подачи коллективных исков. Почему это не может сделать частное лицо — для частного лица потеря копеечная, и ей никто не будет судиться. А вот если собрать средства — для организации гласного процесса, активно освещать его в сетевых СМИ, то ситуация может измениться. \n\nПочему это не было сделано до сих пор? Потому что опсосы не дураки. Они предпочитают работать напрямую с лидерами подобных инициативных групп. Просто и без затей их перекупая. \n\nЯ был свидетелем, когда Марина Литвинович, пробовала сделать что-то подобное. Она, собиралась подавать коллективный иск — к рекламе сотовых лотерей, из за которых её ребенок потерял деньги. Пошла на встречу в камерой, собираясь записать и выложить разговор с адвокатом опсоса. \n\nИ всё волшебным образом переменилось — Марина переговорив с юристом не стала публиковать запись разговора, свернув всю деятельность по иску. Что ей предложили, что ей сказали — остается только гадать. \n\nТак что нужно придумать такую форму сотрудничества, чтоб лидеры инициативной группы не могли свести её активность к нулю. Как это сделать — нужно думать.",
  "Предложите такую инициативу Алексею_Анатольевичу_20!8 с его 40 штабами в разных городах. И юристы у них есть, и медиаресурс, и аудитория…",
  "Обидно, что кроме него обратиться-то и не к кому. Вот у нас сейчас тоже проблема — власти хотят проложить магистраль с защитными щитами в 30 метрах от детского садика и жилых домов. А к кому обращаться-то? Ген. прокуратура пару лет назад не смогла даже помощника губернатора отстранить за явное нарушение, а тут экспертиза говорит, что все ок, нарушений нет. Вот и мне тоже пришлось написать г-ну Навальному с просьбой о помощи. \nЯ, кстати, в этом усматриваю и вину хабра — умные люди не могут (не хотят?) обществу предложить инфраструктурное решение (организовать взаимодействие и скоординировать усилия с помощью информационных систем) наших проблем.",
  "В Московской области есть вот такое инфраструктурное решение для взаимодействия с местными властями:\ndobrodel.mosreg.ru\nНаверное, отстранить помощника губернатора не выйдет, но помогает с локальными проблемами, вроде вывоза мусора, установки дорожного знака или уборки снега.\nХотя часто отделываются формальными отписками",
  "И в той же МО есть канал 360, где очень любят проводить «расследования» по формальным отпискам на обращения через добродел.",
  "Обидно, что кроме него обратиться-то и не к кому.\n\nПо хорошему именно такими и делами должны заниматься всяческие народные депутаты, разве нет?\nНапрашивается создание отдельной партии, чтобы и полезным люди могли заняться (работа с СМИ, забрасывание органов запросами) и не пришлось на амбразуру режима бросаться.",
  "Партия здесь является лишней сущностью (почитайте требования к регистрации партии), да и согласно ФЗ «О политических партиях», в основных целях партии нет того, чем Вы их хотите занять. Тут больше подходит другая форма общественного объединения, но сразу возникает вопрос — откуда брать деньги? На мой взгляд создание новой «партии» и нового игрока во власти вполне возможно, если эта «партия» будет технологически превосходить других игроков. Здесь и здесь я постарался изложить свое видение.",
  "Ничего обидного, наоборот, все логично. Это же вопрос не отдельных случаев мошенничества опсосов, или бездействия правоохранителей, это вопрос политической системы, вертикали власти и духовных скреп.",
  "Тоже боитесь по фамилии называть?",
  "Насколько я знаю, в России не принято обращаться по фамилии (кроме школ, армии и исправительных учреждений). Поправьте, если не так",
  "Но Милонова никто по имени отчеству почему-то не зовёт :-)",
  "Не заслужил!",
  "Да-да, обязательно предложите. Чтобы наконец убедиться, что ВСЕ лидеры инициативных групп или перекуплены, или отрабатывают свою программу.",
  "Что ей предложили, что ей сказали — остается только гадать. \nБоюсь, там были не выгодные предложения, а угрозы.",
  "Маловероятно, угрозы могу себе дороже выйти, покупать выгоднее. Кроме того частенько (наслышан по «достоверным» каналам ОБС) бывает так что крайне активные, инициативные люди не ради мира во все мире холопочут, отнюдь. Получение подобного предложение от адвоката может быть вообще конечной целью. А раз есть личная заинтересованность, тем более если она же еще и матерьяльная, то можно и компроматик на псевдо-активистов найти, по уголовным статьям включительно. Хотя это уже можно считать угрозой, но мне непросто разобраться где в этом случае будет граница между угрозой и сделокой двух проходимцев — компромат это часть оплаты по сделке или угроза? Или и то и другое? Не вспоминать про грехи + лямчик-другой рублей или же продолжать «борьбу», что тут выбирать-то. А настроящие угрозы это уже прям совсем-совсем крайняя мера.",
  "Нужно что-то вроде распределенного сайта, который бы не просто учитывал «голоса», но и давал возможность выполнения конкретных функций — например, если я юрист, то мог бы сам скачать список проголосовавших, собрать нужные документы и заставить их работать. И отправленные документы, и конкретные ответы — в открытый доступ. Пользователи могли бы контролировать работу конкретных юристов, а так же учитывать активность тех или иных полит. деятелей. При такой схеме работы исчезает единая точка отказа.",
  "Поможет ли заворачивание всего траффика в тоннель VPN на заграничном сервере? (переезд поближе к серверу VPN не предлагать).",
  "Мне помогал, т.к. я всегда сидел через vpn (роутер перманентно держит vpn). А тут поленился поднять и получил редирект.",
  "Похоже, в 2019м году пора всё заворачивать в туннель. Я уже устал на телефонах брата и сестры отключать эти сраные подписки. Сначала тоже думал, что у них руки не от туда растут, но судя по этой статье — всё-таки мудак тут оператор. Причём не важно, Мегафон/теле2/билайн или мтс.",
  "«Дура дурой, а свои 3 рубля в день имею.»",
  "MVNO Ростелеком на базе Теле2 как ни странно, как и Йота на базе Мегафона не страдают такой практикой. Плюс на билайне есть тарифы все для бизнеса начиная от 300 рублей +- с нормальными тарифами и без подобных передряг с подписками от слова совсем. Так и живем.",
  "А вот и нет. Билайн не постеснялся на корпоративном договоре с интернетом 4G вкатать счет в 3 раза больше, чем обычно. Этот сюрприз мы получили в марте, 2 года пользовались без проблем.",
  "Видимо мне везло, 3 года все тихо. Но я ФЛ на тарифе для бизнеса, очень удобно, плюс он постоплатный.",
  "У нас постоплата. Просто в этом месяце прислали счет в бухгалтерию x3, бухи ничего не заподозрили — оплатили (по соседнему договору платим пчелайну > 100к в месяц). \n\nА заметил случайно, когда бухи попросили детализацию с печатями, чтобы вбить в расходы. Вот теперь объясни налоговой, что анекдоты и доступ к платному ютубу нужен в интересах организации, а не какого-то сотрудника.",
  "Аналогично пользуюсь корпоративным тарифом Билайна. Уже лет 6, наверное, вся семья пользуется. Ни разу никаких проблем не было. Максимум, что было, это смена тарифов (на более или менее адекватные по цене аналоги).\nЗато год назад подключил дочь семилетнюю к обычному тарифу Билайна — по три разбирательства с билайном в неделю. Подключали какие-то услуги по 10 рублей в день упорно, пока не пообещал отключиться. После этого обещания месяц нормально всё было. Потом подключили вновь — отключился от них.\nРазница в отношении к ФЛ и ЮЛ очевидна…",
  "У меня билайн лет этак 25 уже. Самые обычные тарифы без абонентки.\nНи разу не попадал ни на какую подписку. Но, время от времени, кучно прилетают смс с предложением подписаться на всякую глупость. Типа набери код такой-то и получи.\nОдин нюанс, телефон кнопочный. Может смартфон на такое предложение сам среагирует?",
  "Расскажите, как подключиться к архивным тарифам по расценкам 2017 года? )",
  "В разных регионах разные цены, на текущий момент глянул: в Москве судя по всему от 500+, а в Перми, например, от 250+, в Пензе от 400+, в Екатеринбурге от 300+. Когда я подлючался, а потом переподключался на более емкий по гигабайтам тариф пропорции были примерно такие же по регионам.",
  "Ростелеком представляется такой неповоротливой махиной, видимо они ещё не вкурили, что так можно сделать или только обсуждают эту возможность. От корпоративного мегафона, которому год, приходят какие-то предложения. От личного ростелекома (перенос номера с билайна), которому уже наверное третий год пошёл, тишина.",
  "У Йоты, как оказалось, вообще отсутствует возможность платных смс и подписок. По Крайней мере, когда я попробовал недавно подключить подписку и отправить платную смс, то мне пришел полный отлуп, что нет такой функции.",
  "По Крайней мере, когда я попробовал недавно подключить подписку\nВпервые вижу человека, который это сам делал!",
  "Ну… разные бывают ситуации. \nНедавно кстати (акция мвидео) было желание именно осознанно отправить платные смс и побольше, со всех телефонов в радиусе доступности(с согласия владельцев если что) (экономически окупилось вполне, цены заранее были известны). \nТак: Yota — полный игнор (и не снятие денег)(ожидаемо вообщем то), Мегафон — куча всяких хитрых запросов с переподтверждениями что я действительно хочу. Билайн и Тиньков-Мобайл — без вопросов все прошло.\n(у Тиньком-Мобайла почти сразу СМС приходили о списании со счета).\n\nВообще с 'мобильной коммерцией' Тиньков вот осмысленно сделал, с учетом того что сейчас ситуация что есть какой то сервис где в принципе не принимают карту но возьмут оплату с телефона, это что-то странное и обычно это те места где рады бы карт взять но им ни один вменяемый пользователь — не даст. У Тинькова — баланс счета (кроме бонусных баллов) = баланс виртуальной карты которую можно вообще куда угодно использовать и даже в Google Pay подключить и платить в офлайне. Именно не дополнение со странными прокладками в лице Банка Раунд и комиссиями как у Мегафона а более менее обычная карта, тарифы это один листок в PDF и совсем не проблема их найти. \n",
  "Угу. У них есть только две проблемы. Невозможность сделать две сим-карты с раздельными балансами (не нужен мне на смс-оповещалке баланс основной карты моей) и неквалифицированный персонал в отделениях продаж, которые этого не знают.",
  "Здравствуйте. \nРасскажите, пожалуйста, что не понравилось в работе коллег. ",
  "Переносил два номера. Каждый раз спрашивал — можно ли будет сделать раздельные балансы на сим-картах. Оба раза отвечали положительно. Во время переноса второго номера в поддержке выяснил, что так сделать нельзя. Пермь, ТЦ Колизей.",
  "а что это такое — раздельные балансы на симке?",
  "Это когда ваши ворота или оповещалка о пропадании электричества не сожрут все деньги с основной сим-карты из-за какого-нибудь глюка, а будут ограничены своими 100 рублями, например.\nСобственно так и происходит у других операторов — взяли по сим-карте в планшет, телефон и прочие устройства — и у каждой карты свой счёт/баланс. У Тинькова — если вы взяли три сим-карты, то у них у всех будет один общий счёт/баланс. Иногда это удобно, но в моём случае — нет.",
  "Покупал новую Sim в Томске и сразу попросил подключить контентный счёт. Манагер в начале сообщал, что отправит смс для подключения блокировок на 3 месяца. \nЯ повторил, что мне нужен контентный счёт, а не эту фигню. \nБланк дал, но здесь началось хамство. Кое как сдерживал себя достойно и на куях не оттоскал его.",
  "И это прекрасно. ",
  "на билайне есть тарифы все для бизнеса начиная от 300 рублей\nНе спасает. У меня Билайн пару лет назад мало того, что активировал подписку на дорогом тарифе с постоплатой, так ещё потом и деньги вернуть отказался.\n\nА на обычной резервной симке, которую я использовал раз в пару месяцев, чтоб не отобрали номер, подключили платную (с бесплатным периодом) услугу. Включил так однажды телефон, а на счету от нескольких сотен рублей осталось \"-1р.\"",
  "Поможет, конечно же. Если только сам тоннель VPN не запретят.",
  "Если только сам тоннель VPN не запретят.\nТогда будем использовать sstp до тех пор, пока ssl не запретят…",
  "Можно еще AnyConnect/OpenConnect и SoftEther, они со стороны тоже не отличимы от обычного HTTPS. Правда, и тот и тот, в отличие от SSTP, пытаются еще гонять UDP-трафик для ускорения (у первого DTLS, у второго что-то своё), но если его порезать на фаерволе, то на работоспособности это никак не сказывается.",
  "stunnel+pppd",
  "А разве уже не запретили?",
  "нет.",
  "VPN уже режется. Точнее провайдеры не могут 100% идентифицировать трафик VPN, поэтому, например, ЭРТелеком просто уменьшает скорость когда видит подозрительный для них трафик. Т.е. запрета как бы нет, но работать с VPN на больших скоростях не всегда возможно.",
  "Подтверждаю.\nНедавно имел интересный прецедент общения с Йотой, от которой у меня архивный безлимитный тариф.\nШейпинг (особенно для старых безлимитов) у них жестокий.\nЙотой весь явный VPN-трафик режется до скорости уровня диал-ап.\nПереругался в публичном формате через ВКонтакте с их поддержкой, после чего Йота сблаговолила отключить шейпинг VPN для одного конкретного IP-адреса моего сервера. Причём отключить от слова — совсем. Патовая ситуация, когда через LTE скорость напрямую — 15 Мбит/с, а через туннель — 80+ Мбит/с.\nЧерез пару месяцев они пошли на попятную, молча подрезав скорость VPN на уровне 8-10 Мбит/с. В принципе, мне хватает, но осадочек, так сказать, остался.\nПлюс периодически VPN отваливается, начиная работать вновь только после перезапуска подключения к мобильной сети. И иногда Йота при включении VPN начинает блокировать доступ в сеть с баннером о включенном тезеринге.",
  "У меня причем VPN был между офисами в одном городе. Без шифрований причем работает более-менее связь (PPPoE коннект пашет), в вот шифрование VPN уже режется",
  "Какой у тебя протокол?",
  "Wireguard, но та же история на OpenVPN. Порт один и тот же использовал, дефолтный UDP OpenVPN.",
  "Скорость тунелей суммируется?",
  "Ага, от создателей мы заблокировали рутрекер и мы заблокировали телеграм третья часть мы заблокируем впн",
  "Зачем заграничный? Достаточно на домашнем компьютере поднять сервер и «ходить» через него. Сейчас многие маршрутизаторы сегмента SOHO имеют встроенный сервер OpenVPN даже в стандартной, заводской «прошивке».",
  "Если домашний интернет хороший — то можно, конечно.",
  "Не забывайте, что у многих попросту физически нет другого интернета кроме как из usb-свистка, подключённого к всё тем же ОпСоСам!",
  "А вот интересно: если ваш VPN выдаёт свой маршрут по-умолчанию, а мегафон среди прочего раздаёт вам отдельный маршрут для своих сайтов, например 31.173.32.0/21 — куда пойдёт трафик, в VPN в сеть оператора, минуя VPN?",
  "Зависит от настроек. В классическом варианте — будет браться наиболее узкий диапазон для маршрутизации, т.е. уйдёт к мегафону, а не в vpn.",
  "зависит от Route Distance интерфейса",
  "Неплохо делать для таких вещей killswitch на базе iptables, путем дропа всего трафика, идущего через внешний интерфейс, если он не на IP сервера и не на нужном порту.",
  "Еще как поможет.\nЯ пару раз попытался зайти на radikal.ru без ВПН (который я смарте вообще не выключаю) редиректит на какой-то помоечный сайт от мегафонских партнеров. Если зайти через ВПН — то просто попадаю на сайт радикала.",
  "Хм, я без впна попадаю на сайт радикал-фото. У меня мегафон, купил симку с анлимом, может, дело в особом тарифе, или просто рандомная выборка несчастных?",
  "Скорее всего нет, т.к. как вы докажете что не подписывались?\nОператоры не дураки и прекрасно всё понимают, они просто стараются быть юридически чистыми и не потерять от ухода абонентов (быть не хуже 2.5й соседей)",
  "Но, судя по отзывам, таким промышляют все операторы РФ.\nYota за таким замечена не была — у них вроде и нет функции платных подписок (могу ошибаться). Это одна из причин перехода к ним.",
  "Нет подписок. Поэтому перевожу всех родственников, которые интернетом никогда не пользовались и вдруг решили начать, на Yota.",
  "+ у них нет поддержки отправки смс на короткие номера (вернее есть, но только на некоторые типа парковки).",
  "Обратная сторона этой особенности — невозможность звонить на платные номера.\nЯ так не смог дозвониться до саппорта «Победы» (у них платные звонки) и продолбал рейс.\nСаппорт Йоты смог мне только посочувствовать…",
  "У меня была возможность звонить на платные номера, но к ним я все равно не дозвонился. Так что, вероятно, вы ничего не потеряли.",
  "в победу можно звонить через skypeOut. Выходит раз в 10 дешевле.",
  "Я так не смог дозвониться до саппорта «Победы» (у них платные звонки)\nКакой хороший саппорт…",
  "Здравствуйте! Возможность совершать звонки на такие номера, безусловно, должна быть — обеспокоены Вашим сообщением. :( \n\nНапишите, пожалуйста, подробнее про сложности со звонками в личке нашей группы ВК (vk.me/yota) и укажите Ваш номер — постараемся решить вопрос.",
  "Ну здравствуй, Йота. С тарифом 0 минут + 0 мегабайт за 180 руб. на 30 дней.\nСкажи, а правда что у вас есть некий «KPI», обязывающий в каждой беседе использовать «смайлики»?",
  "Скажи, а правда что у вас есть некий «KPI», обязывающий в каждой беседе использовать «смайлики»?\nСправедливости ради, есть ресерчи (не очень научные), которые говорят что emoji в тет-а-тет беседе (факт наличия) положительно влияет на реакцию собеседника :)",
  "Ну да, а через призму российского эффективного менеджмента получается: «так, всем в обязательном порядке всегда использовать смайтики, иначе премии не получите!»",
  "добрый вечер! В первую очередь хотим отметить, что в опцию 0 Гб сейчас входит возможность безлимитно обмениваться текстовыми сообщениями во всех мессенджерах — плата снимается именно за данную услугу. \n\nА вот что касается KPI, то таких требований у нас нет. \n\n:)",
  "Я конечно понимаю, что реплики SMM-менеджеров в соцсетях юридической силы не имеют (а жаль), но зачем так нагло врать-то — все мессенджеры ниже представлены «кнопочками» по +20 и более рублей.",
  "На их сайте та же информация\n",
  "А не можете ли Вы пояснить, почему у Вас vpnbook.com заблокирован? Т.е, может и не у Вас, а у дальше по траектории, но блин, судя по https://blocklist.rkn.gov.ru доступ к www.vpnbook.com ограничен к какой-то странице? Не ко всему сайту!",
  "Обратная сторона — режут wireguard, отнекиваясь, что он же в бете вот и плохо работает. А они белые и пушистые.",
  "Да они вообще весь подозрительный трафик режут. Пока что настроил его на 1194 и 51820 порты, вроде работает. ",
  "У меня через йоту, например, не работал SIP. У родителей загородный дом, городской линии нет, интернет через свисток йоты в роутере, воткнутый в пивную банку на 2,5 ГГц (ибо на проблемы с сигналом тоже ответы «щито поделать, местность такая»). Поставил им шлюз к радиотелефону и подцепил к своему астериску — и тут на тебе, полный глушняк по 5060, ни UDP ни TCP не ходит! При этом если перевесить на другой порт, замапить на роутере, за которым сервак, например, 5060 на 39390, то всё внезапно начинает очень стабильно и шикарно бегать и работать (не считая входящих вызовов, сигналинг ходит, а медиа нет, но это уже последствия сидения за провайдерским NATом).\n\nПри этом с «большой тройки» вполне спокойно пользовался SIP клиентами с мобилы без всяких препятствий.",
  "[Робко так] Но ведь Yota это тот же Мегафон.\nТ.е. я хочу сказать, что если они не делают это сейчас, то не факт, что не начнут вот прям завтра.",
  "Железно — Мегафон, надстройка над сетью своя.",
  "Какая разница, чей он виртуальный оператор? Он (оператор Yota) предоставляет услуги (отсутствие этих подписок), которых нет у других операторов.\n\n>не факт, что не начнут вот прям завтра.\n\nНе факт, что прямо завтра интернет в России не отрубят, но вы же не исходите из этого, правда? :)",
  "Тут не в виртуальном операторе дело.\n2013 г., 10 октября — «Мегафон» приобрел 100 % «Скартела» и 100 % Yota",
  "Ок, что поменялось в Йоте? Относительно недавно только убрали безлимитный интернет. \n\nКак не было подписок и всех этих веселых штук, так их и нет. Поэтому, честно говоря, не понимаю, какая разница, кто владеет Йотой.\n\nПросто раз за разом Йоте ставят это в упрек, что ею владеют Мегафон, что он не настоящий оператор. Только что это меняет в том, что предлагает и дает Йота — не понимаю :)",
  "Безлимитка у корпоративного тарифа осталась.",
  "Точнее будет сказать, что убрали для подключения тарифы с безлимитом, а у старых абонентов всё так и осталось. Как был безлимит так и остался.",
  "Зато теперь у Йоты на тарифах для смартфонов покрытие такое же, как у Мегафона. И можно спокойно уходить туда со своим номером.",
  "очень бы хотел увидеть комментарии мегафон",
  "Мегафон не ответит…\n\nhabr.com/ru/company/megafon",
  "У меня большая просьба к deniskin или кому-то из habr: оформите эту страницу в имитацию подписки на контент. Будет смешно.",
  "А потом получить иск за порчу деловой репутации будет вообще не смешно =)\nЯ понимаю, почему такое предложение, но мне кажется лучше не шутить (доказать потом будет сложно, с нашей «свободой слова»).",
  "Зачем в имитацию?",
  "тяжело работать с грамотной аудиторией",
  "Интересно, они хотя бы читают?\n\nСам вот гляжу на это и думаю тоже срулить от них. Пока останавливает то, что их номер держу чисто для редких звонков и смс, а на подписки пока не напоролся после того как в ЛК всё вычистил",
  "Так теперь номер легко переносится между оператарами. Во всяком случае со жлобафона точно, сам ушел. Вы знаете, как забавно они сразу начинают скулить и слать жалобные смс? =) Одно это того стоит.",
  "Подтверждаю, в прошлом году срулил на теле2, вдвое дешевле, пока доволен. Звонили несколько раз, предлагали остаться.\nДел на полчаса-час и 1 неделю.",
  "Читают, конечно. Читают и ржут. Отвечают отписками. ",
  "Мегафон пишет сегодня через блог Mail.ru\nГляньте последние публикации ",
  "Дай прямую ссылку на них",
  "У меня Мегафон. N лет назад (когда такое было возможно через сервис-гид) был подключен контентный кошелёк. И все платные услуги оплачиваются только с него. Разумеется на нём всегда 0.00р. И при попытке зайти на такой сайт приходит смс с информацией как пополнить этот кошелёк.\nСейчас такого в личном кабинете нет, но как услуга вроде бы осталась. Но подключить можно только через оператора в салоне и никто вам про неё не расскажет. И на сайте этой информации нет (или я не нашел).",
  "Плохо искали :)\nКонтентный счёт.\nЕсть ещё Запрет платных контентных коротких номеров.",
  "Второе тоже подключено. Не работает. От слова «совсем».",
  "Вам будет смешно: услугу «Запрет платных контентных коротких номеров» можно подключить бесплатно, но всего на три месяца. Потом ее нужно включать заново через оператора или салон связи.",
  "Когда столкнулся с этим — последнии сомнения в том что оператор заинтересован в беспределе с подписками развеялись и перешел со своим номером в йоту.",
  "Ага и на той странице: Способы подключения Наберите команду *526#\nОчень мило, то есть если симка в девайсе, то нужно ещё пройти квест по извлечению симки из него (а это может быть, например, хорошо спрятанный в машине GPS-маячок), установке её в телефон (здесь ещё этап поиска совместимого по форм-фактору симки телефона) ну и потом всё в обратной последовательности… \n\nКстати, с некоторых пор у мегафона заказ детализации через личный кабинет надо подтверждать кодом из СМС. «Меня терзают смутные сомнения»(с), что это тоже неспроста…",
  "Эти запреты ещё и надо (было?) продлевать каждые три месяца.\n\nПо крайней мере, примерно два года назад занимался переводом компании на Мегафон и было именно так. Особую пикантность здесь предоставляет описанный вами случай — когда сим находится в устройстве, которое не умеет набирать. Например, в роутере, через который доступен интернет. Получается, что насобирать подписки посредством случайных переходов очень даже можно, причём незаметно (смс ведь никто не увидит), а для отключения нужно будет вытаскивать симку из устройства, что не всегда легко сделать.",
  "Нашел через поиск на их сайте\nhttp://moscow.megafon.ru/services/other/content/ks/ks.html\nОбратитесь в ближайший салон МегаФона, чтобы подключить или отключить услугу.",
  "Я подключал в личном кабинете.",
  "Эту лазейку давно прикрыли.",
  "Я пользовался пару месяцев назад.",
  "Каким образом?",
  "Пару месяцев назад ругался с мегафоном в личном кабинете на сайте. В чате написал, что хочу, чтобы они подключили мне контентный счёт. Подключили. По ussd-коду *393# могу узнать номер этого счёта и баланс (нулевой, ессно).",
  "Сколько ругались и по какому поводу? Сам не попадал ни разу, но родственникам подключить хотелось бы, естественно безо всякого личного хождения не особо ходящей бабушки по улицам.",
  "Личный опыт: подключил через чат. скриншот",
  "Мне кажется это не контентный счёт.",
  "Не в этот раз, он был подключен ранее. Здесь я хотел показать как отписаться от всех подписок.",
  "да, мне тоже пришлось топать ножками в ближайший салон. тамошний :) сотрудник полчаса пыхтел в поисках как это сделать, чатился с другими мегафонцами, созванивался… нифига. единственный результат — нужно было поехать в другой район города в салон, в котором более компетентная сотрудница. та оформила \"за 5 минут\" контент-счета на несколько моих номеров без лишних вопросов. и мило улыбалась на вопрос \"почему убрали это из ЛК и так всё усложнили?\". В общем, де-факто они мошенничают, но де-юре всё чисто. К слову, остальные опсосы тоже с рыльцем в пушку. ",
  "нужно было поехать в другой район города в салон\n«Где получали симку, там и оформляйте»?",
  "нет. «я не умею. в салоне по адресу *** работает девушка, вот она точно знает, как это делается».",
  "Еще добавлю, если пытаться выйти с мобильного на сайты заблокированные РКНом или судом (по любым причинам), то с некоторой вероятностью 50 на 50 примерно, откроется подобное окно с подпиской. Оператор Теле2, тариф корпоративный.\n\nА Мегафон при обнаружении подключения подписок и требования с них денег предлагает натурально поторговаться, сколько они вернут, как на египетском базаре прямо. И это в абонентской службе.",
  "У меня на Теле2 один раз подписали на какую то лабуду, обратился в поддержку, мне сделали контентный счет, и больше эта тема меня не беспокоит.\nПравда про то, что они могут вернуть мне 35р, я тогда не знал, поэтому не спросил, итого: где-то за 13 или 14 лет использования Теле2, ушло 35 рублей на подписки, возможно мне повезло.",
  "Буквально месяц назад попался на этом. Написал в ТП, получил ответ что-то вроде «Вероятно, вы подключили себе платную подписку, когда искали что-то в интернете. На вашем тарифе предусмотрены каналы мегафон.тв, давайте подключим вам еще каналы, чтобы не пришлось больше ничего искать в интернете.» Занавес. Перешел на yota, говорят у них в принципе нет сервиса платных подписок, да и тарифы честнее.\n\nps Еще у них детализация платная, если не первый раз за день заказываешь, 10руб/день детализации. Очень печальный оператор.",
  "Возможно пока YOTA норм, но она принадлежит мегафону, так что выводы делайте сами :)",
  "Помимо йоты есть еще другие виртуальные операторы, ростелеком например. У них подписки работают? Сам пользуюсь йотой уже год, полет нормальный. Забыл уже что такое навязывание услуг.",
  "В смысле «говорят». Вы рекламируете что ли? Глянул их тарифы, в каком месте они «честнее»?",
  "У меня Билайн, попадал на подписку, по итогам общения с ТП выяснил что можно завести отдельный счет для контент услуг и деньги на контент тогда могут списываться только с этого контент-счета.\n\n1) Заводишь контент-счёт.\n2) Держишь на нём 0 рублей\n3) ???\n4) PROFIT!!!\n\nПодозреваю у остальных опсосов тоже так можно.",
  "Но если бы вы внимательно читали пост, то увидели бы, что у автора он есть и он не работает.",
  "Для операторов оставили лайфхак, они могут делать свои услуги мимо контент счета.",
  "Да.\nВ статье, кстати, в сообщении от этих… прямо сказано: «Стоимость подписки 35.0 руб. с учетом НДС за 1 день. Оплата производится с основного счета.»",
  "Остальные опсосы просто обязаны (по закону) иметь такой счет, но да они уже и с контентным счетом часто умудряются списать «деньги за воздух».",
  "Ау МТС есть на это финт ушами: «Услуга „контентный счет“ действует в течение одного года. А затем, если вы ее не продлили, она автоматически отключается»…\nНакося, выкуси!",
  "У МФ так же со временем отключаются запреты платных подписок.",
  "Эту статью стоит отправить в РКН, у меня был личный опыт подобного мошенничества со стороны оператора и после обращения в РКН со всеми доказательствами (включая скриншоты переписки с ТП Мегафона) — через некоторое время получил письмо от РКН из которого вышло, что они во всём разобрались, признали мою правоту и направили дело в суд.",
  "И чем дело закончилось?",
  "РКН подал в суд на Мегафон, я в процессе не участвую, больше меня не информируют.",
  "Был подобный инциндент с Билайном пару месяцев назад. Написано было заявление на сайте РКН. Тут главное, чтобы номер был оформлен на Вас! До суда дело не дошло, сотрудник Билайна позвонил, сразу же вернули средства и слезно просили не доводить до суда. Не стал дальше разжигать. Но то, что не помогают разные рода подключения «спец»счетов от собственных подписок оператора — факт! Все равно списывают)",
  "А надо было доводить…",
  "интересно, а легковесные решения типа dns over tls от cloudflare помогут? ",
  "Контентный счет поможет.",
  "Вы бы хоть статью прочитали, не знаю.",
  "А вы внимательно статью прочитали? Можете процитировать где _автор_ пишет под подключенный у него контентный счет?\n\nИ да от подписок он не защищает, но он во многих случаях защищает от списания денег по подписке. Т.е. вас подписывать могут, но денег с вас мошенники не получат. \n",
  "Так там прямым текстом на странице написано:\nОплата производится с основного счета.",
  "Нет, перенаправление делается не с помощью подмены DNS",
  "Поможет переход всех сайтов на https",
  "В описанной ситуации — да.\nНо если есть GPS-маячок, который априори стучится ровно на два IP-адреса (DNS-сервер, порт 53, и бэкенд мониторинга, кастомный порт) и отправляет строго зашитые в его 64 килобайтах флэша пакеты, и он «подписался» на что-то — против этого только ногами.",
  "… и по почкам.\n\nПростите, не удержался. Насилие это плохо и вообще не выход, конечно. Но иногда очень-очень хочется.",
  "Какой-то из представителей операторов исследовал этот вопрос, оказалось, что некоторые операторы присылают что-то вроде USSD-ответа со всплывающей рекламой, с кнопками типа отмена/подтвердить, и некоторые устройства по умолчанию подтверждают подписку.",
  "На корп. тарифе после ussd запроса баланса в смс приходит баланс и предупреждение, \"сейчас вам будет показано предложение\", далее через несколько секунд симка выводит на экран предложение подписаться на какуюто (случайную) подписку, снизу экрана как раз там где кнопки.\nТакже несколько раз всплывало сообщение просто так, можно чисто случайно попасть в кнопку, согласия.\nУвы но не нашёл как выключить функционал сим меню в андроид, как оно отработает в разных модемах/часах и т.п. вообще не понятно.\np.s. специалисты по биг.дата в операторах, я понимаю, это ваш хлеб но....",
  "Я раз в 3 месяца со всего семейства собираю телефоны и отключаю платные подписки, это не только интернет сервисы, но и сервисы типа автоответчик, Мегафон делает сервис бесплатным, подключает его, потом через год делает его платным и ты уже начинаешь платишь, если не заметил оповещения от них.",
  "Сервисы самого моб.опа только отключать, а платные подписки можно решить разом подключив контентный счет. \nНо лучше просто увести всех с мегафона — они самые бессовестные разводилы из тех 3-х операторов с которыми я имел дело (исключая МТС — про него просто не знаю).",
  "НЛО прилетело и опубликовало эту надпись здесь",
  "У Мегафона покрытие по России очень хорошее. Время от времени оказываюсь в местах, в которых только он берёт.",
  "У Мегафона свои же подразделения мучаются, у них тоже модемы служебные часто на увеселительные подписки сами подписывают — информация от сотрудника Мегафон.",
  "У меня модем на анекдоты подписался у Т2, но подключенный контентный счет спас от списания средств по подписке.",
  "Да, меня тоже на корпоративной симке Т2 спасает подключенный контентный счет, который 0.",
  "Подумалось вот что.\nОператор знает, в какое устройство вставлена симка.\nЗнает, что это не смартфон, что это модем.\nЗнает, что вот конкретно этот модем не вставлен в комп, а используется в IoT.\nТак вот, владельцы таких сим-карт не защищены от подписок, а ровно наоборот — для них есть риск, что опсос повесит на них подписку с расчетом, что вовремя это не будет замечено. А если и будет замечено, то расчёт опсоса — на то, что деньги вернут не всем и не в полном объёме.\nИ знаете что, даже если по итогу деньги вернут всем, то это всё равно выгодно некоторым подразделениям внутри опсоса — собирают деньги перед годовой отчетностью по одной статье бюджета, а отдают уже в новом финансовом году, и по другой. Плюс ещё взаимоотношения с их «партнерами» — не исключено, что прибыль уходит в эти фирмочки, а убытки остаются опсосу, ну и т.д.",
  "а почему бы просто не перевести семейство на оператора, где нет подписок?",
  "Это какой?",
  "У меня 5 родственников с теле2 на mvno ростелекома ушло, те же яйца, и тарифы «зеркальные», а подписок нет.",
  "Пока нет.",
  "Ну если так будете рассуждать, то операторы и дальше вас будут обувать. А если хотя бы незначительная часть абонентов встала и вышла в теле2, эти подписки давным-давно бы пропали.",
  "А если хотя бы незначительная часть абонентов встала и вышла в теле2\nкоторый точно так же подписки лепит — два моих GSM-шлюза, подписавшихся на анекдоты и прогноз погоды не дадут соврать.",
  "Мегафон когда рос был как раз таким самым честным оператором (по моему сугубо личному мнению) но в какой-то момент и они стали как все (а гдето и переплюнули) ",
  "Плюсую. Именно по такой причине подключился к мегафону в начале 2000ых.",
  "Когда я еду на Селигер, то Теле2 между городами не ловит, а связь нужна всегда.",
  "Раз уж речь про Ростелеком зашла. Ничего не могу сказать про mvno. Пользуюсь их adsl интернетом (другого к сожалению нет) и то подписать умудрились. Получил смс от Ростелекома, находясь на работе, что вам подключен kaspersky internet security, месяц бесплатно, а далее 139 рублей. На претензию оформленную на сайте, ответили какой-то бред, в духе, что подписка будет отключена 29.01.2019. По телефону оператор нес какую-то фигню про акцию и о том что я могу зайти в личный кабинет и отключить услугу самостоятельно.\nБилайн, время от времени подписывает, раньше возвращал, после перебранки с оператором. Последний раз нет. Вывод, я думаю, уже многие сделали. Все без исключения занимаются подобным и безнаказанно.",
  "это йота",
  "Тинькофф Мобайл (на железе Tele2) www.tinkoff.ru/mobile-operator",
  "У меня, например — тиньков",
  "Пфф… меня мегафон редиректил при посещении 192.168.99.100 (прям по IP, дев-сайт) на рекламу Мегафона же. Скорее всего это было сделано через их приложение Megafon Internet на компьютере.\n\nПоддержка упорно отвечала, что это «на самом сайте вас перенаправляют на рекламу», пока я не сказал, что это мой сайт, к тому же локальный.\nПотом ВНЕЗАПНО выяснилось, что можно подключить запрет на показ такой рекламы (т.е. они таки признали, что это они показывают рекламу), который сработал только с третьего раза.\n\nP.S. Редиректило только с HTTP сайтов. HTTPS не трогало, да и не могло, наверное.",
  "К вопросу, почему стоит переходить на https повсеместно. Хотя от редиректа на дев сайтах это не спасет, но это уже убернаглость.",
  "Делать https на тестовом даже-не-домене чтобы защититься от Мегафона :)\n«Выбор начинается с тебя» ©",
  "Будет еще более забавно, если их приложение будет находить у вас на дев машине закрытые ключи и все равно внедрять рекламу.",
  "Приложение у них под Windows, ну и пусть работает в девственно чистой виртуалке.",
  "А как подключить? Меня в чате в приложении уверяли, что они такое не делают.",
  "Называется «запрет на баннерную рекламу». Пару раз приходилось звонить и выносить мозги операторам. А флеш-сообщения — это калейдоскоп событий.",
  "Меня тоже уверяли. Надо напрямую говорить, что «хочу запрет на показ рекламы», тогда он внезапно находится.",
  "В общем, сходил в салон, подключил контентный счёт и это. Там оказалось аж 2 услуги, называются \"Отказ от баннерной рекламы оператора\" и \"Отказ от баннерной рекламы партнёров\".",
  "Контентный счет можно подключить и через ЛК.\nНадо немного понапирать, но можно, я подключал у Мегафона.",
  "А рассылки с номера 2017 отключаются? Ненавижу SMSки не от людей.",
  "Пока не получал, да и до сегодняшнего дня тоже.",
  "Жесть. Читаешь как про события из какой-то параллельной вселенной. Ни разу не видел чтобы оператор вмешивался в мой траффик. И это при том, что наш Киевстар принадлежит той же компании что и ваш Билайн.",
  "То был первый и последний раз за несколько лет периодического использования.",
  "Билайн ранее любил подсовывать свой личный кабинет на страницы в виде боковой кнопки (javascript), чем мог убить страницу.",
  "На скриншоте «свободные inodes» линк https ",
  "Меня один раз так редиректил на страницу со своей рекламой Дом.РУ/ИнтерЗет. Обратился в поддержку — признались, что это их «информирование» и отключили.",
  "Меня и Ростелеком так редиректил. Причем они не признали рекламу, но потом она пропала.",
  "Особенно классно когда этот редирект происходит при оплате чего-нибудь через биллинг типа 2checkout, который требует обязательного перехода по ссылке для завершения платежа. Эта наглое вмешательство в трафик стало основной причиной перехода из дом.ру",
  "Да просто никакого уважения к клиентам компании, я очень надеюсь что кто нибудь да сможет запустить всемирное покрытие с помощью спутников, и в гр*бу я видел эти мегафоны, биллайны, теледва и тд. и тп.\nНадоело мне уже отписывать моих родителей, звонить, ходить по офисам этих компаний, а ведь на эти деньги мои родители могли купить что-то полезное, подарки внукам, лекарства себе…\nЗла не хватает, вот честно, чем дальше, тем глубже",
  "Мне помогло (даже на мегафоне) — поругатся конкретно с поддержкой и подключить всякие запреты + контентный счет.\nПару месяцев ругани — и потом ваш телефон становится белый и пушистый (по крайней мере на пол года, год). Там с ними когда матом начинаешь ругаться — то они сразу находят нужные опции запретов.",
  "Прикол в том что эти опции делаются не на все время, проходит время и все снова, опций запрета нет, куча г*на в подписках! Пятница, нужно релаксировать, а меня зло берет, нужно прекращать)",
  "Так и есть — поэтому я и написал что это помогает. но временно.",
  "Я ни разу пока не натыкался на платные подписки(контентный счёт подключил сразу), но регулярно сражаюсь за право не получать смс спам. Несмотря на галку в договоре, и пару десятков подключенных запретов(из которых о половине даже негде узнать — их подключает только ТП после жалоб и ругани), спам периодически прорывается(я про спам от самого мегафона, если что). Недавно запустил процедуру переноса номера, ибо достали — и меня девушка по телефону долго уговаривала дойти с паспортом до салона, где сотрудники подключат мне какой-то очередной, последний, самый важный запрет, который можно подключить только при личном визите, и вот с ним-то я и заживу счастливо и свободно. Ну и да, 50% скидка на тариф, безлимитный интернет на всегда — только останься… Причём, на белом глазу уверяют меня, что ежедневные смс с предложением подключить 50% скидку на тариф и безлимит(с условием прекращения процедуры переноса) — это не реклама, бгг.",
  "Даже когда с ними начинаешь матом, информацию они выдают очень неохотно, по крупицам.\n\nХотел сейчас сделать скриншот с примером из ЛК мегафона, дак мегафон меня почему-то залогинил под каким-то другим юзером из другого региона, про которого я ни сном ни духом. Facepalm.\n\nUPD: со второй попытки получилось:\n",
  "Ну, то есть, они признают, что \"… существует множество сайтов, использующих нашу с Вами невнимательность в своих интересах ...\" и при этом продолжают предоставлять этим мошенникам доступ к своей абонентской базе, к подключению какие-то платных услуг.\nШикарно.",
  "Интересно, а слово «невнимательно» относится и к тому, что они в сторону этих «множества сайтов» переводят деньги со счета клиентов?\n\nСложно верится, что без договора с Мегой (и другими операторами) множество сайтов получат хоть копейку. Раз договор есть, то есть и меры воздействия. И вот тут у операторов наступает импотенция, они разом забывают, как это «окрикнуть партнера», и прячутся за классическим «не виноватая я, он сам пришел».",
  "Да что вы всё про сложно верить и т.п. они соблюдают закон, пока им не запретили напрямую \"оказывать контент услуги\" они это делали, напрямую, но был громкий скандал, власти стало неудобно, операторов заставили отделить бизнес, они это сделали, пол года-год было тихо, потом опять — дошло до скандала ввели контентные счета, ИМХО пока это выгодно кому-то кто сидит очень высоко (в т.ч. опосредовано) это будет продолжаться, ничего личного — просто бизнес.",
  "И владелец этой всемирной спутниковой сети, разумеется, так делать не будет? Ну, разве что офис будет за океаном и ходить вы никуда не сможете, ибо дорого.",
  "Знаете, для меня этот пост звучит как одна большая дикость. У нас в стране тоже есть МТС, но себе он такого никогда не позволял. Да и попробовали бы они… \nПоэтому, я не верю в то, что владелец всемирной спутниковой сети будет страдать такой фигней.",
  "У нас в стране все то же самое у всех троих топ-операторов. Время от времени их жучит регулятор и волна беспредела затихает. ",
  "Ну вот попробуют, и что вы сделаете?\nНе верьте. Если это приносит деньги, почему он этого не будет делать? Вон, кто бы мог поверить, что Facebook будет пароли в открытом тексте хранить, или ваши данные продавать налево и направо, а гляди ж ты. Хранили и продавали (и будут продолжать).",
  "К слову, как раз про пароли и фейсбук я вполне могу поверить — Цукерберг сам неоднократно говорил, что слепил сайт «из того, что было» и палок. Если там хоть что-то осталось от решений того времени (а учитывая общую культуру разработки с лозунгом «технический долг — это проблема будущих поколений» — осталось, и ещё как), то пароли открытым текстом я считаю закономерным явлением.",
  "Интересно, а почему все обсуждают VPN'ы, какие то кошельки, смены операторов, но мало кто думает как бы привлечь к ответственности их?",
  "Потому что это будет как штраф 3000 руб. с Фейсбука.\nЗакрылся Фейсбук после этого? Вроде работает. И тут так же будет.\nЖаль конечно, но так это у нас работает.\n\nТот же МТС на днях согласились выплатить огромный штраф (по другому поводу). Так они даже дивиденды не отменили (хоть и есть сомнения в их выплате).",
  "Потому что это будет как штраф 3000 руб. с Фейсбука.\n\nЕсли подобные обращения будут не единичными, а более массовыми, в этом случае они будут (условно) так же платить разом штраф или на каждом конкретном случае?",
  "Вам правда интересно или вы так просто спрашиваете?\nриторические вопросыскажите сразу — вы из другой страны пишете? Или в ваш населенный пункт интернет только недавно завезли и до того было только телевидение?\n",
  "На телевидении тоже рекламу блокируют.",
  "Потому что для этого не соблюдено главное условие: наличие правового государства (из чего следует отсутствие правосудия).",
  "Ну возможно в этом вопросе хватило бы нынешнего правового уровня государства, но одна из проблем в том, что чтобы этим заниматься нужна юридическая грамотность (а хабр ресурс другой направленности и тут народ предпочтёт изобрести свою телефонию чем пойти в суд), много времени и заинтересованность, а органы которые имеют все эти ресурсы и должны этим заниматься и по какой-то причине не заинтересованы. \nНа много проще сменить оператора.",
  "Потому что максимум, которого можно добиться действуя самостоятельно — это вернуть свои деньги. Для того, чтобы у оператора наступили какие-о последствия, должны вмешаться правоохранители или регуляторы — но первые ни черта в этой сфере не умеют, а вторые заняты тем что Телеграмм блочат.",
  "Капля камень точит (с), \nа под лежачий камень вода не течет (с)",
  "Избыточное упрощение с древнегреческого у Михельсона. На латыни «Gutta cavat lapidem non (bis) vi, sed saepe cadendo» — Капля долбит камень не силой (не дважды), а часто падая.\n\nNizametdinov этой услуги не было 2 года, а затем за неё стали ежедневно списывать деньги. Теперь делаю скриншоты ЛК, чтобы мне не рассказывали, что «она» была.",
  "Нотариально заверенные скриншоты надеюсь? /сарказм/\nПотому что обычные скриншоты что есть, что нет. Их наличие ничего не доказывает толком.",
  "Потому что-бы их привлечь они должны нарушить закон. Формально закон соблюден. Предупреждение написано. Мелким шрифтом, не читаемо — но написано. \nВот если будет как сигаретами — регламентирован на размер, шрифт и цвет уведомления — тогда да, можно будет привлечь. \nПравда в таком случае начнутся вопли — «Ой, свобода интернета, так низя, верстка же, дизайн...»",
  "Нет, ну ладно сигареты. Многие уже курят и бросать не готовы, поэтому и начинается весь этот законодательный дизайн и остальные законы об ограничении воздействия на окружающих. А эту-то дрянь почему нельзя просто запретить целиком?",
  "На каком основании запретить? Ведь формально это продажа услуги. Шутка в том, что все по закону. Как микро-кредиты например…",
  "Ну вот продажу услуг через неявную идентификацию абонента и запретить. Или — потому что эти хитрецы что-нибудь ещё выдумают — не только продажу услуг, но и любое другое использование или изменение данных, передаваемых через предоставляемый канал. Разрешать только считать общий объём.",
  "Проще потребовать, что:\n1) Контентный счет действует на все.\n2) Контентный счет включен по умолчанию с балансом 0.",
  "И вам подключат очень нужную услугу по автоматическому пополнению вашего контентного счёта. Всё для вашего удобства ((",
  "Там все регламентировано — и цвет, и размер.\nНо деньги решают все. Оператор заинтересован в прибыли не меньше сайтов, так как обычно забирает до 60%, поэтому правила постоянно меняются в сторону «либерализации».\nРаньше нужно было вводить номер и подтверждать подписку по смс, но это приносило меньше прибыли, поэтому и разрешили подписку в один клик.\nКстати, этим страдают не только российские операторы, но и по всему миру.",
  "Там все регламентировано — и цвет, и размер.\nЗная кухню изнутри — нет. Есть рекомендации которые исходят из удобства пользователя и юзабилити и только.\n\nКстати, совсем недавно был заказ на кнопку, с нарисованной волосинкой, которую пользователь рефлекторно хочет смахнуть, и тем самым нажимает на кнопку подписки.",
  "Кто-то вдохновился аватарками с мухами, однако. Вот на ПК троллинг будет!\nКак можно нажать кнопку, смахивая волос, кстати? Неужто все такие тупые, что разом в неё тычут, а не проводят пальцем чуть ли не со стороны шторки?",
  "Вот на ПК троллинг будет! \nПоказ только на мобильных и только через мобильный интернет. \nНеужто все такие тупые, что разом \nНет не все, но регистрируются стабильные +500/800 кликов в день по сравнению с «чистой» кнопкой.",
  "Показ только на мобильных, только через мобильный интернет.А если как в статье расшарить интернет?\nНет не все, но фиксируется стабильные +500/800 кликов в день по сравнению с «чистой» кнопкой.А это уже я затупил, забыв про объёмы показов. Всё верно.",
  "По закону, обязательно, должно быть действие со стороны пользователя, то есть клик и «видна — читай присутствовать» оферта. Некоторые вешают подписки и просто на переход по URL, но это токсично и с такими стараются не работать.",
  "заказ на кнопку, с нарисованной волосинкой, которую пользователь рефлекторно хочет смахнуть, и тем самым нажимает на кнопку подпискиНичего себе!\nЭто не просто темные паттерны, а прямо какие то — коричневые!",
  "Скорее петушьи... коктейльные.\nCruciatus 2.0 если хотите.",
  "Тут хотя бы была кнопка.\nСталкивался на с тем, что подписка оформилась сразу после перехода по ссылке из гугла.",
  "Вы вот зря тут выступаете на стороне мошенников и поддерживаете их. С чего вы взяли, что закон не нарушен? Вы даже этот закон наверно не читали. И не надо подходить формально. Я тут как минимум 2 проблемы вижу: \n\n — попытка намеренно ввести в заблуждение потребителя относительно функционала кнопки. Можно подумать, что вам предлагают согласиться с просмотром оскорбительного контента. \n — люди с ослабленным зрением не способны прочесть серую надпись, в то время, как они могут прочесть остальную часть страницы. А закон не разрешает обижать людей с ослабленным зрением.\n\nПо вашей логике, компании вроде МММ тоже закон не нарушают. Но против них успешно заводятся уголовные дела. \n\nЯ уверен, что если ответственные органы захотят за это взяться, они легко смогут тут найти нарушения. А чтобы они зашевелились, надо жаловаться.",
  "Все нижеследующее прошу читать тоном дружелюбным.\nВы вот зря тут выступаете на стороне мошенников Я против мошенничества! \nВы даже этот закон наверно не читали.Я его не просто читал, я его изучал! И именно по этому я понимаю, насколько он в этой ситуации бессилен.\nлюди с ослабленным зрением не способны прочесть серую надписьПрежде чем такое писать — включите «Универсальный доступ» на OSX или то, что в вашей OS предназначено для людей с ограниченными возможностями. Увидите интернет совершенно иначе. Поверьте. (Вы же помните что речь идет исключительно про мобильные устройства, читай — смартфоны)\nПо вашей логике, компании вроде МММ тоже закон не нарушают.Нет! Это по Вашей логике. По моей логике, и в соответствии с законом РФ, МММ (и подобные) — это уголовное преступление квалифицируемое по статье 172.2 УК РФ.\nпопытка намеренно ввести в заблуждение потребителя относительно функционалаВы это скажите продавцам гомеопатических препаратов, продюсерам «Битвы экстрасенсов», сторонникам РПЦ разрешенных на территории РФ организаций, не облагаемых налогом. ",
  "172.2 введена в 2016 году. А опсосы с начала 2000-х на подписках людей «вводят в заблуждение».",
  "ИМХО МММ нарушало гораздо меньше законов чем нынешние продаватели гороскопов, просто оно налоги как лотерея не платило :)",
  "Контентный счет подключите и не парьтесь тем что вас могут подписать (контентный счет по закону обязаны подключать все операторы без исключения).\n\nА такие связи между откровенно мошенническими схемами и моб.опами — они на каждом шагу.\n\nНо в плане развода (особенно пожилых людей), по лично моему рейтингу, зеленые рвут всех остальных как тузик грелку.",
  "Контентный счет подключите и не парьтесь тем что вас могут подписать.По-вашему, контентный счет защищает от платных подписок?",
  "От подписок — нет, зато защищает (не 100% но значительно) от списания средств по подпискам.",
  "Т.е. статью читали через строчку, автора контентный счет не спас. Касательно фиолетово-зелёных: МТС, во всяком случае раньше, уделывал всех остальных опсосов по количеству подключаемых платных подписок и прочих не особо нужных (но тоже платных) услуг.",
  "Вас не затруднит процитировать то место где _автор_ сказал, что у него подключен контентный счет?\n\nПо тексту статьи у меня сложилось впечатление, что автор не смог пройти тот квест, который мегафон устраивает каждому, кто хочет этот контентный счет подключить. \n\nКвест у мегафона действительно не простой… Но ругань с саппортом позволяет его подключить даже без визита в офис (проходил этот квест до перевода всех своеи номеров из этого оператора).\n\nИ да сами подписки контентный счет не блокирует, но позволяет избежать потери средств из-за таких подписок. И это тоже не 100% защита, но хоть что-то.",
  "Виноват, ваша правда, автор привёл скриншот комментария с упоминанием контент-счета. Но это не отменяет того факта, что КС — не панацея.",
  "Зеленые подключают платные подписки при подключенных запретах на платные подписки, и подключенном контентном счете. Через PUSH-уведомления (которые Мегафон-модем самостоятельно «нажимает», или что-то там делает что расценивается как подписка через пуш).\nА когда устанавливаешь запрет на пуши, то после установки запрета они продолжают приходить (или не приходить, в модеме-то их не видно, были ли они вообще) и оформлять подписки мимо контентного счета.\nПримерно так выглядит\n",
  "И кстати про «возврат денег» через саппорт:\n\nТут тоже обман — вам не деньги возвращают и фантики: те цифры которые у вас на лицевом счету выросли они выросли тем, что вы сможете потратить ТОЛЬКО на услуги оператора. \n\nНикаким путями вы ни вывести ни использовать их в платежах не сможете — т.е. вам просто скидку делают по факту.",
  "Вообще, можно, если к счету прикручена виртуальная карта, того же Мегафона",
  "Ну, с таким подходом вы и потеряли только фантики. Когда вы закидываете деньги на счёт они сразу в них превращаются.",
  "Не совсем. Если вы закрываете договор — деньги с баланса вам вернут.",
  "На счету есть обычные рубли и фантики. На мтс, например, если пополнить счет наличкой, то эти деньги потом можно потратить на pay.mts.ru на что-то полезное. А вот если пополнить счет баллами спасибо от сбера, то на счет зачисляются фантики и потратить их никуда кроме как на услуги мошенника-опсоса нельзя. Хочешь смски отправляй по $700 за мегабайт, хочешь в другую страну звони за $1/минута.",
  "Возврат денег через саппорт не всегда работает. Во всяком случае, у меня был опыт с Билайн. Сестре подобным образом подключили услугу, которую она заметила, только когда затраты по ней были больше 3к. Деньги списывались с основного счета, несмотря на наличие контент-счета. Билайн категорически отказался возвращать деньги.\nПомогло обращение в Роскомнадзор через их сайт (вживую было бы быстрее, наверно). Где-то через месяц после этого Билайн вернул деньги.\nНесмотря на «положительный» исход, крайне неприятно, что максимальное наказание для воров — это просто возврат украденных средств.",
  "Упс, оговорился. Не Роскомнадзор, а Роспотребнадзор",
  "С этими «партнерами» мобильных операторов есть замечательный прикол: существует куча багов, которые позволяют подписать на какой-нибудь платный сервис любого пользователя партнёра этого сервиса. Как ради троллинга, так и ради внезапных трат у конкурента (особенно, если у этого конкурента много симок, идеально, если они труднодоступные, как в GSM-устройствах).\n\nНо компаниям (особенно, Мегафону) не до этого: для начала надо научить зарплатных безопасников находить и исправлять более серьёзные уязвимости.",
  "Я так и не понял, а как подписываются тогда ворота и чайники?",
  "Как я это представляю.\nУстройство пытается отправить телеметрию по http на сервер. Мегафон этот запрос редиректит на свою страничку. На этой страничке надо совершить любое действие (где-то встречал описание этого), и это действие система регистрирует как согласие. \nА любое действие — ещё порция телеметрии в рамках этой сессии… Вуаля! Подписка оформлена!",
  "Вы хотите сказать, что на странице с кнопкой согласия, достаточно перезагрузить страницу для подписки?",
  "Не совсем. Отправить, например, POST запрос на эту страницу.",
  "Все намного проще. Есть такая штука как смс биллинг, прослойка между оператором и сайтом, предоставляющим платные услуги.\nВот эти биллинги(как минимум некоторые) имеют техническую возможность подписать любого абонента без его согласия. Им нужен только номер телефона.\n\nИ либо они сами химичат, либо через уязвимости этой возможностью пользуются владельцы платных сервисов.",
  "А что если интернет вообще не предусмотрен — только смс раз в сутки или входящие звонки? Однако это ни как не спасает: в Казани благодаря «Билайну» котёл начал читать книги и в Московской области: ворота с системой открытия по звонку подключались на платные сервисы от МТС. По мнению мобильного оператора, ворота дали согласие на получение платных рассылок «Полезные советы» и «Автоновости».",
  "ворота\nАвтоновости\nА ворота были для автомобилей?",
  "В некоторых GSM девайсах есть баги прошивки, которые, например, в ответ на ICB-вещание, всегда «нажимают» «ОК». Даже в интернет девайсу при этом ходить не надо. Ну и есть брендированные услуги с механизмом TryNBuy, с оговоркой, что для брендированных услуг подтверждать Buy не всегда требуется. Накатил ОпСоС пачке абонентов такую услугу, через месяц она автоматом переводится на платную и привет.",
  "Например такой баг есть в модеме Мегафон. Когда Мегафон присылает PUSH уведомление с предложением подписки — модем радостно «жмет ОК». И подключает подписку. Я считаю, это эпик.",
  "«Это не баг, это фича!» :)",
  "Некоторые дешевые устройства не умеют или плохо умеют работать с пушами. Вот приходит ему пуш «Гороскоп за 30р.», а он в ответ стандартныей ответ «ОК» или 0… и все.",
  "Интересно как с этим делом Америке.",
  "Ни разу не видел такого. И в Европе не встречался. Та даже у нас в Украине такого нет и близко.",
  "К сожалению есть такое, к примеру у нас в Молдове. \nНедавно отписывал супругу от подписки. \nСамое обидное что замечаешь это не сразу и только когда пытаешься разобраться почему сегодня положенные деньги ушли. А так долго можешь пользоваться не обнаруживая паразита который высасывает деньги.",
  "Да, у нас, в Украине, это не так драматично, но тоже присутствует. Я на Киевстаре так поймал подписку на кино для взрослых когда на каком-то безобидном сайте нажал на картинку в виде плеера.",
  "За 5 лет активного пользования T-Mobile никаких скрытых редиректов или других попыток мошенничества замечено не было. Да и в целом он имеет весьма скромный набор дополнительных услуг. Например, это полный список всех доступных мне услуг на текущем тарифе:\n\nИз контент ориентированных услуг по сути только всякие Netflix и антивирусы.\nНо с другой стороны средняя стоимость мобильной связи такая, что с лихвой окупает все эти мелкие махинации с подписками. Так что тут еще не совсем очевидно, что лучше: дешевая мобильная связь, но с мелкими махинациями от оператора; или сразу безусловно платить втридорога, но зато никаких скрытых платежей и обманов.\nPS Это безлимитный тариф. Возможно, на лимитированных тарифах ситуация другая.",
  "У T-Mobile нет «лимитированных» тарифов (есть pre-paid и post-paid). Поминутные тарифы я встречал только у виртуальных операторов.",
  "Раньше точно были. Я имею ввиду лимит на интернет, а не на звонки и смс.",
  "Сейчас всё «unlimited» на тарифах с интернетом, только если тратить меньше 2Gb можно скидку получить и если тратишь больше определенного лимита, то скорость режут и деприапетизируют трафик.",
  "Да, по поводу KickBack и ограничения на 50гб я знаю. Про это и в скриншоте написано даже.",
  "Но с другой стороны средняя стоимость мобильной связи такая, что с лихвой окупает все эти мелкие махинации с подписками. Так что тут еще не совсем очевидно, что лучше: дешевая мобильная связь, но с мелкими махинациями от оператора; или сразу безусловно платить втридорога, но зато никаких скрытых платежей и обманов.\nТут ещё вопрос, насколько махинации мелкие.\nДоходили расходы на мобильную у бабушки до 4 тысяч в месяц иной месяц. Тогда это было больше 100 баксов. Хотя последние приключения на 3 тысячи в месяц — тоже немало по меркам любой страны. Позвонишь, поругаешься — 400 в месяц. Несколько месяцев — и планка в тысячу уже пробита.",
  "Лет 15 назад на prepaid оператора O2 было довольно легко словить подписку на погоду или ещё какую гадость.\nСейчас у меня безлимит звонки/смс + 4гб на пост оплате на дешёвом операторе и оплата ровно по тарифу…",
  "Ребят, а может эту проблему можно решить технически?\nТипа собирать инфу о подписках владельца телефона (может что-то можно достать по USSD или у ЛК есть API), и информировать владельца о появлении новых подписок, даже бесплатных.\n\nРаньше вроде такое умело приложение DrTariff, но сейчас стал искать и не нашёл на Google Play, а сайт и группа VK давно не обновлялись похоже.\n\nСам с такой бедой не сталкивался, ибо для мобильного интернета у меня Yota.",
  "Я сам себе написал телеграм-бота (ладно, сервис с выходом в чятик), который периодически лазит в ЛК мегафона, сверяет подписки и присылает дельту мне в телеграм.\nПо понятным соображениям, никакому внешнему сервису свой пароль к ЛК не доверю.\nPS: юзал github.com/xRubin/unapi-gsm-megafon",
  "Я считаю, что защита от этой мерзости должна быть активной.\n1) Все ip этих мошеннических сайтов должны болезненно DDoS'иться с каждого девайса, где установлена эта защита, лист IP динамически обновляется.\n2) Телефоны техподдержки, а также просто рабочие телефоны всевозможных начальников оператора (особенно отделы маркетинга) должны DDOSиться звонками робота, чтобы зачитывались записанные случаи мошенничества и оглашалось требование прекратить воровать. Зачитываемый аудиофайл каждый пользователь мог бы загрузить сам, чтобы были всё время разные и ТП не могла сразу понять, что говорит с роботом. Думаю, какой-нибудь топ-менеджер, когда ему начнут каждые полчаса поступать такие звонки, задумается.\n3) Неплохо бы собрать краудфандингом денег на судебные процессы, чтобы нанять человек 30 юристов-сутяжников, которые, получая собранные через краудфандинг очень солидные зарплаты, только бы и делали, что целенавравленно «подставлялись» под подключение разных услуг, документировали это, публиковали каждый шаг и писали жалобы везде куда можно, каждый раз доводя дело до суда, юридически нагибая операторов по-полной. Чтобы было труднее защищаться от этого, такие люди должны ротироваться.\n4) Может быть, возымеет эффект хакерская акция, когда на такие подписки вдруг подпишется всё население страны разом.",
  "> должны болезненно DDoS'иться с каждого девайса\n\n… а они это «совершенно случайно» интерпретируют как согласие с подпиской",
  "хакерская акция, когда на такие подписки вдруг подпишется всё население страны разом\nОпсосы благословят этих хацкеров.",
  "Не только этим Мегафон наживается на клиентах. Как-то раз выезжал заграницу на машине, пользовался другой симкой. Когда на границе вставлял свою, вырубил на телефоне роуминг, чтобы точно ничего не списалось. Вернулся домой и через пару дней вижу, что много денег списалось. Заказал детализацию через приложение — смотрю, а там как раз во время пересечение границы списание 300 рублей за 1 кб траффика. Написал в поддержку, тут же вернули, как и с платной подпиской, которую, к слову, я обнаружил в этой же детализации.",
  "Несколько раз за яблочными телефонами замечал, что как-то им не всегда помогает отключение роуминга данных (за двухнедельный отпуск сотрудника раза три пытается осуществить соединение, передает/получает пару килобайт). Сейчас всем рекомендую перед приближением к границе отключать самостоятельно мобильные данные на любых телефонах.",
  "проголосовал: www.roi.ru/48366\nНеобходимо ввести прямой запрет на самовольное подключение операторами сотовой связи каких либо услуг (бесплатных, временно бесплатных, тем более платных). Любые изменения должны вносится непосредственно абонентом и только абонентом.\n\nУдарим же хаброэффектом по бездорожью и разгильдяйству (почти (с))!!! -)",
  "Так все изменения вносятся абонентом! Обманом, но на «Продолжить» жмёт абонент! \nНадо требовать механизм оплаты только с явным волеизъявлением абонента, например через ЕСИА госсуслуг.",
  "Если вы согласны подписаться на платную услугу, то приложите скан заявления, заверенный у нотариуса.",
  "По факту и сейчас вы как бы «сами» подключаете.\nДаже если обязать оформлять такие подписки только с помощью письменного договора, тоже не сработает, как не работает с персональными данными.\nТут поможет только изменение законодательства о мошенничестве в области цифровых технологий: уменьшение размера ущерба, с которого начинается мошенничество, с 2000 рублей до 100 или 200, ввести штрафы за мошенничество в области цифровых технологий.\nИли что-то такое.",
  "Поможет тюрьма с конфискацией имущества для тех, кто организует такое мошенничество, и крупные штрафы для тех, кто пособники. Иначе эта борьба просто превращается в незначительную статью расходов на уплату штрафов для оператора.",
  "Есть еще www.roi.ru/51410 там получше сформулировано.",
  "1. Бумага, и только бумага. Весна на дворе, так что ножками на обеде в ближайший офис с паспортом. Если деньги украли — потребовать возврат. Если ещё нет — запросить письменный ответ в духе — как избежать. В заявлении указать только почтовый адрес, требовать бумажный ответ (в суде пригодится).\nКопию заявления с отметкой сотрудника салона (подпись, расшифровка, печать) — при отказе — со свидетелем. Вежливо, не хамим, девочка в салоне ни в чём не виновата.\n\n2. Если нет салона поблизости — по почте (расходы на почтовые услуги можно будет потребовать возместить после суда).\n\n3. Роспотребнадзор и ФАС имеют «онлайн-приёмные» — не ленитесь писать жалобы туда. На email приходит скан официального ответа — тоже хорошая бумажка.",
  "девочка в салоне ни в чём не виновата\nЭто, конечно, само по себе не причина хамить (выше в каментах говорят, что мат на поддержку ускоряет решение вопроса — вот это уже причина, и по моему опыту с другими жуликами выглядит правдоподобно), но девочка вообще-то добровольно согласилась работать на общеизвестных жуликов, и именно продавцом, а не уборщицей или инженером.",
  "Я бы не утверждал про невинность девочки в салоне… там и мальчики попадаются… и один такой мальчик моему отцу (с проблемами с памятью) подключил второй номер на его абонентский счет и успешно снимал по второму номеру на контентные услуги деньги с основного счета.",
  "Мне кажется будет эффективно провести большое расследование со стороны прокуратуры. И выставить компании огромные штрафы по результатам, вплоть до закрытия.",
  "\n\nНа текущий момент известны следующие бесплатные SMS-команды, которые можно и нужно отправить на номер 5151:\n\nУСТЗАПРЕТСП\nУСТЗАПРЕТ1\nУСТЗАПРЕТВП\nВЫКЛЭРО\nНЕТКЛИК1\nУСТПБК1\n\nДанные сообщения необходимо посылать каждые 3 месяца, но у мегафона есть «уязвимость» — они сами присылают SMS с напоминанием :)\n\nПрямо сегодня, если возможно, съездите к родителям, отправьте данные запросы с их телефонов. И родителям приятно, и дело полезное сделаете :)",
  "Век интернета, а у Мегафона, чтобы избавиться от говна, надо слать СМС. Почему этих запретов нет в lk.megafon.ru?..",
  "Не выгодно.",
  "Очевидно, чтобы не было слишком легко. Потому же, почему, например, из личного кабинета МТС можно добраться до прямого чата с техподдержкой, только владея чёрной магией.",
  "только владея чёрной магией.\nлайвхак для пользователей мтс:\nоткрываем личный кабинет и общаемся с ботом:Я: 13:46 детализация счета в csv\nБот: 13:46 Я могу проверить:***\nЯ: 13:46 детализация счета в csv\nБот: 13:46 К сожалению, на этот вопрос я пока могу ответить только так. Попробуй переформулировать его, чтобы у меня получилось тебя понять.\nБот: 13:46 Я могу проверить: ***\nЯ: 13:46 детализация счета в csv\nБот: 13:46 Извини, я не всегда знаю, что ответить. Соединить с оператором?\n\nУра, заработало.",
  "Я решил использовать более сильный лайфхак и перейти на йоту =) ",
  "Классный лайфхак. :) Уже перешли к нам? :)",
  "Когда перестанете резать трубу с Wireguard'ом и прочим трафиком, до которого вам не должно быть дело?",
  "Уже полгода как, и, если прокачаете покрытие 4G, то будет совсем хорошо =)",
  "Это для любителей квестов.",
  "По той же причине, по которой городской телефон можно отключить только придя с бумажкой офис.",
  "Чтобы закрыть счёт мобильного счёта тоже надо закрывать с посещением офиса. В противном случае сотовый оператор отправит твой счёт в минус и будет требовать с тебя деньги. \nЯ так хапанул с МТСом.",
  "Насколько помню это требование законодательства, как и с радиоточкой.",
  "Удобно. Для них.",
  "Через МФЦ раньше делали: не как в порядке, а быстрее.",
  "Сделал команду для IOS. Шлет 6 этих смс. Может кому будет полезно",
  "Есть еще пара рекомендаций, если нужно обезопасить счёт ребенка:\n1. Подключить контент-счёт.\n2. Отключить калейдоскоп, чтобы не приходили всплывающие нотификашки (умеют показываться даже на старых телефонах) с предложением подключить платную услугу.\n3. Удалить сам SIM-меню / Мегафон.PRO, потому что там можно полазить, почитать анекдоты, и за это спишутся деньги (у меня доча так делала). Все в точности как тут: pikabu.ru/story/kak_ne_popast_na_babki_na_detskom_tarife_v_megafon_2471074\n4. Если же его не удалять, то ему как минимум нужно отключить уведомления: pikabu.ru/story/kaleydoskop_megafona_6026719\n\n(более подробно о разных способах защиты есть в этом посте — pikabu.ru/story/spokoynaya_zhizn_s_megafonom_pri_minimalnyikh_raskhodakh_6650611)\n\nНо главное: нужно помнить, что это все не гарантирует стопроцентную защиту.",
  "Эх, а написал бы кто-нибудь приложения для Android/IOS, чтобы на кнопочку нажал и все отправилось? Или уже готовые есть для подобной автоматизации?",
  "Для Android — Tasker и аналоги, но правило придётся самому писать, ну и рут, возможно, для отправки SMS нужен.",
  "Не нужен. У меня с нерутованного телефона Automagic сам SMS отправляет.",
  "Тогда я бы настроил ежедневную отправку, так, для надёжности.",
  "Это круто но когда-то мегафон придумал классный способ заработка, любой неверный ussd запрос приравнивался к платной разовой услуге выводящей что-то вроде хорошего пожелания. Как думаете они не заменят действие по одному из кодов на покупку анекдота за 599 р.?",
  "Если телефон — смартфон, то можно смастерить костыль с помощью автоматизатора (Tasker, Automagic, etc): раз в три месяца телефон будет сам отправлять такие запросы.",
  "Это не полный список команд, еще на номер 5038\nSTOP \nVIKL1 \nVIKL11\nЛибо набрать *808*0#\nЭто для отключения «всплывающих» попапов на телефоне с предложением подписки. Некоторые IoT девайсы автоматически на такие запросы делают действие, которое расценивается как клик на «Ок». В том числе модемы Мегафон ;-)\n\nНо и это еще не все! После отключения PUSH сообщений они все равно будут приходить! И активировать подписки.\nКому интересны подробности по подпискам через PUSH\n",
  "Это не полный список команд\nВ итоге 9 СМС раз в три месяца?",
  "Ну про то, что последние 3 нужно отправлять раз в три месяца я не уверен.\nОтключает услугу Калейдоскоп, которая у меня подключилась сама после того, как симка стояла в модеме около двух лет.\nПодробнее про калейдоскоп например тут",
  "Отправил такие СМС — реакции не последовало. У Вас какой регион?\nВот ещё вспомнил «фишку» — у мегафона несколько лет назад одни и те же USSD-команды *XXX# вызывали разные эффекты: Нашёл в гугле команду на отключение какой-то услуги, набрал (не посмотрел, что это другой регион) — вуаля! Платная подписка активировалась!",
  "Эти СМС отключают сервис Калейдоскоп. Который автоматически подключился у меня после того, как Мегафон ошибочно заблокировал мне симку, а потом разблокировал после жалобы. Конечно в ЛК ничего про этот Калейдоскоп нет, это не услуга, а нечто непонятное (проявляется как всплывающие окна с предложениями подключить платные подписки).\nВозможно у вас он не подключен, поэтому его нельзя отключить. У меня он тоже был не подключен, но неожиданно стал подключен (якобы через SIM-меню «его вы могли подключить сами», но как попасть в SIM-меню используя модем поддержка мегафона не знает)",
  "Будете смеяться, но есть продолжение истории\nБуквально вот недавно пришло рекламное/спам SMS на модем, и следом еще одно SMS «невозможно подключить подписку». Естественно, в промежутке между этими SMS никто ничего в ответ не отправлял, в интернеты не выходил, на ссылки не нажимал и так далее (модем воткнут в linux, сообщение принимает smsd и кладет в mysql, оттуда они уходят в телеграмм). \n",
  "Прошел месяц, и снова подписка подключилась. Техподдержка даже ничего не придумывала уже, просто отключили подписку и сказали, что вернут 20р.\nОбратите внимание, что СМС о подключении подписки пришло с номера 5151, то есть того самого, откуда пришли СМС, что подключены запреты на все подписки.\n\n\nВывод: все эти запреты не работают. Ну или работают неправильно, не всегда и т.д.",
  "Да, феерично",
  "Напомнило IDDQD :)",
  "Чтобы сохранить деньги — надо знать чит-коды :-)",
  "я тут обнаружил что при попытке отправить претензию через сайт мегафона он меня банит на пару минут, т.е. сайт вообще перестаёт открываться )) ",
  "Скорее всего это ваш браузер ограничивает количество параллельных запросов. Попробуйте открыть в инкогнито, после того как сайт перестанет открываться в обычном режиме. \nЭто не редкая история в интернете, когда сервер долго думает какой-то запрос, из-за чего весь сайт перестаёт у пользователя открываться.",
  ":) я попробовал с 4х компов дома прежде чем написать ) ну и как бы телнет при попытке коннекта на порт тоже замолкает пока я забанен. Надо попробовать с других IP адресов, мне интересно оно так делает только с подсеткой моего провайдера или вообще когда находит слово претензия в тексте сообщения.\n\nНа деле моя история более длинная, сотрудник мегафона просто обманул меня прямым текстом о стоимости и перевел на другой тариф, звонки в поддержку мне не помогли. В итоге переход на теле2 с номером. И через 2 недели после перехода мне приходит смс от теле2, что я должен мегафону денег. Это уже было через край, поэтому написана претензия и отправлена в мегафон, РКН (должна же быть и польза от них :)) и роспотребнадзор. Везде я смог отправить электронно, кроме мегафона, туда отослал бумажной почтой.",
  "Проблема на самом деле немного в другом. \nРассмотрим вопрос — как сайт-агрегатор получает информацию, что на него зашёл мобильный абонент с номером телефона 91… Очень просто. Оператор мобильной связи, заключая договор с агрегатором начинает передавать в header http запросов — номер мобильного телефона абонента. Т.е. абонент заходя на сайт агрегатора отправляет http запрос, по которому он однозначно идентифицируется сайтом.\nВ итоге — при заходе на сайт агрегатора, тот уже знает номер абонента, который к нему зашёл. Далее, после определённых манипуляций абонента (оформления подписки), агрегатор передаёт информацию оператору и тот начинает списывать с баланса стоимость подписки.\nДалее возможен вариант, когда кто-то с определённым умыслом начинает генерировать кучу http запросов в адрес агрегатора с фальшивыми абонентскими номерами. В итоге — «левые» абоненты оформляются на платную подписку. Никто ни в чём разбираться не хочет, поэтому деньги возвращаются по первому обращению.\nПочему я думаю, что есть такая схема — да очень просто. Был период, когда я изучал php и смотрел, что находится в header. И был удивлён, увидев там свой мобильный номер, при заходе через мобильный браузер. Сейчас операторы это уже пофиксили, но я то помню! )",
  "Нужели никто до сих пор весь пул мегафоновских номеров не подписал на что-нибудь интересное?",
  "У меня вот интересный вопрос. Передача телефонного номера в хедере, по идее, является передачей личных данных третьим лицам. При заключении договора я явно указал запрет на передачу моих данных третьим лицам, и ни разу не наткнулся на такого рода подписки. Может ли быть что эти моменты связаны, или мне просто везло?",
  "Телефонный номер, без привязки к каким-либо другим данным абонента (ФИО, адрес и тд.) сам по себе не является объектом персональных данных с точки зрения Закона.",
  "Разве возмездные услуги для анонима должны попадать под конклюдентные действия?",
  "Делал различные интеграции с операторами и могу подтвердить что такой способ они считают допустимым. Решается эта проблема очень легко — это не работает на HTTPS сайтах.",
  "Я не храню денег на счету, вообще. \n\nНо мне интересно, что будет если подключится такая вот платная подписка. Деньги сначала спишут на подписку а потом на предоплатный тариф?",
  "Могут списать в те несколько минут/часов когда деньги на счете появились, но еще не были списаны в счет тарифа.\n\nПо крайней мере такое случалось по словам некоторых клиентов Т2.",
  "На подписку деньги списываются сразу же как тебя подписали. Я тоже не храню деньги на счету, но рублей 5 там лежало. Списывается допустим 30 рублей за подписку, на счету -25р, номер сразу блокируется и отрубается инет и возможность звонить. Надо топать с паспортом в офис. Куча гемороя на ровном месте.",
  "Получается, что это организованное преступное сообщество, занимающееся мошенничеством в особо крупных масштабах?\nХотел написать о преступном сообществе, которое крышует данное преступное сообщество, но тут за окном пролетело НЛО и я на минутку отвлёкся.",
  "Ей, Билайн привед! Вы работаете точно так же!\nКорпоративный договор, 4G интернет на офис. Какая-то подписка съела в 3 РАЗА больше денег, чем сам интернет. Круто работаете! Мы ждем доставку Wifi-моста и пошлем вас куда подальше с такими услугами.",
  "У жены рабочий телефон пчелайна посмотрел — списывают что-то — зашел в ЛК — там подписок примерно на 1500 в мец. Отключил все и подключил контентный счет. Больше (пока) ничего не списывали.\n\nБилайн единственный кто дает сделать это в ЛК без запросов в саппорт, но грешен тем что умудряется списывать на свои подписки и мимо контентного счета.",
  "ТС, обратись в Роскомнадзор. =)\n\nЯ, например, с помощью Роскомнадзора спамеров гоняю. Они реально такие обращения обрабатывают — связываются с офисом спамера, выясняют, откуда у них мой адрес, требуют его удалить и потом контролируют удаление. Может если к ним чаще по таким вопросам обращаться — они фигнёй будут меньше заниматься…\n\nДля моего города ссылка вот такая: 54.rkn.gov.ru/social",
  "Для смс-рассылок способ тоже работает?",
  "А можете статью написать об этом? Уверен, будет полезный материал.",
  "Сильно сомневаюсь, что опыт заполнения одной формы в 5 полей тянет на статью на Хабре. =)",
  "Ну, если к опыту заполнения будет приложена красивая история наказания злодеев, то вполне. Но в любом случае спасибо вам, буду тестировать сей инструмент при случае =)",
  "Они как будто в последнее время особо активизировались.\nСовсем недавно я ругался с техподдержкой Теле2 по поводу смс «Доступ к charovnica.com предоставлен, логин a28312, пароль 56425...». Они мне начали втюхивать, что, дескать, вы приняли офферту (возможно случайно), так что всё законно. Я им начинаю объяснять что я занимаюсь веб-разработкой и подобный трэш умею вычислять беглым взглядом (огромная аляповатая кнопка «продолжить»). Показываю историю и куки браузера, где никаких упоминаний о всяких charovnica и в помине нет. Показываю запросы из яндекса, где сочетание «логин a28312, пароль 56425» начинает встречаться ещё лет 5 назад и исключительно в связи с незаконным списанием средств (хоть бы для приличия логин меняли, халтурщики). Тогда они начинают упирать на то, что это мог знакомый или ребёнок взять поиграться (зашибись, мало того, что списывают средства незаконно, так ещё и ребёнка могут редирекнуть на подобную парашу). Тоже отрицаю. Требую подключить к диалогу сотрудника СБ, поскольку налицо мошеннические действия каких-то сотрудников компании (ну раз уж они политику компании в этом вопросе категорически отвергают). Отказываются — «не в нашей компетенции». «Пишите письмо с претензией, вам ответят».\nДля тех кто думает, что такие подписки подключаются по незнанию/невнимательности. В логах браузера в принципе нет никакой подозрительной активности в промежуток времени, когда произошло «подключение». Т.е. они просто выборочно втюхивают вообще всем, кто пользуется интернетом.\n\nА совсем недавно занимался отладкой проекта на хостинге. Смотрю, страница (очень лёгкая) почему-то сильно долго прогружается. Полез в веб-инспектор… А там некий base.js с p.tlrtb.com подтягивается. Завернул его на 127.0.0.1 и полез гуглить. Нашёл много интересного. Буквально в этот же день ещё один человек (тоже при работе с хостингом) столкнулся с подобной заразой. Поковырялся… Вкратце суть такова — малварь от провайдера копирует имя js-скрипта, инжектится, затем подгружает с одного из своих доменов код (обфусцированный) для вставки «патриотических баннеров» на чужие сайты))\nВот довольно подробный разбор этой ситуации (ресурс лежит, поэтому кэш гугла): webcache.googleusercontent.com/search?q=cache:xmE-zIPP3SgJ:https://searchengines.guru/archive/index.php/t-987362.html+&cd=2&hl=ru&ct=clnk&gl=ru\n\nТ.е. в итоге ОПСОСы развели такую бурную деятельность в огромных масштабах, и при этом плачутся на траты по закону Яровой. Ну а про РКН я уже даже не заикаюсь — не для того эту структуру создавали, чтобы рунет от заразы избавлять.",
  "И ведь кто-то работает у них, разрабатывает все эти хрени…",
  "Быстрый гуглеж привел меня на страницу billing.ru, компания АО «ПЕТЕР-СЕРВИС»:\nМы создаем, внедряем и обслуживаем BSS-системы с 1992 года. Помогаем операторам связи успешно управлять бизнесом и осваивать новые возможности цифровой экономики. Создавать и запускать новые продукты и услуги, осваивать новые сегменты рынка, генерировать дополнительную прибыль. Наши клиенты — крупные российские и зарубежные компании: «МегаФон», «Ростелеком», МТС, Turkcell.",
  "Я имел в виду не техническую сторону, а скорее моральную",
  "Если вы просто производите ножи на заказ, то вы добропорядочный производитель, если к вам пришёл заказчик и сказал что ему нужен нож для убийства соседа, и вы ему продали вы — соучастник.\nЭто всё относится в т.ч. к работникам компаний.",
  "Может, хоть раз РКН мог бы заблокировать кого-то действительно виноватого? Причем, после контрольного захода на заблокированный ресурс из сети Мегафона же (а уж их своей сети они точно такого не поблочат) можно и по полной вкатить провайдеру, за несоблюдение.\n\nЭх, мечты!.. Тут же никакого экстремизма нет, всего лишь нарушение лицензии на передачу данных (хотя бы тупое нарушение числа ошибок при передаче, когда вместо слова «ХЛЕБ» передается слово «ПИВО» — это 4 ошибки страницы одного сайта прилетает страница другого сайта, с другим содержимым — это несколько мегабайтов ошибок за раз) — но и за это лицензии лишиться им не светит, думаю.\n\nПомнится, «полосатый» оператор нечто подобное проворачивал, и так же отмазывался, ссылаясь на то, что «это делают партнеры, но точного списка партнеров у нас нет и на них влиять мы не можем» — но вроде их уже отпустило, а Мега — вона что! У Меги вообще отлично: если звонишь в поддержку и буянишь, тебе говорят — «вы сами виноваты, наша система работает нормально и не может ошибаться, но, чтобы вам не было обидно, давайте мы вам 100 руб. на счет вернем». Всегда было интересно, это у них такая лень читать логи (или, что вероятнее, логов просто нет, и 100 руб. затыкают рот, чтобы юзер не жаловался дальше), или они просто априори знают, что что-то там «в пушкУ»?",
  "Может, хоть раз РКН мог бы заблокировать кого-то действительно виноватого?\nБывало, но только случайно и вместе с непричастными.",
  "46 доменов зарегистрировано за последний месяц, и мегафон продолжает регистрировать новые домены:\n\nСписок доменов anyflowfarmos.ru\nareredirdone.ru\narusav.ru\ndeffmfassers.ru\ndfcallesnoit.ru\ndiffstopimf.ru\ndmvasor.ru\ndobrovasgoes.ru\ndodofavomov.ru\ndonesredirgo.ru\ndoveserpros.ru\nfpromwas.ru\nhustlookelatos.ru\njaavury.ru\nkabravaspros.ru\nkubesercbroses.ru\nlakesmodernpro.ru\nlitorsav.ru\nmasseva.ru\nmvpvas.ru\nppmprop.ru\npravvopros.ru\nprossejobes.ru\nqunru.ru\nregtardos.ru\nropovasru.ru\nsavorpm.ru\nserschewobro.ru\nsirmenosgone.ru\nskymovarsappro.ru\nsolnesc.ru\nsomeonespro.ru\nsprosmademf.ru\nsurchegogboss.ru\nsurefacdos.ru\ntruvpro.ru\nursavet.ru\nvasgonumers.ru\nvasnpro.ru\nvaspromactes.ru\nvasservices.ru\nvosvopra.ru\nwasnopro.ru\nzaaspro.ru\nzarafest.ru\nzprozo.ru \n\n\nОни регистрируют тайповые домены (с опечаткой), в надежде что через них кто-то ходит, либо переадресовывает на них принудительно (как в посте).\n",
  "у них по ходу вообще с головой беда, кто же на себя такие вещи регистрирует или они думают им все сойдет с рук?\nтипа им можно атаковать пользователей, а простому васе нельзя?",
  "НЛО прилетело и опубликовало эту надпись здесь",
  "Кстати, а что если регистратору написать, описать ситуацию? Некоторые на фрод реагируют.",
  "Некоторые\nВ данном случае Reg.ru думаю против Мегафoна не пойдёт.",
  "Несколько не по теме, но тем у кого в газовых котлах и прочих холодильниках стоят симки черно-желтого ОбпСоСа — думаю пригодится.\nПрактически постоянно (раз в пару месяцев точно), при приближении баланса к нулевой отметке, приходит уникальнейшее®©™ предложение: \n\n\n\nПо тарифу в месяц я, естественно, плачу больше чем 200р. Подключается этот замечательный сервис, соответственно, автоматически при пополнении баланса. \nА через 7 дней — вуаля, начинает капать абонентка.\nОтключение — только вручную, с кабинета.\n\nУ техподдержки выбить удалось только одно: пополняйте в несколько заходов по 199 рублей. И точка.\n\nПричем у моей родителей тариф дешевле — так им приходило СМС и вовсе с с предложением от 50 рублей\n\nТак что эцсамое, проверьте выписку холодильника, а то вдруг.",
  "Когда там «орбитальные операторы-провайдеры уже придут»? Реально, что вы описали, это финальное дно.",
  "«это финальное дно» — не зарекайтесь, в наших условиях могут и снизу постучать…",
  "А те кто участвовал в разработке вполне могут быть участниками хабра и быть в почёте на данном техническом ресурсе, рассказывая как биг дата помогает зарабатывать на конференциях ;) вот такой он этот мир...",
  "Если вы о том, что комментировал я, то…\nНу серьезно, «большие данные» — это же медаль с двумя сторонами, как и почти все остальное в нашем мире. Последствия не от самих технологий, а от того, «во благо ли они используются».\nА то, что участники Хабра могут быть не в курсе, как другие участники «evil genuis» — ну это уже таки благодаря, еще частично рабочему, механизму «анонимности». \nА когда все будут окончательно ходить по паспортам в сеть, строго под своим штрихкодом именем-фамилией — тогда и в лицо уже будем знать «героев».",
  "С комментарием промазал :(\nА про инструмент, тут такое дело, одна ситуация когда ты делаешь \"в общем\" другая когда у тебя конкретный заказ и ты об этом знаешь, и по опыту, у меня большие сомнения что люди не знают что у них просят (а часто они и сами предлагают).",
  "Думаю, что знают наверняка.\nРазве можно как-то по-другому такие ТЗ интерпретировать?",
  "Несколько раз в год отключаю эти говна. Надеялся увидеть здесь рецепт по избавлению от них, а оно вон как… по 199р, значит. Что же, надо перенастроить автоплатеж.\n\nА еще, иногда, примерно раз в месяц, при разблокировке телефона — открывается SIM приложение билайна (SIM Toolkit), с предложением подписаться на все подряд. Открывается само, поверх всего остального, на 8 андроиде. Это как-то можно убить?\nПо найденному телефону звонил, вроде уменьшило частоту.",
  "рецепт здесь уже упоминался — перенос номера, хотя бы просто инициировать эту процедуру, какой-то профит с этого всяко поимеете — звонок от департамента по удержанию клиента, со всякими вкусностями",
  "У меня эта дрянь вылезает после каждого пополнения",
  "так это стандартный ход, так по ходу вообще все делают, а вот у родителей что дешевле интересный момент, значит у них учитывается возраст, интересно, если добыть симку на какого нибудь столетнего деда, будет ли реальный профит?\nкто нибудь пробовал может?",
  "Я не понял, где вы увидели профит? Вас подписывают на временно бесплатную услугу при пополнении счёта, чем меньше сумма, тем больше придётся дробит оплату, чтобы не попасть на деньги.",
  "я про возможные скидки для пенсов, может разведал кто тему.\nих левая подписка вообще не интересует, там точно ничего себе не срубишь",
  "Например условно рабочая схема: берется тариф без АП, кладется на полку, раз в пару месяцев подключаете туда услугу какную нибудь через ЛК на 1-2 рубля (вам звонили+, замени гудок 2.0 и подобную лабуду) и тут же отключаете. Расходы в месяц составят 1р, в год 5-10 рублей.\nЧерез некоторое время вам может поступить «специальное предложение» что нибудь вроде пакет 100 минут за 50р или пакет минут+СМС+интернет за 100р в месяц. Что в принципе очень выгодно, учитывая нынешнее ARPU 350+ даже в регионах.\nКак бы оператор видит, что зарабатывает на вас очень мало (рубль в месяц) и согласен зарабатывать например хотя бы 50 рублей или 100 рублей.\nМожет схема не очень верная, но она сработала на телефонах у моих пенсионеров-родителей (у них был тариф посекундный, но в основном им звонили дети/внуки, исходящих почти не было). В итоге, отцу подключил за 90р в месяц безлимит на билайн+100 минут+сколько-то СМС + пакет интернета (как раз купил ему простенький смарт, погоду смотреть и фотки в вацап посылать). Матери ничего не стал менять, хотя предложение до сих пор висит. Еще на нескольких IoT девайсах типа шлагбаума, сигнализации в авто и т.п. тоже примерно через год вялой траты средств стали приходить интересные предложения. Если расходы в месяц рублей 100, то вам тариф за 100р уже не предложат, но могут предложить за 200-300, «в котором еще больше минут, гигабайт и смс!». И так далее. Суть, я думаю, понятна — стремятся увеличить ежемесячный платеж, ведь в реальности ваши минуты, СМС и гигабайты в натуральном виде для оператора ничего не стоят.\nВсе выше — про билайн.\nНа Мегафоне (вторая симка, которой на исходящие не пользуюсь несколько лет) недавно тоже было предложение, не соврать 500 минут + сколько-то пакет интернета за 200р в месяц. Не стал подключать, ибо нет необходимости.\nИнтересные — это конечно относительно. Подойдет только в случае, если вы хотите сократить расходы. А если вам нужно 2000 минут и 40 Гб интернета — этот вариант не пойдет.",
  "ну да, примерно так и думал, есть пара симок, на которые редко заливаю бабло,\nтак туда частенько выгодные предложения поступают, правда не проверял ни разу,\nможет и развод.",
  "Манагер придёт к аналитику/дата сэйнтисту с вопросом почему упала прибыль по данной подписке, вы же за это премию получили, они покопают найдут ваш кейс и предложат решение, сумму в смс брать не с тарифа а с размера вашего пред. платежа, разработчику закажут доработку и пойдут в бар отметить очередное достижение...",
  "Пикантности ситуации прибавляет ещё один момент. \n\nМегафон активно продвигает свои банковские карты, \nреальные и виртуальные, \nс кэшбэком и поэтессами процентами на остаток…\n\nТак вот, при открытии такой карты карточный счёт одновременно является счётом телефона.\nТо есть если обычного абонента можно развести максимум на несколько сотен рублей (вряд ли кто-то держит на счёте мобильного существенно большие суммы), то у держателя карточки скорее всего будет на счёте сумма гораздо выше. А если на карте ещё и кредитный лимит подключён (не знаю, правда, доступен ли он на мегафоноских картах), то возможности «монетизации» возрастают кратно. \n",
  "Если ничего не сменилась, то пикантность возрастает вдвое. Когда вы перечисляет денежные средства на карту, они переходят в собственность Мегафона. А вы ими только пользуетесь. \nДеньги на карте это не ваши деньги. Это деньги Мегафона. \n\nКто то даже предлагал как вариант защиты от коллекторов. \nДеньги на карту Мегафон, официально денег у тебя нет, но ты ими пользуешся. Мегафон же собствено вашим коллекторам ничего не должен.",
  "Когда-то давно бщались с поддержкой мегафона на тему перманентного запрета всего и вся. Ответ был, помнится, такой: открыть эту карту. Вся дичь сразу отвалится. Вроде потому что на эти средства и на операции с ними начинает работать банковское законодательство, которое подобные вольности не поощряет.\nНо проще оказалось съехать на йоту, чем защищать свои же средства от сервиса, которому ты платишь за услуги связи...",
  "да, слышал про такое, мошенникам очень удобно, думаю для них и делали тоже",
  "По поводу отписок от услуг через запрет. У вас приведён не полный список — всего сообщений 6 — я уже один раз попался на таком. Вот полный список блокировок:\nУСТЗАПРЕТ1\nУСТЗАПРЕТСП\nНЕТКЛИК1\nВЫКЛЭРО\nУСТПБК1\nУСТЗАПРЕТВП\nПо возвратам — возвращает мегафон деньги 1 раз в полгода. У меня так вернули почти 1к, сказали, что всё заблокировали и через месяц у меня не было этих 1к и возврат они делать отказались. Т.к. симка находится в другом регионе (инет в деревне), то я просто теперь пополняю каждый день на фиксированную сумму, чтобы много лишнего не сняли. По факту — Мегафон те ещё козлы в этом плане, но доказать что-то врядли можно. Они как и все операторы прикроются СЕРТИФИЦИРОВАННЫМ оборудованием.",
  "Меня до глубины души потрясает это иезуитство с кодами блокировок — их надо отправлять регулярно. Интересно, если бы креативщиков из зеленой конторы держали бы под дулом пистолета, сказав им, что, если раз в 15 минут они не скажут «НЕСТРЕЛЯЙ», то их пристрелят, они бы считали, что их жизни ничто не угрожает? Здоровью кошельков их абонентов тоже угрозы нет, пока абонент следит и отправляет запреты, но нигде нет указаний, что абонент ХОЧЕТ, чтобы его деньги под разными новопридуманными предлогами списывали.",
  "Дополню.\nПозвонил в Тех поддержку Мегафона. (Корпоративных клиентов)\nПопросил отключить возможность подписок. Меня уверили, что это должен делать я сам. каждые 3 месяца. — Не проблема сделаю.\nВыслали инструкции. Но вот беда! Их 2!\n1я звучит так:\nУважаемый Клиент, для того, что бы установить запрет на услугу «Мобильные подписки» сроком на 90 дней, ответьте УСТЗАПРЕТ1 на данное сообщение (беспл.) — хотя на 5151 смс платные.\n2я звучит так:\nУважаемый Клиент, для того, что бы установить запрет на услугу собственные подписки сроком на 90 дней, ответьте УСТЗАПРЕТСП на данное сообщение — хотя на 5151 смс платные.\n\nТ.е. у Мегафона 2 вида подписок.Делаем выводы Господа и Дамы.",
  "Вам хорошо и нагло наврали\nУСТЗАПРЕТ1\nУСТЗАПРЕТСП\nНЕТКЛИК1\nВЫКЛЭРО\nУСТПБК1\nУСТЗАПРЕТВП",
  "Если эти заклинания декламировать с выражением и в подходящей обстановке, то вполне можно и призвать кого-нибудь. \nУ пчелайна на постоплатном тарифе влетел один из моих номеров на какую-то развлекательную подписку от самого пчелайна (контентный счёт не помог, соответственно).\nДва дня лили в уши про вирусы и мою косорукость до тех пор, пока не пригрозил увести три номера к другому оператору — сразу же «в порядке исключения» и «акта доброй воли» вернули скомунизженное (в виде скидки, конечно же). Твари жадные, что ещё о них можно сказать.",
  "Эту тему в Мегафоне курирует один из топ-менеджеров, это секрет Полишинеля. Человек имеет себе очень неплохой приработок на «сладких» клиентах.\nК сожалению, акционеры относятся к этому снисходительно. Мол, такое вот «кормление»",
  "Интересная инфа, напишите подробнее?",
  "Для меня вообще было шоком узнать, что можно попасть на списание денег с телефона, когда ты просто серфишь по интернету со смартфона! Никаких подтверждений по смс, ничего. Просто в один прекрасный день деньги начинают утекать. \nА решается проблема просто: любая подписка должна быть только после подтверждения через смс!",
  "Любая подписка должна быть только после письменного заявления, лично переданного в салоне связи.",
  "Билайн тоже подключает платные подписки…",
  "Недавно обратил внимание, что Билайн стал списывать с меня и родственников где-то по 3.5 р. в день за 2 обычные услуги — когда тебе приходит смс, что кто-то снова в сети и когда такие смс приходят тем, кто звонил тебе. Они всегда были бесплатны. И бесплатны сейчас, но не для владельцев архивных тарифов. Отключил, пользы от них немного. А тарифы не меняю, абонентка только больше в новых, а пользы не больше.",
  "За подобным замечены все операторы большой тройки. Хочется верить, что в прекрасной России будущего топ-менеджеры этих компаний будут сидеть в тюрьме за такое мошенничество и не только за это (чего стоит история с МТС, когда они без решения суда передавали управление номерами третьим лицам для совершения преступлений — взлома учётных записей с привязкой к номеру), если не успеют доехать до Внуково. При текущем режиме в России им ничего не грозит.\n\nКратко, у меня друг зятя брата кума пользовался Мегафоно и умер. Никому не советую.",
  "Что ток от этого мегафона не натерпелся за год. Ток купил симку, на второй день автоматом прошла подписка. Автору ещё повезло — кнопка появилась с более менее видимым текстом(можно отказаться). \nПоискал в интернете как отвадить платные услуги, пару коротких номеров, вроде прошло. \nПол года жил спокойно. Потом после первого подключения стали появляться поверх сайта на весь экран реклама мегафона — всяких услуг. Разово — но появляется до сих пор, стоит попасть на HTTP сайт после подключения. После обращения в сапорт, как и написано выше, деньги возвращали за доп. услуги подписок без вопросов. \nНедавно делали спец. предложение на трафик интернета, подключил акцию, но оказалось между переключением произошол момент, когда трафик стоил по под 10 рублей за Мб, в итоге минус 1200 на счету — и сапорту так и не удалось доказать, что 0 на счету это ноль, а минус это минус…\nВ общем мегафон ещё тот обманщик на каждом шаге: услуги-автомат, вмешательство в трафик между клиент-сервером, уход в глубокий минус — как будто так и должно быть…",
  "В Казахстане тоже была подобная проблема (у пчелиного оператора точно). В основном подключали подписки пенсионерам (которые явно не серфят в интернете, вероятно определяли по поведению), порой доходило до весьма крупных сумм. Доказать, что-либо оператору невозможно, мол сами подписались. Но потом все подписки запретили на законодательным уровне и вот уже больше года как забыли об этой проблеме!",
  "Нам бы так…",
  "И ещё один риторический вопрос: интересно, существует ли сейчас хоть один реальный клиент сотового оператора, который добровольно и осознанно(!) подписался на какую-нибудь платную смс-рассылку?\n\nЯ могу представить себе, что такие могли быть в нулевых, но неужели сейчас, в эпоху смартфонов и доступного интернета, кто-то готов платить деньги за анектдоты в СМС?\n\nТо есть получается, что опсосы поддерживают механизм, единственный смысл существования которого — получение денег с граждан путём обмана.",
  "Ничего, после 1 ноября этого года снова из смс-ок все свежие шутки и новости получать будем.",
  "А если сделать программку бота для смартфона чтобы регулярно ddosила личный кабинет и проверяла на подключение разного мусора, если хотя-бы 20% смартфонов оператора будут смотреть в личный кабинет и старательно автоматически отключатся, уже будет неплохой выход из ситуации\n\nЗЫ. Или пойти дальше подумать над координированным пользовательским ботнетом для «наказывания» операторов… только вот удастся ли хоть маленько этим навредить, хз?",
  "Ддосить ЛК — себе дороже, уронишь сервер, ЛК умрет, тебя найдут, а подписки будут неотключаемые капать.\nБотнет туда же по смыслу: тебя запишут во вредители, депутаты в очередной раз скажут, что без РКН жить уже никак, раз юзеры сами себе жить мешают (ну или ещё какую пургу — там профи от ИТ все равно, кажется, никого), по итогу операторы опять будут \"на светлой стороне\".\nПока они не будет законодательного понимания, что доп.услуги — это навязанное, то, что ОЗПП запрещает, так и будем бороться с ветряными мельницами. А раз всю тему, похоже, крышуют топы каждого оператора, то и реакция будет в стиле \" мы бы сказали вами правду, да нельзя\".",
  "Так получилось, что у меня есть сим-карты всех операторов большой тройки. Мегафон и без всяких подписок постоянно шлет всякий спам, списание средств было замечено 1 раз. МТС модем был с предоплаченной симкой на 2 недели, после того как 2 недели закончились интернет отключился и я больше его не включал, через полгода начали писать по е-мейлу о том, что у меня долг около 1000р, даже присылали бумажные письма, еще через год заглохли и больше ничего не приходило. С тех пор прошло уже несколько лет, из чего я делаю вывод, что в суд они так и не подали несмотря на обещания взыскать средства в принудительном порядке. Билайн тоже брал деньги за какое-то смс-информирование которое было раньше бесплатным.",
  "Вам повезло с МТС. Если они найдут другой ваш номер у себя с такими же данными, то задолженность спишут с него без предупреждения. Срок давности, кажется, 3 года. Так что стоит выдержать минимум такую паузу :))",
  "Я столкнулся с подобным у Теле2. Года два назад. Но после наезда на них вернули деньги и самостоятельно подключили контентный счет не только ребенку ( у которого это включилось), но и на другие номера.\nМне кажется, что все хитрости провайдеров по поводу обхода контентных счетов упираются в требования Минсвязи и тот самый федеральный закон. Там ведь оговаривается не название этих счетов, а контекст их использования для защиты потребителя от нежелательного контента. Нечасто, чтоб благой была инициатива. Поэтому, данные товарищи нарываются на обвинение их в нарушении федеральных законов. \n\nВылечит их только многократный штраф от прибыли от всех контентных услуг. Но это должны инициировать регулирующие органы. А пока, их стратегия в том чтобы по-тихому воровать у людей деньги, а если поднимут шум — возвращать без вопросов. Т.к. суд на 99% встанет на сторону абонента, плюс штраф впишет. \n\nНо системно этим уродам выгодно обманывать людей и навязывать свои ненужные услуги. Есть еще такой волшебный вариант, когда внезапно появляется меню на телефоне( вероятно сервис от симки), где надо ответить да-нет. Причем вопрос может быть тогда, когда его совсем не ждешь )). И случайно нажмешь мимо.",
  "Можно еще попробовать рейтинг воровства опсосов составлять с периодической публикацией в сми результатов. Пусть борются за желтую майку лидера.",
  "Это как народный рейтинг банков, по пятибальной шкале большинство пользуется теми что имеют оценки ниже 3х :)",
  "Являюсь абонентом мегафона, у меня в роутере от asus уже три года трудится модем от Мегафон 150-2. Все дома выходят в инет через роутер, очень много раз замечал в личном кабинете такие подписки, и тк на счете обычно 10р, через сутки после подключения подписки баланс из-за подписки уходит в минус, естественно при минусе инет отваливается, я захожу в личный кабинет посмотреть что с инетом, и вижу минус сразу перехожу в услуги, нахожу там подписку, далее звоню на ГЛ требую вернуть мне деньги иначе отдел К, прокуратора итд. Данные подписки действительно не требуют смс подтверждения, и оформляются автоматом, менее опытным пользователям обычно вешают лапшу мол PUSH уведомления, без вашего согласия оформить подписку не возможно и тд, ну лично мне пытались налить в уши такой воды в МЕГАФОНЕ))).\nУже много раз данный оператор возвращал мне ДС за подписки, уже реально бесит эта ситуация, государство лезет в инет со своими законами, а прижать операторов, и обязать их обязательным подтверждением подключения таких услуг через смс не могут. Если будет петиция то я за, тк у других людей побольше списывают и не всем возвращают. А наш народ не весь знает все эти тонкости, технические, да и ЗОЗПП не все знают.",
  "В последнее время если абонент жалуется в тех.поддержу из-за того, что у него списали деньги за левую подписку, то ему эти деньги возвращают. \n\nТак вот если бы деньги перечислялись левым контент-провайдерам, то сотовый оператор не стал бы из своего кармана отдавать абоненту деньги! Мегафон боится, что если начнутся массовые жалобы в правоохранительные органы, то рано или поздно такие действия квалифицируют по 159 УК РФ. И никакого ООО «Инфопартнёра» в этой цепочке не будет! Дешевле заткнуть возмущённых в самом начале.\n\nЕсли бы к примеру Роскомсвобода или еще кто-то организовали информационную поддержку, граждан которые возмущены такими поведением ососов, в виде сайта где расписано куда нужно подать заявление и типовые формы заявлений, с компенсацией морального вреда.\nВот тогда возможно и накопится критическая масса, которая побудит майора взяться за дело ради звезд.\n\nПросто не у всех есть возможность разбираться с документами, а когда количество действий сокращается до пары действий, распечатать бланк, заполнить и отнести куда надо.\nВозможно даже не принципиальные люди так и поступят.",
  "НЛО прилетело и опубликовало эту надпись здесь",
  "Был у меня похожий случай в Билайне.\nОператор техподдержки упорно доказывал мне, что я сам подписался на сервис.\nВ итоге сошлись в том, что на сервис меня подписал вирус. Я сделал вид, что провёл проверку антивирусом и нашёл вирус, а оператор вернул мне деньги, выведенные сервисом.",
  "У вас на скриншоте \"https://www.kv.by\"\nЭто точно работает с https?",
  "Воот! Искал этот коммент.\n\nКто-нибудь, объясните, как с SSL-ного гугла можно подделать редирект на SSL-ный же сайт?",
  "Подмена провайдером DNS-запросов",
  "Но в этом случае появилось бы огромное красное окно с предупреждением, что домен SSL сертификата не совпадает с www.kv.by, либо что это самоподписанный сертификат. Или они умеют как-то подменять корневые сертификаты на телефоне?",
  "Скорее всего срабатывает редирект от рекламной сети сайта, сильно не вникал но там одних только счётчиков штук 15 стоит, в том числе какой-то от Билайна.",
  "Там вирусная рекламная сеть. Обычным пользователям показывают безобидную рекламу, а с ip сотовых операторов делают редирект. Причём не всегда а с некоторой вероятностью, поэтому владелец сайта этого не замечает.",
  "Так как у меня на счету этого телефона 0 рублей и нет всяких «Кредитов доверия», то я нажал кнопку «Продолжить». В моем стандартном договоре с Белорусским МТС есть сложный пункт, согласно которому получается, что оператор не обязан останавливать предоставление услуги при отрицательном балансе если он еще не успел получить информацию о том что деньги исчерпаны. В этот пункт тыкают носом всех у кого случайно включилась передача данных за границей при балансе в пару долларов (обычно это обходится долларов 200-300, я платил один раз). \nТ.е. формально МТС может забрать вашу квартиру и машину при 0-ом балансе за один полученный анекдот и сказать, что это вы сами подписались на такие дорогие анекдоты, а они здесь не причем.",
  "Оператор не может «не успеть» получить информацию от самого себя. А пункт этот — для случая роуминга, и связан с тем, что некоторые операторы выставляют другим операторам счета за роуминг раз в день по будням.",
  "вроде CAMEL2 уже 15 лет как везде, а до этого на Prepaid роуминга не было вообще.",
  "Только в прошлом году новая мобила при переходе границы начала выдавать запрос, не хочу ли я включить передачу данных (как позже вычислил экспериментальным путем). И дальше по счастливому стечению обстоятельств в кармане на это сообщение я таки ответил что хочу. В итоге минутное подключение 4G мимо вайфая обошлось вроде долларов в 200, не помню.\nСтал читать в интернете, таких как я много, вплоть до нескольких тыщ $ и никто ничего не доказал. Написал заявление в МТС, ответили стандатрным бланком практически.\nCamel2 у них есть, но он не мешает сшибать деньги совсем. Причем, похоже это делают демократические европейские операторы даже а не МТС. МТС только может какие-то проценты имеет.",
  "не удивлен.\nбилайн так же этим грешит, они даже дальше пошли, на паспортные данные супруги приписали еще один номер, при этом прописав что паспорт пренадлежин некому Армену, и блочили оба номера когда у него средства на счете заканчивалиь… так собственно и узнали.\nПри этом ответить как получилось, что у одного паспорта два ФИО в системе, они так и не пожелали. \nПотребовалось ТРИ раза обращаться в их службу безопасности для дропа данного номера.",
  "НЛО прилетело и опубликовало эту надпись здесь",
  "Часто читаю про такие истории «коллега рассказал, что ему рассказали...» но пока ещё не встречал очевидца с чётким алгоритмом что и куда говорить, чтобы повторить эксперимент.\n\nА пока что звучит больше как феномен Баадера — Майнхоф, извините.",
  "Я лично это ощутил. \nРазговаривал с коллегой о райзерах. \nГуглить не пытался даже. Минут через 10 у меня стала всплывать реклама райзеров!\n\n\nТолько разговор был не по сотику, а рядом с компом на Windows10 и включенным микрофоном…",
  "А коллега или кто-то из Вашего окружения тоже не пытался гуглить? Ip-адрес то, наверное, общий.",
  "Окей, давайте я вам расскажу пару историй.\n1) Как-то зашел разговор с родными о том, что в каком магазине покупаем. Речь пошла о, ну пускай будет «творог в Магните». Я громко спорил, что творог в Магните — дрянь, а мне говорили, что только там и покупают. После этого я возвращаюсь домой, включаю ПК и у меня вываливается баннер контекстной рекламы «Творог в Магните». Я такого точного совпадения не видел ни до, ни после. Да еще и рекламы пищевого продукта, даже не техники. Но баннер был на странице почты, которая залогинена и дома, и на смартфоне.\n\n2) У меня сейчас вся контекстная реклама посвящена «франшизам». «Открой франшизу соляной комнаты с прибыльностью 400%», «открой франшизу магазина товаров из Китая с прибыльностью 300%», «открой франшизу франшиз». Как-то я сходил в тир, и мне пришел сначала опрос с геолокацией «вы недавно у нас были, оцените заведение», а потом на работе стали появляться баннеры «Откройте электронный тир в вашей соляной пещере, сделайте бизнес привлекательнее».\n\n3) У меня помимо «франшиз» пару раз всплыла реклама женского белья. Мне понравилась одна модель, и я кликнул рекламу, чтобы посмотреть на саму девушку поближе. Через день у меня стала появляться реклама «откройте франшизу корректирующего белья» с именно этой фотографией этой модели. Но по ссылке на «франшизу» ее фотографий вообще нет! Тот фотосет походу есть только на сайте одного интернет-магазина белья, но этот лохотрон с франшизами подгружает заинтересовавшую меня фотку в тело баннера.\n\nРекламщики строят вокруг меня какой-то свой, долбанутый виртуальный мир, в котором отражаются все мои желания и страхи, я не знаю, как не стать шизофреником, когда эта бездна смотрит в тебя.",
  "Да-да. Самое страшное — реклама женского белья. Достаточно один раз кликнуть и она потом преследует тебя везде. Страшно жить стало.",
  "Важное уточнение: под «моделью» я имел в виду — девушку-фотомодель, а не что мне понравилась одна из моделей женского боди или стрингов, если что.",
  "Как страшно жить без Адблока…",
  "С адблоком технологии никуда не денутся, просто скрипт отключит их графическое воспроизведение. Такие себе розовые очки.",
  "И пускай. Визуального мусора нет, значит эти технологии отработали впустую, конечная цель не достигнута.",
  "Как страшно жить с ненастроенным телефоном с кучей следящего софта. Запросы с геолокацией, реклама с учётом произнесённого. Я бы в штаны наделал. Слава Богам, что мой телефон таким не занимается, и без адблока у меня только приличная реклама грибка ногтей и ванги.",
  "Наверное и правда, страшно так жить.\n\nНо у меня на смарте рут, в Титаниум Бэкап список из нескольких десятков трешевых приложений, которые сносятся автоматом сразу после обновления, менеджер пермишенов не позволяет приложениям лазить везде, где им хочется, начиная от контактного листа и заканчивая геолокацией. Файрволл пускает в инет только тех, кому я это разрешил.\n\nИ еще Адблоком все это сверху прихлопываю.\nИбо нефик.",
  "Ибо нефик.\nВот в этом и проблема. Целый список нетривиальных действий только для того, чтобы твой собственный смартфон не сливал все данные всем подряд (",
  "Тренируйтесь игнорировать. Ваше внимание — ценнейший ресурс.",
  "Лично я сталкивался с обратной ситуацией. Chrome в домашнем wifi не на моём устройстве начал рекламировать аниме фигурки, что я заметил краем глаза. Эта реклама повторялась не один раз, а человек видевший её про аниме не знает. Потом, когда мне дали это устройство прочитать одну статью, я неоднократно пролистывал разные страницы на этом же сайте в надежде встреить эту же рекламу, но она полностью сменилась той, что была бы интересна предыдущему пользователю.\n\nПосле нескольких просмотренных роликов ютуб понимает что мне интерсно, до тех пор пока не закрываешь приватный режим без логина. Однако не все и не всегда, похоже что ютуб не знает о моих предпочтениях и пытается найти чем ещё заинтересовать. Некоторые ролики продвигает весьма настойчиво, не смотря на то что они меня никогда не заинтересуют. Стоит открыть один ролик из другой тематики и он мгновенно заражает собой как минимум половину рекомендаций. Чтобы скрыть эти рекомендации приходится открыть значительное количество других роликов. Стоит закрыть все приватные окна, и открыть ютуб заново, как он напрочь забывает о моих интересах и предлагает выборку для усреднённого жителя, в которой меня ничего не заинтересует. Некоторые рекомендации интересные мне бывают не на моём устройстве, интересные не мне на моём. Скорее всего ютуб просто пытается выяснить что меня заинтересует. По ip как правило определяет город в котором я нахожусь.",
  "Вот, посмотрите, интересно.",
  "Очень круто, но во время прямого эфира гугл действительно слушает микрофон и даже автоматически создаёт субтитры. Ещё не стоило ему нажимать на рекламу для чистоты эксперимента.\nЛично я никогда не встречался с такимНо при желании и это можно объяснить\n1. может быть я не сильно внимателен.\n2. может потому что у меня на компе микрофон через microsoft камеру (там теоретически загорается диод когда даже только микрофон активен)\n3. Может быть MacOS и iOS — этой заразе пока не подвержены.\n4. Я разработчик, а значит, теоретически, могу отдебажить и найти код который таким занимается ну и компанию которая поставила свою подпись на таком коде как следствие.\n",
  "4. Я разработчик, а значит, теоретически, могу отдебажить и найти код который таким занимается ну и компанию которая поставила свою подпись на таком коде как следствие.Даже искать не надо: десятый мастдай прямо во время установки говорит о том, что будет показывать вам рекламу. Отказаться от рекламы вообще нельзя.\nВот несколько скриншотов\n\n\n",
  "1) ничего не известно о его сети, хотя бы до роутера.\n2) не понятно кто слушает — гугл или майкрософт. Даже диспетчер задач не открывался, возможно хром висел в фоне\n3) не использовался другой пк/браузер/сматфон/операционная система\n4) тема не очень экзотическая, попадаение не стопроцентное\n5) блокировщики рекламы тоже не проверены\n6) очень желательно перехватить траффик и проанализировать\n\nОчередное видео про техномагию, совершенно не проливающее свет на происходящее.",
  "И у меня недавно было. Свежекупленный телефон Xiaomi в нагрудном кармане, идём с коллегой по улице, я ему рассказываю, что такое криптовалюты и биткоин, как работает блокчейн и эмиссия и пр. И вечером телефон показывает мне рекламу «Купи биткоин выгодно».",
  "телефон показывает мне рекламуКаким образом? В браузере? В китайском рекламном приложении? В гуглопочте?",
  "В ленте VK рекламные вставки на флеше (на телефоне стоит их приложение). Чёткую корреляцию заметил тогда только 1 раз, ещё несколько раз было что-то похожее, но не так впечатляюще.",
  "Потому я и не ставлю приложения социалок, ибо они контролируются куда хуже браузера.",
  "НЛО прилетело и опубликовало эту надпись здесь",
  "Подтверждаю. Было такое, и именно когда пользовался расшаренным с мобилы мегафоновским вайфаем.\nОчень нужна была какая-то книжка, которая, как водится, лежала на стремном файлообменнике. Я ее скачал было, проверив, что это все же .rar а не книгаrar.exe, но как оказалось, автоматически подписался на вип-тариф файлообменника со своего мобильного счета. Хорошо еще СМС об этой херне они прислали, я просто убил подписку в ЛК и все.\nНо ценное знание о том, что творит простое расшаривание вайфая — ачивмент анлокд, однако.",
  "Хм. Вот что значит шарить вайфай другу. Он налазит в интернете, а мне платить: ) Раньше шарил, теперь не буду, спасибо. Скажу «свой пора иметь».",
  "Выбесил именно этот момент, что не было никаких описанных в статье окон от Хрома «вы можете попасть на деньги». Было только СМС от Мегафона, что я подписался на дрисню за N рублей в месяц. Ну спасибо хоть на этом.",
  "Если друг настоящий, сделайте ему VPN учетку на своем сервере. Ну или просто VPN-ом покажите как пользоваться, бесплатных предложений хватает, чтобы просто серфить не опасаясь влететь на ловушки.",
  "Пф. У меня уже 2 раза зеленый оператор на кнопочном телефоне подключал услугу Интернет и ежедневно списывал деньги.\nВ поддержке уверяли, что услугу подключил я сам. Отключили её уже второй раз. Деньги не вернули.",
  "Я сам лично сталкивался, но, правда, никаких доказательств у меня нет. И все говорят, что это невозможно. Хотя, прочитав, как умные ворота подписались на анекдоты, или что-то там такое, раньше по интернету ходило — возможно… На старом, кнопочном телефоне, на котором нет доступа к интернету, даже скриншот экрана, наверное, нельзя сделать, подключилась подписка платная 30 руб. в день на сайт Веселуха ком. в детализации указано 9.9/10 гб. Но как?\nЕще со мной было — редирект и подписка (без Продолжить), сразу.\nЕщё я вот что выяснил. Не зашифрованный http трафик (80 порт), любые запросы к .js файлам, даже 404, Tele2 отдает рекламный скрипт.\nTele2 Россия 16:01\nАлексей, подписки автоматически не подключаются. О каком номере сейчас идет речь?\nАлексей 16:04\nПодключаются! И не утверждайте мне обратное!\nАлексей 16:18\nСкажу я вам номер и что от этого изменится? если я говорю, что телефоном пользуются очень мало и в интернет не заходят, никакие смс не отправляют, никакие короткие команды не набирают. как они могут подключаться скажите мне пожалуйста?! возможно у вас есть апи и недобросовестные разработчики им пользуются смотрите на это с другой стороны! вот вам факты понимаете я хочу разобраться не только с этим номером, а более глобально в проблеме!\nЛучше бы посоветовали подключить контентный счёт навсегда чтобы и написали бы команду для его подключения\nTele2 Россия 16:58\nАлексей, номер телефона нужен, чтобы мы проверили, каким образом произошло подключение подписок и поставили запрет на подключение подписок через интернет.\nУслугу \"Контентный лицевой счет\" можно подключить через сотрудника компании. С помощью команды подключить услугу нельзя.\nАлексей 17:00 \n\nАлексей 17:25 \nя надеюсь, что вы знаете что такое командная строка Windows или консоль (терминал) Linux\nи вы знаете что такое curl.\nесли нет,\nто вы ничего так и не поймёте и мне очень жаль.\nвключаете Tele2 интернет и делаете такой запрос:\ncurl http://example.com/anyfile.js\nкак вы думаете, что там будет?\n!function(){function t(){try{return window.self!==window.top}catch(t){return!0}}function e(){var t=document.getElementsByTagName(\"head\")[0],e=document.createElement(\"script\");e.src=\"http://p.tlrtb.com/ad/base.js?\",e.type=«text/javascript»,t.appendChild(e)}function n(t){o.parentNode.insertBefore(t,o.nextSibling)}function r(t){document.write(t.outerHTML)}function c(){for(var t=document.createElement(\"script\"),e=Array.prototype.slice.call(o.attributes),n=0;n<e.length;n++)t.setAttribute(e[n].nodeName,e[n].nodeValue);return t.src=\"http://example.com/anyfile.js?\",t}var o=document.currentScript||document.scripts[document.scripts.length-1],i=c();o.async||o.defer?n(i):r(i),window.qsrad||t()||(window.qsrad=1,e())}();\nЭто же ну наглость!!!\nИ после этого вы смеете утверждать, что подписки сами не подключаются?\nВы серьёзно,!\nтам должно быть написано:\nExample Domain\n\nДумал подмена DNS — нет.\ncurl -v http://87.250.250.242/gfthynftyhdrfvfdbgd.js\n\nTrying 87.250.250.242...\nTCP_NODELAY set\nConnected to 87.250.250.242 (87.250.250.242) port 80 (#0)\nGET /gfthynftyhdrfvfdbgd.js HTTP/1.1\nHost: 87.250.250.242\nподмена есть.\n\n",
  "Ха! Мне бабосы возвращать отказались. Прислали смс на «отключение платных подписок на 3 мес», а через несколько дней напоролся на очередную подписку!\n\nЗаголовок спойлера\n\n\n\n\n\n\n\n",
  "Есть подстава куда более вредная. МФ периодически шлет flash-сообщения. Эти сообщения возникают на экране телефона модальным окном на всю площадь. Т.к. человеку свойственна задержка между мыслями и мышечной активностью, есть доли секунды реакции, за которые заранее нацеленный на зловредную область экрана палец нажимает «аппрув», потому что за мгновение до этого там раньше размещался нужный элемент управления, и нажать требовалось именно его. А потом без всякого согласия списываются деньги, прилетает сообщение с подтверждением списания. Бороться с этим невозможно (я не нашел как). Все что можно отключил, и все равно, попадаюсь.",
  "посмотрите что есть в SIM-меню.",
  "Если вы про калейдоскоп, то я в курсе, и я его изничтожил (есть даже симки без него), и до недавнего времени забыл о проблеме, но, видать, МФ совсем распоясался. Он даже корпоративщикам шлет этот спам.",
  "Давайте подумаем, что с этим можно сделать. Технические средства тут, естественно, бесполезны — тот, кто способен настроить VPN, на эту ловушку и так не попадется, а если и попадется, то легко распознает и вернет деньги.\nВо-первых, можно попробовать привлечь внимание СМИ. В принципе, нахождение на первой странице Хабра само по себе может привлечь их внимание, но, если есть желающие, то можно отправить ссылку на статью с кратким комментарием в обратную связь какого-нибудь крупного СМИ. Вдруг заинтересуются.\nНекоторые предлагали привлечь внимание оппозиционных (или не оппозиционных) политиков. Попробовать можно, написать им, хуже не будет, но, наверно, власти не захотят рассматривать обращения от неприятных им политиков.\nДалее, можно попробовать придумать заявление и, если найдутся желающие, отправить в какой-нибудь государственный орган. Заявление, конечно, может быть в свободной форме, но если указать, какой именно закон нарушен и чем, то будет конечно лучше. Дело тут не касается политики, и потому органы вполне могут и поработать по нему и поставить себе плюсик.\nТут, очевидно, имеется введение в заблуждение: рядом с кнопкой написан яркий крупный текст на одну тему, а в углу окна серым неприметным шрифтом — совсем другое. Даже человек с хорошим зрением может не увидеть надпись, а человек с плохим зрением — точно не увидит. Тут можно попробовать привлечь статью о мошенничестве 159: \n1. Мошенничество, то есть хищение чужого имущества или приобретение права на чужое имущество путем обмана или злоупотребления доверием, -Обман тут явно имеется. Также, очевидно, что для людей с ослабленным зрением эта информация недоступна. Однако, до тех пор, пока кто-то не попался на этот обман, и не пожаловался, мошенничества формально нет.\nКакой орган тут может поучаствовать? \nРоспотребнадзор — отвечает в том числе за защиту прав потребителей. Они просят обращаться не в федеральное ведомство, а в территориальный орган по месту нахождения компании или потребителя. И если порыться на сайте, то к ним часто обращаются по поводу в том числе контент-услуг: http://77.rospotrebnadzor.ru/index.php/napravlenie/zpp/7083-prava-potrebitelej-v-sluchae-nepravomernogo-spisaniya-denezhnykh-sredstv-so-scheta-abonenta-operatora-svyazi\nВажно понимать, что оказание контентных услуг осуществляется только с непринужденного согласия абонента на получение данных услуг, и выражаются в виде расчета за оказанные абоненту услуги.\n…\nПретензия подлежит регистрации оператором связи не позднее рабочего дня, следующего за днем ее поступления. Оператор в свою очередь в течение тридцати дней со дня регистрации претензии обязан рассмотреть ее и проинформировать о результатах ее рассмотрения.\nВ случае отказа в удовлетворении оператором связи претензии потребителя необходимо обратиться в Управление Роспотребнадзора по городу Москве. К тексту обращения необходимо приложить копии документов, подтверждающих неправомерные действия оператора связи и копию ответа на Вашу претензию. Направить обращение в адрес Управления Роспотребнадзора по г. Москве можно:\n…\nв форме электронного документа через форму «Прием обращений граждан» на сайте Управления http://77.rospotrebnadzor.ru;Обращаться к ним, как я понимаю, можно только в случае, если вы написали претензию. Но тут ничего не сказано, что вы должны быть пострадавшим от действий оператора. Теоретически, вы можете написать претензию по поводу незаметного шрифта, оператор предсказуемо ее отвергнет, и вы обращаетесь с этим в роспотребнадзор. Мне кажется, достаточно того, что вы абонент Мегафона, не обязательно попадаться на эту ловушку, чтобы сообщать о ней.\nМожно обращаться в РКН. Вот на их сайте написано: \n3. Вопрос: Неисполнение или ненадлежащее исполнение оператором связи обязательств, вытекающих из договора об оказании услуг связи.\n…\nОтвет: Пунктами 4, 7, 9 ст. 55 Федерального закона от 07.07.2003\n№ 126-ФЗ «О связи» предусмотрено, что в случае неисполнения или ненадлежащего исполнения обязательств, вытекающих из договора об оказании услуг связи, пользователь услугами связи до обращения в суд предъявляет оператору связи претензию. Претензия, предъявленная оператору связи, должна быть рассмотрена не позднее 60 дней со дня ее регистрации.\n…\n4. Вопрос: Куда можно обратиться с жалобой на оператора связи.\n…\nОтвет: С жалобой на оператора связи Вы можете обратиться в Управление Роскомнадзора по Центральному федеральному округу на официальный сайт: http://www.rsoc.ru/treatments/p459/.\nОбращаю Ваше внимание, что в соответствие с требованиями Федерального закона от 26.12.2008 № 294-ФЗ «О защите прав юридических лиц и индивидуальных предпринимателей при осуществлении государственного контроля (надзора) и муниципального контроля» основанием для проведения внеплановой проверки оператора связи является «нарушение прав потребителей».\nПодтверждением того, что Вы являетесь потребителем услуг связи, является договор об оказании услуг связи, заключенный Вами с оператором связи. Копию договора и другие документы, необходимые для рассмотрения Вашей жалобы, необходимо приложить к обращению.Ниже, правда добавлено: \n12. Вопрос: Куда обращаться по вопросам мошеннических действий, совершаемых с использованием информационно-телекоммуникационных сетей?\nОтвет: Данные вопросы к компетенции Роскомнадзора не относятся.\nПресечение противоправных действий в информационно-телекоммуникационных сетях, включая сеть Интернет, выявление и пресечение преступлений, связанных с незаконным использованием сетей связи и противодействие мошенническим действиям, совершаемым с использованием информационно-телекоммуникационных сетей, находится в сфере деятельности МВД России. Плюс обращения в РКН или Роспотребнадзор в том, что это вас особо ни к чему не обязывает и не делает свидетелем или участником какого-то дела. А вот они на вашу жалобу должны дать ответ.\nПретензия к оператору может заключаться в том, что вы обнаружили плохо заметный текст, вводящий в заблуждение, на таком-то сайте. Просите оператора проверить эту информацию, и в случае подтверждения, сделать условия оказания услуги заметными и понятными, убрать вводящий в заблуждение текст: \nЗдравствуйте.\n…\nЯ являюсь абонентом компании \"Мегафон\", абонентский номер XXXX, дата заключения договора XX.XX.XXXX. Посещая интернет с использованием модема от компании \"Мегафон\", я попал на сайт http://example.com (данная страница доступна только при просмотре через модем компании \"Мегафон\"). На нем я увидел надпись \"Сайт может содержать оскорбительные материалы...\" (полный текст надписи) и большую кнопку \"Продолжить\". Однако, внимательно приглядевшись, я заметил вверху выполненный мелким шрифтом, еле заметный серый текст на темном фоне \"....\". Мне кажется, эта страница составлена таким образом, что может вводить потребителя в заблуждение относительно того, что выполняется при нажатии кнопки. Например, потребитель может подумать, что у него спрашивают согласие на просмотр оскорбительных материалов, но фактически при нажатии кнопки он соглашается на приобретение платную услугу с оплатой XX рублей в день. \n\nПо данным сайта whois7.com, домен example.com принадлежит компании \"Мегафон\".\n\nПрошу проверить, отражены ли на данном сайте условия оказания услуг полно и достоверно в соответствие с \"Правилами оказания услуг подвижной связи\", утвержденными Правительством РФ, и Гражданским Кодексом РФ. Доступны ли условия лицам с нарушениями зрения или ослабленным зрением? Нет ли возможности введения потребителя в заблуждение относительно назначения кнопки \"Продолжить\"? В случае обнаружения нарушений прошу их исправить. Также, в этой статье написано что можно обращаться в прокуратуру по месту жительства с заявлением на действия оператора. Но там же и написано про ответственность за ложное заявление, потому стоит использовать правильные формулировки, например не \"Мегафон это мошенники\", а \"Прошу проверить, нет ли в действиях компании Мегафон, использующей мелкий плохо заметный шрифт, признаков обмана и мошенничества\". \nСамо обращение может выглядеть как-то так (было бы хорошо, если бы кто-то более грамотный подправил текст): \nЗдравствуйте.\n…\nЯ являюсь абонентом компании \"Мегафон\", абонентский номер XXXX, дата заключения договора XX.XX.XXXX. Посещая интернет с использованием модема от компании \"Мегафон\", я попал на сайт http://example.com (данная страница доступна только при просмотре через модем компании \"Мегафон\"). На нем я увидел надпись \"Сайт может содержать оскорбительные материалы...\" (полный текст надписи) и большую кнопку \"Продолжить\". Однако, внимательно приглядевшись, я заметил вверху выполненный мелким шрифтом, еле заметный серый текст на темном фоне \"....\". Мне кажется, эта страница составлена таким образом, что может вводить потребителя в заблуждение относительно того, что выполняется при нажатии кнопки. Например, потребитель может подумать, что у него спрашивают согласие на просмотр оскорбительных материалов, но фактически при нажатии кнопки он соглашается на приобретение платную услугу с оплатой XX рублей в день. Также, для лиц с ослабленным зрением серый шрифт с условиями может быть недоступен, при том, что остальную часть страницы они способы прочесть. Такие лица буду введены в заблуждение относительно того, что происходит при нажатии кнопки \"Продолжить\".\n\nПо данным сайта whois7.com, домен example.com принадлежит компании \"Мегафон\".\n\nПрошу проверить, нет ли здесь признаков нарушения закона компанией \"Мегафон\" и признаков введения в заблуждение потребителей с целью подписки на платные услуги. В частности, прошу проверить, нет ли в действиях компании \"Мегафон\" признаков нарушения статьи 159 УК РФ \"Мошенничество\" или других применимых к данной ситуации статей закона. \n\nОтвет прошу направить на мой (почтовый адрес или адрес электронной почты) в установленный законом срок.\n\nПриложение: копия договора с ООО XXX на X листах.Я тут попробовал из любопытства зайти на сайт, упомянутый в статье ( http://vsewap.ru/subs.php ) и получил такую цепочку редиректов: \n\nhttp://vsewap.ru/subs.php\nhttp://vsewap.ru/user/subscribe/\nhttp://slm1.reredirecting.com/come/pp/(676 байт в base64)\nhttp://oo.arusav.ru/subject/t/(380 байт в base64)\nhttp://go.redirdomain.ru/return/wap/?ret=http://vsewap.ru/return.php?success_domain=vsewap.ru::XXXX&puid=XXXXXX&init_service_code=vsewap&operation_status=noauth&transactid=XXXXXX&serviceid=vsewap\nhttp://fc.informpartner.com/pw/piwik.php?action_name=&idsite=2&rec=1&r=XXXXX&url=http://go.redirdomain.ru/return/wap/?ret.....\n\nВ этой цепочке arusav.ru (странное название) принадлежит Мегафону.\nЭтот домен зарегистрирован недавно — 20 марта. Я подозреваю, они постоянно регистрируют новые домены, так как пользователи шлют на них жалобы разработчикам браузеров. Это объясняет, зачем тут нужен \"reredirecting\" в цепочке. Это, кстати, идея: можно каждый день смотреть, куда нас пересылает по этой цепочке, и оперативно отправлять жалобы на новые домены Мегафона.\nЗаходить желательно через модем мегафон, чтобы браузер мог бы отправить содержимое страницы в Гугл, и чтобы они увидели, что там действительно есть списание денег. В Фаерфоксе отправка доступна через Меню -> Справка -> Сообщить о поддельном сайте..., думаю, в Хроме как-то аналогично.",
  "Опсосов не оправдываю, но страница оплаты хранится на их серверах, даже если это услуга партнера.",
  "Ха, думал это был мой косяк, что не внимательно к ссылке отнесся, а оказывается вот оно что.",
  "Кстати, в теории, банковская карта МФ является защитой от подобного мошенничества. Дело в том, что МФ давным-давно доказал, что деньги на счете телефона и не деньги вовсе, а когда вводил сервис карты, филигранно переобулся в воздухе. Все эти запреты периодически отваливаются, а контент-счет не на все подписки срабатывает, но банковская карта это уже более серьезная мера, по мнению МФ, то есть, чтобы избежать негатива, они сознательно пошли на отказ от вирусных подписок ради привлечения клиентов БКМ. Сам сервис, развмеется, убог, и пользоваться им не обязательно. К сожалению, на корпоративных ТП карта не работает, но абонентам розничных ТП вполне доступно. Раньше давали бесплатно, сейчас не знаю как, наверное что-то стоит.",
  "Уверен, эта завлекалочка закончится, и они смогут себе позволить списывать с карточников в ещё большие минуса.",
  "Вот мой опыт. У меня есть их карта. Там раньше надо было больше тысячи на счету иметь чтобы проценты на остаток начислялись. Ну я повёлся и положил. Сначала они отключили проценты на остаток для тех кто картой месяц не пользовался — но я забил — кэшбек был у других лучше — так мои деньги там перестали увеличиваться. Подписывать меня не забывают на всякие временно бесплатные услуги — т.е.там уже 879 руб. Хотя я пользуюсь только входящими звонками через мультифон. т.е. как минимум 120 руб за два года они «нашли» за что списать.",
  "Сижу в инете через Мегафон. Не часто, но регулярно бывают такие перенаправления на сайты разных подписок, прямо из поиска гугла, например. Жмешь ссылку в результатах поиска — и попадаешь на совсем другой сайт, где в скрытой манере пытается привязаться какая-нибудь подписка. Жмешь ту же самую ссылку второй раз — и уже попадаешь на нужный сайт. И вот как такое перенаправление может быть осуществлено без участия самого Мегафона? Да никак не может быть. Сторонние контент-провайдеры, на которые всегда ссылается Мегафон, не могут перенаправить мои запросы из гугла, это может сделать только сам Мегафон, подменяя запросы в проходящем трафике.\nНа сами сайты, ссылку на которые я жму, тоже грешить не получается, т.к. такое случается и на ссылках на крупные зарубежные сайты.",
  "Это может сделать JavaScript партнерской рекламы на посещаемом сайте.\nНо если перенаправляет только http, но не https, то это маловероятно",
  "Реклама, не дающая зайти на сайт? Мне такой сценарий кажется маловероятным :)\nСпециально не проверял, но возможно, что это бывает только на http. Вот что точно бывает на http — так это зеленый баннер Мегафона на весь экран.",
  "В такой ситуации лучше всего было бы открыть инструменты разработчика в браузере (Ctrl + Shift + I) на вкладке «Сеть»/Network, включить запись лога и посмотреть, что именно происходит.\n\nЯ думаю, этим занимаются именно рекламные скрипты на сайте, на который вы переходите, возможно с согласия владельца сайта (он может получать процент от списанных с вас денег), возможно без. Также, ссылки в поиске могут подменять расширения к браузеру. \n\nМегафону подменять ссылки трудно из-за повсеместного https.\n\nЕсли погуглить «заработок на мобильном трафике», то можно увидеть различные партнерки и статьи с описанием: \n\n — hxxps://zarabotat-na-sajte.ru/kak-zarabotat-mobilnom-trafike.html\n — hxxps://richwap.ru/\n\nВот цитата с сайта: \n\n> Вы устанавливаете наш код на сайт, который определяет IP и страну пользователя. Если он подходит под условия, то его перекидывает на страницу оператора где он имеет возможность нажав на кнопку оформить услугу «Подписка» или же нажав «Отмена» вернуться к Вам на сайт. При подписке Вы будете получать регулярно комиссию с него, пока абонент не откажется от услуги. Такая же схема и с покупным трафиком.\n> \n> Подписки в один клик\n> Россия: Мегафон Билайн Теле2 \n\n(МТС почему-то нету)\n\nА здесь можно увидеть примеры «лендингов», которые предназначены для обмана пользователей: hxxps://vk.com/wapmaximum\n\nЖаль, у меня нет мегафоновского модема, я бы мог проверить тогда.",
  "В такой ситуации лучше всего было бы открыть инструменты разработчика в браузере (Ctrl + Shift + I) на вкладке «Сеть»/Network, включить запись лога и посмотреть, что именно происходит.\nЭто происходит пару раз в месяц, причем повторное нажатие той же ссылки уже отрабатывает нормально. Я не представляю как предугадать когда он произойдет чтобы заранее перед нажатием ссылки открыть панель разработчика :)\nМегафону подменять ссылки трудно из-за повсеместного https.\nВыше уже писали об этом, теперь буду обращать внимание на протокол того сайта, при переходе на который будет срабатывать перенаправление. Возможно, что это работает только на HTTP.",
  "Слушайте, а как пожаловаться на это сообщество (wapmaximum) в ВК?\nВедь там реально не скрывают чем занимаются?",
  "Как минимум 156 доменов/поддоменов было зарегистрировано на 31.173.34.227, из которых на 58 доменов трафик пошел с 17,18 и 19 апреля (по данным pDNS от Farsight. Тут можно посмотреть, список если сделать поиск по IP). Некоторые домены были зарегистрированы достаточно давно (в 2016).\nЕсли они используют только новые домены, которые живут несколько дней, то блокировать можно на уровне DNS если есть доступ к NOD фидам (например от SURBL и Farsight). Для мобильных устройств можно использовать приложения которые перехватывают DNS запросы и позволяют перенаправить на свой DNS, например Intra для Android (для iPhone сейчас подсказать не могу, раньше DNSCloak был доступен). Дополнительный плюс этого будет в том, что DNS запросы будут зашифрованы (DoT/DoH).\n\nVirusTotal практически не нашел ничего плохого на данном IP, кроме нескольких ссылок (фактически URL один, просто разные ID), которые Yandex Safebrowsing пометил как malware.\nНапример: go.informpartner.com/return/wap/?ret=http%3A%2F%2Fapi.rdrcto.com%2F_subscription_backurlm_wap.php%3Fsubscription_id%3D3000156418655%26project_id%3D30746%26sc%3Dae54a4ca7098deee3c41b6d0e50aad34%26back_url_id%3D171405577%26operator%3Dmegafon%26vercode%3DTX31526000&puid=80574387000013_4521&operation_status=noauth&transactid=80574387000013_4521&serviceid=eromaster",
  "Я так и не понял, что нужно, чтобы получить подписку. Быть залогиненным в личном кабинете и нажать на «согласен» на мошенническом сайте от Мегафона? В статье как-то не акцентируется это, а без этого в итоге непонятна суть, как именно обманывают операторы.",
  "Залогиненным быть даже не обязательно. А кнопки могут быть завуалированы по-разному, например, обычный плеер, и рядом темно-серым по чёрному надпись: «запуская проигрывание видео, вы соглашаетесь с ...».",
  "Скриншот с плеером https://habr.com/post/370417/\nЗа два года похоже ничего не изменилось",
  "Надо зайти на любой не-https сайт через мобильный интернет и нажать \"Продолжить\" на скриншотах 4 и 5, куда вас средиректило. Это все.\nЛогиниться в ЛК не нужно (тогда это мог бы быть XSRF в ЛК)",
  "Если я не залогинен, откуда тогда сайт или оператор узнают мой номер, на который оформить подписку?",
  "Оператор передаёт номер в заголовке типа X-MSISDN, из него сайт и узнаёт. Ну а оператор знает изначально, ему неважно, залогинены вы или нет — вы же уже в его сети с его SIM-картой зарегистрировались.",
  "А, так это только с телефона работает? Если я зайду на сайт через VPN/прокси/туннель, то оператор не будет передавать (и знать) мой номер, верно?",
  "Оператор всегда будет знать, но он будет видеть лишь трафик до VPN-сервера, в который, разумеется, ничего добавить не сможет; сайт, на который вы попадёте через этот VPN, соответственно, не будет знать номер и вообще, что вы зашли с Мегафона.",
  "Если вы сидите с телефона то ваш номер может светиться в заголовках http.",
  "Достаточно просто зайти на левый сайт, даже нажимать ничего не нужно. Даже закрыть его не успеваешь.",
  "Операторы передают номер телефона (или другой уникальный идентификатор пользователя) этим сайтам в HTTP-заголовке, который добавляет их оборудование.",
  "А разве возможно в https страничке поисковика открыв https ссылку подменить сайт?",
  "Скорее всего это был редирект с рекламной сети сайта.",
  "Нет, если открываемая ссылка — https. Но это не всегда так. Пока ещё вполне себе бывают сайты с http, и поисковики их выдают.",
  "Хорошо бы устроить массовый флэшмоб и завалить прокуратуру жалобами на этих лохотронщиков. Этот лохотрон продолжается уже несколько лет. Нужно не контентный счёт подключать, а массово валить с этого мегафона. И в мтс, кстати, то же самое.",
  "фактически вы предлагаете отказаться от мобильной связи (мобильного интернета) совсем? ибо все* известные мне опсосы в той или иной степени грешат действиями, похожими на мошеннические либо бездействием по отношению к предотвращению таких действий со стороны третьих лиц",
  "Не надо ни от чего отказываться. Да, все из большой тройки жульничают. К счастью это не все операторы. После того как мегафон меня в очередной раз выбесил с очередной подпиской я перешёл на йоту вместе с номером. С тех пор никаких проблем и никаких подписок. Интернет у меня только мобильный. Звоню по всей России и не парюсь про деньги на счёте. Вспоминаю про оператора один раз в месяц, когда приходит смска с предупреждением, что через 3 дня спишется абонплата. И плачу примерно в 2 раза меньше чем раньше в мегавони. И никаких подписок уже почти 2 года.",
  "у Йоты своих скелетов хватает в шкафах, хоть они и не про подписки.",
  "Каких, например?",
  "Любят шейпить трафик без повода и с ним.",
  "Спустя 3 месяца бездействия (например, уехали в отпуск) можете остаться без симки. Аналогично и с Мегафоном. Мне даже сотрудник подтвердил, что после потери симки она может быть продана другому клиенту даже в течение месяца.",
  "Может посадить по одному из топов 4-ки в КПЗ до окончания следствия, а потом как выйдет с доказательствами, это конечно негуманно, неправильно и т.д. но как по другому?",
  "Давайте разменяем комментариями 4-х значное число. Я тоже страдал. Вкратце история проста. В далекой глубинке, находится роутер с модемом, внезапно пропал интернет. Тоже подключились подписки. Деньги вернуть не предлагали. посоветовали услугу. Вот скрин.\n\n\nКак говорится — без слов. Только когда позвонил, рассказали про контентный счет, но так и не добрался до их офиса. Надеюсь мегафон перестанет так делать.",
  "Смеялся до слез)\nЭто дно",
  "У Т2 есть аналогичная хрень: «безопасный режим». 6 р./день.\n\n«Комплексная защита телефона от WEB-подписок, вирусов в интернете, SMS -спама и SMS- рекламы» (с)",
  "Настоящая «крыша».",
  "Рэкет на новых технологиях…\nЗато хоть без крови и членовредительства :)",
  "Немного истории.\nЯ пользуюсь мобильной связью с 99 года (нет я не был в первых рядах) \nМобильник купил уже после того как отработал 3 года после института.\n20 центов за минуту (3 первых секунды бесплатно) Сименс А30\nИ первое за что опсосы стали брать деньги, это смс подписки.\nВ журналах и сборниках сканвордов печатали рекламу\nпошли код мелодии через смс и получи ее на телефон.\nПотихоньку стал появляться интернет на телефонах.\nсперва работал только поверх WAP.\nУже стали предлагать скачать игры.\n\nВ хедерах запроса к сайту сперва можно было увидеть номер абонента.\nПотом вместо него UID.\nТрафик подешевел и люди стали уже использовать opera mini.\nИнформацию сторонним сайтам об абоненте перестали предоставлять и\nСобственно появился WAP-click.\nОпсос создает специальные страницы на своем сайте, где в одно действие \nможно провести разовую оплату или оформить подписку.\nАналог этого сейчас делает сбер в своем «Плати QR»\n\nТреш начался, когда разрешили создавать кастомные страницы подтверждения.\nСобственно из хорошей идеи получилось г…\n\nОпсосы всегда кивали, это плохие партнеры.\nПартнерки в наглую пишут инструкции как лить трафик вирусными методами.\nтак как сайты с посадочными страницами попадает в фильтры, меняют доменные имена.\n\nВ настоящий момент имхо не осталось честных распространителей контента, кто бы \nмонетизировался через WAP-click\n\nВсе отжила свое технология.\n",
  "Добавлю и я свою историю с Мегафоном, чтобы кол-во комментариев в этой статье зашкалило. Меня подписали на видеосервис youbube за 35 рублей в сутки. Именно юБубь. Моему негодованию не было предела. Youtube Premium стоит 169 рублей в месяц, а юбубь, о котором я и не знал до того момента, стоит 35 рублей в сутки! \nРешилось все в чате приложения Мегафон: сначала оператор пытался футболить и делать из меня идиота, но после моей угрозы написать жалобу в различные инстанции вернули обратно все деньги за три месяца.\n",
  "Юбуб! Вы сделали мой день, уже пять минут не могу перестать смеяться!\n\nОценил циничное чувство юмора создателей подписки…",
  "Всех сотрудников Мегафона надо обследовать у психиатра.",
  "А закончится это только тогда когда начнутся уголовные сроки. Но для этого органы правопорядка должны работать.",
  "Не удивлюсь, если сотрудники этих органов правопорядка сами страдают от таких фокусов опсосов.",
  "Конечно страдают. Но чтобы это исправить им нужно поработать. Т.е. собрать доказательства преступления. А не фигнёй маяться.",
  "Дальше ещё веселее, решил зайти в ЛК второй симки:\n",
  "Судить надо это жульё. По другому не поймут.",
  "НЛО прилетело и опубликовало эту надпись здесь",
  "А о плоской Земле вы не читали неоднократно? \nУ юристов сейчас с работой и доходами не очень. Есть не мало толковых юристов, которые хотели бы сделать себе имя. Вот это — хороший вариант. Собрать фактуру и устроить показательное дело против Мегафона. Даже если выиграть не удастся (хотя почему?) — то имя себе раскрутить вполне. Хайп в медиа раскрутится будь здоров! Плюс практика в судах по высокотехнологичным делам — на месте молодого перспективного юриста я бы ухватился за это.\nИ даже если Мегафон не засудят за жульничество, опсосы, когда их вытянут с доказательствами на свет божий, поостерегутся так в наглую жульничать — а это уже победа.\nP.S. А когда это судей выбирали? Вы ходили на выборы судей?",
  "НЛО прилетело и опубликовало эту надпись здесь",
  "По идее оператор должен полностью контролировать действия абонента в процессе подписки, исключая возможность мошенничества со стороны своих партнеров. Иначе будет совсем беспредел. Поэтому скорее всего это работает немного не так, как описано в статье.\nОператор видимо предоставляет партнерам услугу платных подписок. Вебсервис, где осуществляется подписка абонентом, размещается на сервере оператора, а не партнеров. Партнеру дается лишь возможность до некоторой степени кастомизировать внешний вид страницы и привязывать к ней кастомный домен, который можно зарегистрировать тут же.\nЕсли все так, это объясняет наличие кучи доменов, на одном IP оператора, с однотипными страницами. Вероятно и действия абонентов — кто, в какое время и какие запросы отправлял на вебсервис — у оператора записаны. Поэтому поддержка так уверенно утверждает, что запрос на подписку от абонента был. В свою защиту абоненты могут ссылаться лишь на обстоятельсва типа невнимательности, вирусов и разного мутного софта, самостоятельно кликающего по ссылкам и пуш уведомлениям.",
  "Поэтому поддержка так уверенно утверждает, что запрос на подписку от абонента был.Интересная теория, но самоподписание воротами она не объясняет. А если включить режим зануды то можно говорить только то что было что-то что система квалифицировала как запрос абонента на подписку.\n\nК тому же реальная, а не мнимая забота о пользователе решается весьма примитивным ходом: просто включенной услугой «отдельный контент счёт» по умолчанию и подключение платных услуг только настоящим ответом на смс.\n\nРазумеется «вот мы Вам подарили что-то и первые 7 дней оно бесплатно» — это тоже не из заботы о пользователе сделано. Особенно «пополните счёт на 200 руб и выше чтобы подключить услугу».\n\nДругу подключила девушка оператор по звонку «безлимитный интернет». Только предупредить забыла что услуга платная. Через пару месяцев он таки добрался до их офиса где его обрадовали 35 руб в день. Ща начал процес перехода на yota. Но 100% акций yota принадлежит мегафону и если не будет уголовных дел то это лишь вопрос времени когда гниль отравит и yota…\n\nНормальный следователь соберёт такие факты в доказательную базу вместе с показаниями экспертов. Но это ведь работать надо…\n\nКакой-то синдром Дженовезе прям.",
  "«поддержка так уверенно утверждает, что запрос на подписку от абонента был» — она такая борзая, пока не попросишь прислать документ, это подтверждающий, с подписью и печатью, для приобщения к делу о мошенничестве.",
  "Продолжение истории — у пожилого родственника за пару месяцев Билайн списал так 900р на «подписки». После массированной атаки в Фейсбук, Твиттер и сервисную службу деньги вернули с извинениями (довольно издевательскими, как я слышал — типа «так и быть мы _из своих денег_ вам компенсируем»)",
  "Позапрошлой осенью, после того как воспользовался бесплатным WiFi в экспрессе, Билайн начал с меня списывать деньги за доступ к играм на каком-то сайте. На сколько помню, кроме почты, StackOverflow и GitHub заходил только на страницу авторизации WiFi. Заметил подписку, когда списалось уже больше 2к.\n\nРугался, предложили вернуть половину, отказался. Пытался от них получить какое-то подтверждение того, что я сам подписался на этот сервис — безрезультатно. Присылали какие-то урлы, по которым находилось незнакомое мне содержимое. Якобы я подписался на что-то на этих страницах.\n\nВремя, которое мог выделить на общение с ними кончилось, в итоге забил, сменил тариф на более дешевый, стал платить за связь намного меньше (благодаря чему украденная сумма быстро «отбилась»). И решил перейти к другому оператору, но пока не дошли руки (корпоратив, перенос номера сложнее).\n\nБлагодаря этому обсуждению теперь знаю куда перейду после 15ти лет в Билайне, сделаю это в ближайшее время.\n\nВ дополнение:\n\nЛично наблюдал, как с телефона осуществлялся поиск мелодии в сети и после нажатия на кнопку «скачать» пришла СМС с уведомлением о подписке на музыкальный сервис какой-то. Каких-либо предупреждений о подписке после нажатия не наблюдалось. Тоже Билайн.",
  "Не совсем понятно сформулировал, дополню. На странице авторизации WiFi в экспрессе требовалось указать номер телефона, и потом там же возможно вводил код из SMS (точно не помню). После чего, похоже, и была включена платная подписка. Т.е. это было даже не через мобильный интернет.",
  "Прошу извинить, случайно продублировал комментарий.",
  "Спасибо, что напомнил про мошенников. Пошел проверять подключенные услуги в личные кабинеты. Обнаружил, что РТК подключил платную подписку на антивирус. Успел отключить до того, как деньги начали снимать. Типа \"бесплатный период\".\nТак что ещё раз спасибо автору, а клиентам интернет от Ростелекома рекомендую зайти в личный кабинет и проверить, не попали ли они как и я на такую \"акцию\".",
  "Ростелеком так классно формулирует СМС о подключении новых услуг, что нормальный человек об этом никогда не догадается. Это сделано 100% намеренно.\n\nВот что присылали мне, когда подключили антивирус:Защитите ваш компьютер! Антивирус Касперский. 30 дней бесплатно, далее 139 руб/мес. Данные для доступа в следующем сообщении. Подробности spb.old.rt.ru/action/homeinternet/act_int_antivirus_monthВторого СМС-сообщения не было.\n\nА это прислали, когда на месяц перевели меня на другой тариф:Оцените возможности тарифного плана Игровой! На 30 дней без дополнительной платы Вам доступны игровые опции World of Tanks, Warface, Lineage и в других популярных играх. После истечения тестового периода Вам будет возвращен Ваш прежний тариф. Подробная информация направлена на Ваш электронный адресИнформацию на email не прислали.\n\nВот бы у операторов была галочка: «я готов платить в 2 раза больше, но считаю себя человеком, а не дриснёй».\n\nТакже см. www.fontanka.ru/2019/04/11/138",
  "Комментариев к статье уже много, но надеюсь кто-то да увидит месседж. \nОсторожно, может пригореть\n\nПост хороший, автор от части правильно расписал весь алгоритм, но статья описана только с одной стороны без разбора причин. \n\nВсе же понимают, что во главе будут деньги? \nЕсть люди которые хотят их сэкономить/сберечь и есть те, что хотят заработать. Так вот в мире мобильных подписок заинтересованных сторон гораздо больше, чем Пользователь-Оператор и зачастую, они остаются невидимыми. На них практически никогда не срывается негатив Пользователей, но их роль в этом процессе, пожалуй, ключевая. \n\nОпишем схему как она есть: \nПользователь — Владелец ресурса — Агрегатор офферов — Мобильный оператор. \n\nПользователь — ну это мы с вами. Самая уязвимая и потерпевшая сторона. Ведь это нашим рублем оплачивается весь балет. Тут мало что интересного, двинем дальше.\n\nВладелец ресурса — это собственно человек или компания, которые создали Web ресурс на котором есть трафик (это важный момент). Так вот этот владелец видит какой трафик приходит к нему на сайт. Это может быть полностью декстопный через ШПД, а так же наиболее «Золотой» мобильный трафик. \nВладельцы ресурса бывают разные. Одни гордятся своим проектом, заключают сделки на рекламу только с проверенными агентствами/клиентами и вообще стараются не навредить своей чуткой аудитории (Например Хабр). В основном это крупные площадки, на них редко можно увидеть пресловутые мобильные подписки, так как держатели не хотят связываться ними и вообще с аудиторией и деньгами у них все хорошо. \nНо есть и другие владельцы — мелкие. У них может быть пачка из 20-50-200 Web проектов, с маленькой аудиторией, спарсенным контентом у крупняка или просто сами по себе жадные. И для них подписки это дополнительный и весьма не плохой источник дохода. \nВ поисках дополнительного источника заработка, они обращаются к Агрегаторам офферов. \nЭто площадки, на которых публикуются различные рекламные офферы для заработка владельцам ресурсов на трафике своего Web сервиса. Офферы бывают разные, где-то просто показ рекламы, где-то СPA, их много разных, но главное есть и мобильные подписки.\n\nВладельцы ресурсов могут поступить по разному: \n — Интегрироваться с агрегатором и разместить свой оффер по мобильной подписке — например как это делают новостные порталы «Хотите получить доступ ко всему проекту? Подпишитесь за 20 руб в день» и т.д. Это пожалуй самая честная схема, так как пользователю открыто говорится, что это подписка. \n — Интегрироваться и показывать на своем Web ресурсе рандомные предложения с мобильными подписками — через отображение баннеров на странице, ссылки, кнопки, что угодно. Это чаще встречающаяся схема, пользователь не всегда улавливает, что перешел на раздел с лендингом подтверждения. Но батхерта здесь уже больше и чувство обиды выше. \n — Жесткий редирект мобильного трафика на офферы — это самая офигевшая схема. Это осознанный шаг владельца ресурса перенаправлять своего пользователя страницу мобильной подписки. И это как раз тот случай, что описывает автор поста. \n\nМобильный оператор никогда не будет принудительно уводить пользователей с каких-либо ресурсов с целью отобразить лендинг с подпиской. ФАС за это вкатит такие огромные штрафы, что желание быстро уйдет. Но операторы тоже не белые и пушистые, дают возможность заработка на своих абонентах и конечно же имеют %. \nТак как пользователь не видит эти промежуточные звенья, понятно почему он срывает весь негатив на оператора и будет прав. Так как оператор должен контролировать кому и каким образом он предоставляет доступ к подписочным системам. Но из-за огромного количества таких агрегаторов/партнеров и их офферов/предложений/схем уследить за всеми разом сложно. Злоупотребляющие ресурсы или агрегаторы банятся, им закрывается доступ, но это имеет массовый характер и осечки случаются регулярно. \n\nНет мобильных операторов, которые не использовали бы мобильные подписки. Все операторы в РФ и зарубежья их применяют и отражают в своих статьях дохода. Это все еще большой рынок с огромными деньгами, правда в стагнации и с постоянно падающей выручкой. \n\nМикро-выводы: \n — Ситуация гораздо сложнее чем описывает автор поста\n — 90% перенаправлений на подписки происходят по желанию владельцев ресурса\n — Оператор тоже не пушистый и участвует в этом\n — Если видите кучу редиректов в адресной строке браузера, стоит остановить загрузку и поискать инфу на другом ресурсе\n — Ходите по проверенным сайтам \n — Юзайте браузеры с встроенной защитой от страниц подписок \n \nP.s. Согласен, что в 21 веке мобильные подписки это архаизм, который должен выпилиться сам по себе. Но я попытался показать альтернативный взгляд на происходящее.",
  "В данном случае кнопка «продолжить» с вводящей в заблуждение надписью (готовы ли увидеть оскорбительный контент) находится на принадлежащем «Мегафону» сайте (truvpro.ru). Соответственно, кто туда перенаправил пользователя — не важно, мошенничеством тут занимается сам оператор, причем используя какое-то левое доменное имя.",
  "Если вспомнить историю до отделения контент провайдеров, ваша теория сильно пострадает.",
  "Мегафон совсем скатился.\nЕсть еще услуга «настроение», используется куча незанятых номеров. С тем же принципом «ошибся при вводе» задумывался.\nРаньше для ussd был такой же список, не нашел.\nhttps://lc.megafon.ru/download/~kavkaz/~bel/korotkie_golosovie_nomera_uslugi_nastroenie.pdf",
  "Коллеги, поясните пожалуйста. Я на мегафоне сижу с момента его появления в РФ (телефония, смс, моб. интернет), но ни разу не подписался ни на какую подписку и даже предложений не видел. Почему так может быть? Я какую то технологию их не использую?\n\nЕдинственное что напрягает это их постоянные «вы выиграли 5млн рублей» с номера 2017 и прочее. ",
  "Ну некоторые люди никогда не ищут последнюю серию игры престолов смотреть онлайн бесплатно и без смс, но многие ищут.",
  "Я в принципе бывает ищу что-то подобное, но не с телефона. Т.е. если бы у меня инет был — свисток от мегафона в ноутбуке, то я мог бы словить эту хрень?",
  "Вам повезло, бывает, они не могут подписать всех абонентов разом, т.к. это будет уже слишком.",
  "Как стыдливо чёрный оператор называет Крым:\n\nВидимо, т.к. юрлицо зарубежное, боятся санкций.",
  "Чего им бояться — это они про Таймыр же!",
  "Тайрым",
  "Пора бы уж оставить эту «большую тройку» с их разводными схемами и посмотреть в сторону более приличных ОпСоСов, например,Yota или Danycom.",
  "У мамы в Мегафоне был тариф без абонентской платы, с поминутной оплатой. В месяц в среднем платит 700 — 1000р, 80% из которых за счет новых платных подписок. Это с учетом того, что я стараюсь следить за ее номером, слать СМС для запрета на подписки итд. В один прекрасный момент на счету становится 500р со знаком минус — проверяем, оказывается автоматически поменялся тариф и теперь абонентская плата 500р и 30Гб интернета! Чтобы отключиться от тарифа нужно послать волшебные СМС, чтобы их послать нужно сначала сделать положительным баланс, положив туда еще 500! Потом нужно писать заявление, что интернетом ты воспользоваться не успел и через какое -то время тебе обещают вернуть деньги.\nЭто означает, что тысячи престарелых людей со старыми кнопочными телефонами имеют 30Гб мобильного интернета и даже не подозревают об этом. Вот только «почему то дорого стали за телефон брать, только положила тысячу и уже нет». Люди, которые порой экономят каждую копейку, всматриваясь в ценники в Пятерочке вынуждены кормить этих скотов!!!",
  "Плохо следите! Такие суммы уходят! Посмотрите в сторону йоты, своего родителя успел перевести на йоту за 30р/мес пакет 200 мин. Сейчас дороже, но в любом случае с ними надежней, без подобных махинаций. Ещё вариант- дэником- 3коп/сек на все опсосы, тоже подписок нет.",
  "У Йоты сейчас стали странные тарифы. Минимальный 0/0 в моём регионе — 100 рублей. Искренне не понимаю, зачем нужно текстовое общение в соц.сетях на подобном тарифе, который обычно берут бабушкам или в разные устройства.",
  "Сейчас у всех странные тарифы. Тарифов без интернета я вообще не нахожу. Хочу купить симку для устройства, которое конструктивно ничего кроме СМС не умеет. Никак не выберу.",
  "Если Вы в зоне покрытия Теле2, то Тиньков умеет безлимитные СМС за 50 р/месяц",
  "Хочу тариф с пакетом в 100 МБ, но нету ((",
  "Самый эффективный способ избежать попадания на мобильные подписки — включить Запрет услуги мобильные платежи командой USSD *191*2#\nВключение данного запрета влечет за собой невозможность совершения любых мобильных платежей, т.е. средства на балансе могут использоваться только для оплаты базовых услуг оператора — сотовой связи, SMS и мобильного Интернета.\nУже более 2 лет изучаю схему мошенничества с мобильными подписками и не только. Удалось выявить даже завуалированные короткие номера, при отправке на которые SMS с необходимой массой дозы наркотиков со счета списывается эквивалентная сумма, а после — приходит SMS с информацией о том, где забрать. Чтоб не вызывать подозрений, формально контент-Поставщики динамически меняются. Вот такая жестокая действительность теневого рынка!\nФЗ-115 «О противодействии отмывания средств, полученных преступных путем» не работает, а Росфинмониторинг в письмах уже предупреждал об использовании сотовых операторов в незаконных и преступных схемах, в т.ч. с мобильными подписками",
  "А он сам потом не отключается?",
  "Нет. Отменить Запрет на услугу Мобильные платежи можно только по письменному заявлению.\nУ МТСа отключить — USSD *152*2# (услуга Легкий платеж) или позвонив по номеру 0890. У Теле2 отключить — звонить по номеру 611 или обращаться по иным каналам связи — в Личном Кабинете, онлайн-чате или фирменном салоне.",
  "Несколько лет назад сталкивался с платными подписками на мегафоне. Симка был вставлена в дачный роутер. За зиму мой умный дом слупил на семь тысяч рублей прогнозов погоды, анекдотов и изречений выдающихся личностей. Всё вернули после скандала, а после создания контентного счёта уже такого не повторялось. Однако, не так давно вдруг на сутки перестала действовать опция Интернет М всё на той же симке. Стали снимать за интернет по основному тарифу, причем каждое соединение оценили минимум в 200 Кбайт. Работающий роутере openvpn за эти сутки сделал соединений множество и выжрал кучу денег. После жалобы все вернули. Причина, как оказалось — технический сбой. Почему я разу не слышал о сбоях, результатом которых стало бы зачисление средств на счет или бесплатный трафик?",
  "За зиму мой умный дом слупил на семь тысяч рублей прогнозов погоды, анекдотов и изречений выдающихся личностей.\nНу дом же умный, ему по статусу положено погодой интересоваться (дабы правильно отоплением рулить) и саморазвитием заниматься, чтобы хозяина интеллектом радовать и беседу достойно поддержать мочь.",
  "А какой механизм тут срабатывает? Как в принципе симка вставленная в дачный роутер может на что-то подписаться? Или подписываются пользователи, когда они на даче через этот роутер в инет выходят?",
  "А какой механизм тут срабатывает?\n«Хочу денег» называется этот механизм.\nКовровая подписка пользователей на новые/старые рассылки/услуги, которые через некоторое время становятся слегка платными — самый простейший вариант и отлично катит для шлюзов/модемов (Ибо кто смс, приходящие на них читает? — Правильно, никто, пока баланс внезапно не ушёл в ноль/минус).",
  "Ага. Поэтому иметь Smstools3 на роутере очень желательно. С настроенной пересылкой смсок на электронную почту. Буквально на днях на другом моём роутере с симкой МТС появилась платная услуга Гудок. Вовремя узнал об этом из СМС.",
  "Поскольку роутер раздаёт вайфай, допускаю, что подписался кто-то из членов семьи, не прочитав мелкий серый текст. Оператор упирала на то, что я сам этого хотел и подписался, прочитав предупреждение о платном сервисе. Но, тем не менее, деньги вернулись на счёт через полтора часа после ругательного звонка.",
  "Как в принципе симка вставленная в дачный роутер может на что-то подписаться?\nТут уже множество раз писали про PUSH-уведомления, на которые некоторые роутеры реагируют так, что операторам кажется, будто они согласились.",
  "Не знаю, я даже после того как контентсчет врубил пополняю автоплатежом симку за час до того момента как абоненка списывается\nне понимаю как вообще 7 тыщ может сожрать, у вас автоплатеж на уменьшение баланса стоит?\nИли зачем вообще такие деньги на телефоне хранить",
  "Три с небольшим месяца списаний по 70 рублей в день. Автоплатёж, конечно.",
  "Я всё же не отказываюсь от своего предложения всех сотрудников Мегафона направить к психиатрам на освидетельствование т.к. нормальный человек, в здравом уме и в твёрдой памяти не станет конфигурировать работу вверенных ему сегментов сети так, чтобы создавать неудобства абонентам и воровать их деньги.",
  "Может, кому-то поможет мой опыт. \nМой способ отучения Мегафона от подключения платных подписок: раз или два раза в месяц в личном кабинете просматриваю расходы по всем номерам. Каждый раз при обнаружении неправомерных списаний пишу обращение и добиваюсь возврата списанных средств. Даже «копеечных» (5, 10, 30 р.). Делаю это постоянно из года в год. Все, абсолютно все такие списания были отменены, деньги возвращены. Даже если Мегафон тянул с возвратом, я все равно «дожимал» его повторными обращениями. Сначала делал это на бумаге через офисы обслуживания, теперь — через личный кабинет. Результат: пару лет назад подписки прекратились. У меня такое ощущение, что Мегафон где-то у себя в CRM-ке поставил галочку «это кляузный абонент, с ним не связываться». Внешне это проявляется в появлении на 1-2 сек. серой плашки в верхней части экрана с надписью «Оплата не прошла. Неизвестная ошибка» при случайном заходе на адреса-ловушки с платными подписками. \nКогда перевел к себе на корпоративный тариф номера жены и ребенка, их поначалу пару раз подписали. Как ранее для своего номера, я добился возврата денег для них. После этого волшебным образом списания прекратились и у них.\nP.S. Опцию (платную) запрета платных подписок не использую принципиально. С Мегафоном с 2000 г.",
  "Понятно, что можно постоянно всё проверять.\nНо, ведь жалко тратить время свой жизни на всё это…",
  "Решил проблему подписок переходом на Yota. Т.к. надоело такой вот ерундой заниматься. Тоже больше 15 лет пользовался Мегафоном…",
  "Получил вчера такое на телефон:\n\n\nПереписка со службой поддержки:\n\nЯ: Здравствуйте. 6 марта сего года я включил «запрет на все мобильные подписки» ((с) сотрудник техподдержки) с помощью сообщений УСТЗАПРЕТ1, и т.д. (всего около 6 штук). Но сегодня я получил вот такую рассылку через мобильное приложение SIM-меню (оно же MegafonPRO), которая почему-то опять выскочила на экране, из-за чего подписаться можно случайно и в одно касание. Каким образом эта зараза опять просочилась ко мне на телефон и как это запретить?\n\nСП: Добрый вечер! Это не относится к подпискам. Это портал MegaFonPRO. У Вас на телефоне есть SIM-меню, где можно настроить раздел Калейдоскопа, а именно всплывающие окна: — Папка «Темы/Подписка»: В списке знаком + отмечены каналы, на вещание которых Вы уже подписаны. Чтобы описаться, необходимо знак + поменять на — . — Папка «Настройки»: Через меню приложения «Калейдоскоп» Вы можете произвести настройку общих параметров раздела. — Вещание: Включение и выключение вещания, т.е. управление трансляцией push-сообщений.\n\nЯ: Сервис калейдоскоп я тоже отключил 6 марта с помощью SMS с текстом STOP на номер 5038, о чём получил ответ «Сервис калейдоскоп отключен»\n\nСП: Очень странно. Тогда я сейчас направлю информацию своим коллегам, чтобы они посмотрели, почему так произошло. Завтра в течение дня доступ к контенту SIM-меню и push-сообщения SIM-меню будут заблокированы. Само SIM-меню и его разделы будут по-прежнему отображаться, но пользоваться SIM-меню Вы не сможете, а значит и списаний в рамках сервиса не будет.",
  "Есть такое всплывающие СМС (Flash SMS). Там написано что то Свежие анекдоты 18+. И две кнопки О и Отмена. Если нажать ОК происходит подписка.",
  "Тоже попадал на такое. Обычно смотрю погоду на сайте ГисМетео, увидел заинтересовавшую новость сбоку, кликнул, начали открываться одна за одной разные страницы, пока закрыл, успело подписать на платную подписку. Тоже Мегафон, кстати. Никакого мелкого серого текста с кнопкой не было.",
  "Получается, что это организованное преступное сообщество, занимающееся мошенничеством в особо крупных масштабах?Прошу прежде чем минусовать, дочитать этот коммент до конца. Смотрите, то что пост набрал +555 плюсов — это здорово. Значит тема наболевшая. Но нужно сделать инициативную группу и… дойти до суда ИЛИ до официальных извинений Мегафона. \n\nВы, LMonoceros, будите это делать?\n\nЕсли нет — то это просто трёп. Да, крутой, на +555 плюсов хабра, но трёп. \nЕсли нет инициативной группы, то бессмыслены все действия :( \nНачните — и люди пойдут за вами.",
  "Данная проблема получила огласку. \nНа данный момент изучаю вопрос куда и как жалобу направить. \n\nЕсли есть опыт на эту тему — прошу помочь",
  "Конктретно этой проблемой не занимался. Но я занимаюсь проблемами образования (кто педагог из отрасли и в Бауманке — пишите в личку!). Так вот — пофиг на то, в чём именно проблема — начало одинаковое — собрать критическую массу активных людей.\n\nПроблема наболевшая. Значит люди есть. Найдите всего лишь ещё 3-4 энтузиастов и очно встетьтись с ними. Потрещите о жизни, договоритесь кто что будет именно делать. Как только будут первые результаты (даже если негативные) — сразу ещё один пост на хабре. И образуется комьюнити. А дальше вас понесет потоком… Генезис состоится. Главное — генезис.",
  "Трёп он такой. Если, в который раз, извинений не получите, вы готовы уйти от Мегафона? )",
  "Я просто оставлю это здесь. \nДо того как я уехал моим последним местом работы были остатки madnetex.com. Копии платформы которого пытались поставить всем 3 операторам. Что и как получилось.\n — все адреса сервисов подписок и страниц будут размещены на адресах и серверах операторов. Почему? Потому что в 2015 году вышел закон, который запретил операторам делать подписки с левых сервисов и серверов, только с контролируемых самим оператором.\n — владеет ли сам оператор этими сервисами? Да, но через левые конторы, аффилированность доказать сложно.\n — возможно ли что-то с этим сделать? Практически нет, потому что в этом замешаны финансы выходцев из МВД, например. Платформу RTB для операторов спонсировал мусор, что-то около 20-30млн. рублей.\n — почему так происходит? Доходы операторов падают уже очень давно, с учётом перехода на аутсорсовую поддержку издержки содержания растут. Бонусы очень хочется менеджерам операторов.\n — операторов подписок на самом деле 2-3, вокруг них выстроены стены левых юр.лиц. Они существуют уже десятки лет и ничего нигде не менялось. Wapclick как был актуален, так и останется.\nСледите за своими финансами, следите за состоянием счетов, банковских в том числе. Пишите жалобы, ходите по офисам. Операторы наказывают сервисы подписок за отток клиентов, за возвраты денег и так далее, требуйте компенсации за моральный вред.\nWapclick в РФ будет жить ещё ни одно десятилетие. Так как это мошенничество — пишите заявления в полицию. Не скачивайте левые популярные игры или копии игр в .apk, например, умельцы встраивают туда wapclick.\nЭто очень большая мафия. Лох не мамонт — он не вымрет.",
  "Какое всё-таки правильное название у оператора — Мегафон! По сути он и есть, ментовскóй матюгальник. «Дорогу, чернь, бояре едут! Все резко свернули на обочину и скинулись генералам на новые виллы, яхты и бизнес-джеты!»",
  "Особенно у МегаФона умиляет невозможность наложить запрет на платный контент без ограничения срока действия, приходится регулярно повторять эту командную тарабарщину. Мне стыдно, что я отдал 10 лет компании, котороая ведёт себя с клиентами таким постыдным образом…",
  "приходится регулярно повторять эту командную тарабарщину так это же забота о клиентах — тренировка памяти!",
  "А ещё интуицию, телепатию и ясновидение ^_^ \n",
  "Минутка статистики дамы и господа!\nКоличество комментариев с упоминанием операторов мобильной связи (без повторов в одном комментарии):\nМегафон — 108\nБилайн — 34\nЙота — 29\nМТС — 27\nТеле2 — 15\n Теперь и Вы знаете!)",
  "ещё Danycom (дэником) — 2",
  "Тут как-то очень много дискутируют о положениях закона, но почему-то никто не сослался на ключевое положение. Вот оно:\n\nОказание иных услуг, технологически неразрывно связанных с услугами подвижной радиотелефонной связи и направленных на повышение их потребительской ценности, осуществляется с согласия абонента, выраженного посредством совершения им действий, однозначно идентифицирующих абонента и позволяющих достоверно установить его волеизъявление на получение данных услуг.\n\n(126-ФЗ «О связи», ст. 44, п. 5)\n\nФишка в том, что «достоверно установить волеизъявление» при тех методах, что используются операторами/провайдерами для получения «согласия», невозможно в принципе. Поэтому схема диалога в любом споре должна быть простой:\n\n — Вы кликнули ..., чем подтвердили согласие…\n — Прошу предоставить мне документы, из которых однозначно и бесспорно следует, что я подтвердил свое согласие на предоставление мне оспариваемых услуг. Документы должны свидетельствовать не то, как ситуация выглядела с вашей стороны («нам показалось, что вы согласились»), а то, как она выглядела со стороны абонента — что именно было отображено на экране, и как именно было определено, что клик по ссылке явился результатом осознанного согласия, а не промаха, или вовсе ошибки в коде браузера.\n\nПонятно же, что подобных доказательств ни один оператор/провайдер предоставить не сможет.",
  "— Вы кликнули ..., чем подтвердили согласие…\nСудья: суд доверяет показаниям сертифицированного оборудования Мегафона. \nИли даже так: со слов ответчика, истец кликнул на ссылку, подтвердив согласие с офертой. Таким образом суд считает договор заключенным.\n\nИ плевать, что сертификат выдан только на устройство передачи данных по gpon.\n\nК сожалению, но это судебная практика…",
  "Судья: суд доверяет показаниям сертифицированного оборудования Мегафона. \nНа этот случай должны быть готовы возражения об отсутствии в «показаниях сертифицированного оборудования» сведений об установлении достоверности волеизъявления абонента.\n\nК сожалению, но это судебная практика…\nМожно примеры такой практики в отношении дел о неправомерных подписках/списаниях?",
  "об отсутствии в «показаниях сертифицированного оборудования» сведений об установлении достоверности волеизъявления абонента это реально работающий вариант?",
  "Примеров именно таких споров в суде я не знаю, но на любой суд конкретные и научные (или наукообразные) доводы всегда действуют лучше, чем голословные возражения.\n\nПример типичного спора:\n\n(клиент) Я ни на что не соглашался — может, просто нажал куда-то, но не помню, чтобы соглашался.\n(оператор) Согласно ФЗ «о цифровой подписи», использование логина/пароля является простой цифровой подписью. Следовательно, вы таким образом подписали соглашение.\n\nЕсли со стороны клиента вместо столь же обоснованных возражений (например, о том, что в отображенном контенте отсутствовал предмет соглашения и прочие существенные условия и т.п.) последует лишь недовольное отпирательство — судья предсказуемо будет склоняться на сторону оператора.\n\nМне несколько раз приходилось разбираться с операторами по поводу таких левых подписок — грамотно сформулированные юридические конструкции оказывали просто-таки волшебное действие. На стадии препирательств в стиле «я ни на что не подписывался» они намертво стояли на своем, и ничего возвращать не собирались.",
  "Да, логика в этом есть.\nСпасибо",
  "Наша судебная система декларируется как непрецендентная, судебная практика может приниматься во внимание при рассмотрении дела, но не может быть решающим фактором.\nВо всяком случае это в теории, на практике всё может быть, увы, иначе.",
  "В России «судебная практика» означает в первую очередь тенденцию. :) Ну и в какой-то мере позволяет влиять на решения судей, подсовывая им подборку практики вышестоящих судов в пользу нужного решения.",
  "(Прошу прощения, все 100500 каментов ниасилил).\n\nЯ одно не понимаю.\nНа каком основании опсос отдает мои деньги левому юрлицу? Разве где-то в договоре есть такой пункт? Я вроде только услуги связи от оператора N оплачивать подписывался, а не что ему вздумается.",
  "Потому что может, и получает с этого процент, притом немаленький. Впрочем, все эти «левые» юрлица всего лишь дочки самих компаний.",
  "Прочитайте мелкий текст на 100500й странице договора",
  "Если такой оговорки нет — на это тоже нужно указывать в споре. Но в большинстве форм договоров это есть.",
  "Даже если этого нет в договоре — ОПСОС легко добавить туда это позже. Они такие штуки делают регулярно. У супруги мегаржачный тарифный план «Всё за 500» стоимостью 600 рублей в месяц :)",
  "Как раз ничего ржачного в этом нет — название тарифа не содержит в себе условий договора, и выбирается произвольно. А в договоре наверняка есть оговорка о праве оператора менять условия, предупреждая пользователя в оговоренные сроки.",
  "предупреждая пользователя в оговоренные сроки\nНа странице Богом забытого раздела сайта.",
  "Ну так политика размещения части договора черт знает где дает пользователю неслабую выгоду. Найдите этот текст, скачайте его, измените по своему усмотрению, напечатайте, а в споре предъявляйте, как «неотъемлемую часть договора», утверждая, что именно в таком виде Вы и нашли его на сайте. Они тоже не смогут доказать, что именно в момент (в который, кстати?) просмотра/скачивания текст выглядел иначе.",
  "Помнится, мужика, который так сделал с высланным ему договором по почте от банка, вынудили уехать из страны.\nАх да, бумажки без нотариального заверения ничего стоить в суде не будут.",
  "бумажки без нотариального заверения ничего стоить в суде не будут\nЛожь.",
  "Удачи в суде с вашей бумажкой.",
  "Ну, я-то неоднократно и успешно участвовал в судах с различными документами, не заверенными нотариально (в том числе распечатками и скриншотами). А каков объем Вашего опыта? :)",
  "Согласно определению: Ложь эта неправда которую говорящий знает что говорит именно неправду.\nТ.е. это может быть просто заблуждением.",
  "Что за история?",
  "Воронежец заключил с банком договор, внеся свои правки, и собирается отсудить 24 миллиона рублей",
  "Ясно. Только он никуда он не эммигрировал и никто его не посадил. Вот читаю:\nО размере отступных своему клиенту банк умалчивает. При этом, источник НСН в банке, подтвердил, что без этого не обошлось, и речь идет о суммах с шестизначными нулями.\n\nПо мнению эксперта НСН, адвоката Максима Домбровицкого, наиболее вероятно, что Агаркову была выплачена сумма в пределах 1 млн рублей.\n\n«Мне кажется правдоподобной версия, что некоторая сумма Агаркову все-таки была банком выплачена. Конечно, это не 24 миллиона рублей. Скорее всего, какие-то совсем разумные деньги – в пределах одного миллиона рублей. Вполне возможно на этом всё дело и закончилось. Тиньков, конечно, не признается, потому что если сообщить об этом публично, то у многих возникнет желание поступить подобным образом и «нагреть» этот банк еще раз. Поэтому нюансы «мировой» остались вне рамок прессы и публичной огласки, а для общественности сказали, что «мы ему подарим карту», — пояснил НСН адвокат.",
  "Мне кажется\nСкорее всего\nВполне возможно\nКак-то слишком неуверенно.",
  "Ничего подобного. Была ситуация, когда Билайн забыл поменять у себя на сайте «подробные условия» архивного тарифа, а сами условия изменил.\n\nПисал обращение\nБилайн в одностороннем порядке в июне 2016г изменил условия тарифа, не уведомив об этом абонента, чем нарушил подпункт 7 пункта 3.1 условия оказания услуг связи Билайн, являющихся неотъемлемой частью абонентского договора. А именно: «оператор обязан не менее, чем за 10 дней до изменения действующих тарифов на услуги связи извещать об этом абонентов. Данные условия размещены на сайте Билайн в разделе «Документы и справочники».\n\nОбратился в Роскомнадзор (ну фиг знает, почему не туда) с просьбой проверить выполнение оператором правил оказания услуг связи, получил ответ, в котором в том числе было вот это.\nИзменение количества дополнительных абонентских номеров, доступных для подключения к основному номеру, не вносит каких-либо изменений в Тарифный план «Все за 600 архив 02.2016», поскольку данное условие не включено в указанный тарифный план, следовательно, в силу положений действующего законодательства, дополнительных уведомлений абонентов в обязательном порядке в данном случае не требуется.\nХотя именно количество номеров было указано в «подробных условиях» тарифа, в файле, который на сайте фиг найдешь, но на который вечно ссылаются.\n\nОператор же поменял файл (сылку) на сайте, примерно через месяц после обращения. Если файл скачать, то в свойствах документа дата изменения например июнь месяц, условия тарифа — апрель месяц\n\nВсем пофиг\n\nПодробнее эпопея тут описана.",
  "То есть вы правда считаете что тариф «Всё за 500», который стоил 500 рублей в месяц в момент заключения договора, а через некоторое время подорожал (или инфлировал?) до 600 рублей — это не смешно? Ну, значит у меня довольно странное чувство юмора. Зато я догадываюсь откуда пошёл девяток яиц :)",
  "Ну вот имя Людмила когда-то означало что-то вроде «милая людям». Сейчас это просто имя. Если девочку так назвали при рождении — она обязана всю жизнь быть милой для всех, или у нее есть право выбора? :)",
  "Точно! Поэтому всякая Людмила имеет законное право быть 22-летней, даже если родилась больше 30 лет назад! :)",
  "Еще раз: Вы распространяете обывательский подход на правовые отношения, неоправданно относя название (идентификатор) тарифа к условиям договора. Название «подарим миллион!» никого не обязывает кому-либо что-либо дарить, если это не отражено в условиях сделки.",
  "То есть вы полагаете что я не имею права смеяться над жадным оператором, который сделал тариф «Всё за 500» (и активно его именно так и рекламировал), а через какое-то время решил брать за него не 500, а 600 рублей потому что захотелось побольше денег?! На том основании что это «обывательский подход»?\nВы, наверное, в рекламе работаете? Ну, потому что абсолютно вся реклама, которая попадается мне на глаза — врёт. Но да, «Это ничего не значит, мы так пишем и говорим просто потому что хотим чтобы вы у нас что-то купили и никакой ответственности за свои слова мы нести не будем — мы же ничего не нарушаем (там снизу мелким шрифтом всё написано)» :)\n\nТогда ещё раз: я не возмущаюсь (бесполезно). Я просто смеюсь :)",
  "Разумеется, Вы имеете право смеяться. Но, точно так же, жадный оператор имеет право смеяться над излишне доверчивыми клиентами. Только, в отличие от клиентов, он, кроме смеха, имеет с этого еще и денежный навар. :)\n\nНет, я не имею отношения ни к рекламе, ни к поставке услуг. Я всего лишь обращаю Ваше внимание, что именно правовая дремучесть (зачастую — воинствующая) населения и позволяет коммерсантам его безнаказанно стричь. Вместо того, чтобы вестись на рекламные зазывы, затем ими возмущаться (ну, или смеяться — толку-то все равно никакого), имеет смысл разобраться в том, что вправе делать поставщик услуг, а чего — нет.",
  "Да тут хоть разбирайся, хоть не разбирайся — что изменится? Судиться с ОПСОСом из-за 100 рублей в месяц? Так проиграешь, потому что там 100% мелким шрифтом на 15 странице договора написано «имеет право изменять детали тарифа по своему усмотрению». А даже если и выиграешь — оно надо из-за 100 рублей? Не заключать договор? А звонить как?",
  "Если разбираться, то можно понять, на какие положения договора нужно обращать внимание, а какие можно пропустить. При конфликте, можно вместо голословных возмущений выставлять законно обоснованные претензии, что повышает вероятность выиграть спор (хоть непосредственно с оператором, хоть в суде).\n\nА Вы хотели бы, чтобы оператор не мог изменять детали тарифа по своему усмотрению?",
  "А Вы хотели бы, чтобы оператор не мог изменять детали тарифа по своему усмотрению?\nДовольно странный вопрос. Найдутся ли те, кто захочет чтобы одна (и только одна!) из сторон, подписавших договор, могла изменять его условия в одностороннем порядке? Если да, то мне было бы очень интересно услышать их мотивы.\nЯ, в силу профессии, склонен доводить ситуации до крайностей (reductio ad absurdum). И если этот приём применить в данном случае мы получим мир, в котором вряд ли кто-то вообще будет заключать какие-либо договора.\nВзяли вы батон хлеба за 50 рублей, донесли до кассы, а вам говорят:\n — С вас, милейший, 127 рублей!\n — Но позвольте, на ценнике же было написано 50?!\n — Да, но там ниже мелким шрифтом указано что в случае, если покупатель окажется мужчиной нечётным в очереди в четверг не позднее третьей недели после полнолуния, цена может измениться на уровень LIBOR + количество процентов равное количеству покупателей в магазине за последние трое суток, но не более их средневзвешенного числа за год, предшествующих квадрату возраста директора магазина.\n — Но ваш магазин называется «Всё по 50»!\n — Разумеется. Но это название было зарегистрировано несколько лет назад. С тех пор у нас поменялось три финансовых директора, мы дважды меняли учётную политику и четырежды проводили ребрендиг. Поэтому сейчас в нашем магазине нет ни одного товара с ценой 50 рублей. Но мы по-прежнему гордимся своим названием!",
  "Я вроде объяснил, почему название магазина или тарифа само по себе никак не связано с условиями заключаемых договоров. Впрочем, если Вам по душе придуряться — ради бога.\n\nНе хотите, чтобы оператор менял (в достаточно умеренных пределах, как показывает практика) условия обслуживания — он вместо этого может тупо расторгать договор каждый раз, когда соберется это сделать. Ну да, он Вас предупредит заранее, но каждый тащиться в офис для заключения нового договора Вам таки придется. Такой вариант Вас устроит?",
  "Кто всегда во всем серьёзен,\nКак педаль от огурца…\nНИ ЗА ЧТО ЧИТАТЬ НЕ БУДЕТ\nЭТУ ГЛУПОСТЬ ДО КОНЦА!\n:-)",
  "Такой вариант Вас устроит?\nМеня больше устроит вариант в котором меня не будут обманывать названиями договоров и заставлять таскаться в офис. \n\nЧума, на оба ваших дома.",
  "Я даже так скажу: если патологии много то это не повод называть её нормой. Но «всё за 500» это фигня. Я отлично помню «безлимит» — в котором после исчерпания трафика скорость падала ниже dialup-ной, хотя уже и на dialup-ной скорости сайты не открываются.\n\nЯ лично видел ни одного и не двух человек которые пели — «мне теперь ростелеком не нужен — у меня же МТС есть».\n\nВпрочем и «настоящий безлимит» тоже далёк от своего названия.\n\nЕсть одно определение:\nМошенничество = приобретение права на чужое имущество путём обмана или злоупотребления доверием.\n\nИ надеюсь когда-нибудь законы заработают должным образом мы доживём до того что инженеры на хабре нам не будут объяснять что оператор может назвать тариф как ему вздумается, а если пользователь что-то не так понял — то это исключительно его проблемы.",
  "Ну, мы ведь уже дожили до того, что в инструкциях к микроволновкам приходится предупреждать о недопустимости помещения в них домашних животных. К этому привело именно стремление пользователей отстаивать свое право быть недалекими, на грани идиотизма. Если пользователи хотят быть недалекими, и продавливают законы, защищающие это право — значит, будут и коммерсанты, использующие это в своих интересах.\n\nПредлагаю рассмотреть чисто бытовые высказывания, вроде «мне нужна только ты», или «я сделаю для тебя все». Следует ли из этого, что в первом случае автор высказывания готов обходиться без пищи, воды и воздуха, а во втором — выполнить любое, без исключения, распоряжение того, к кому высказывание обращено?",
  "Софистика.\nЗнает ли оператор называя тариф «безлимит» то что это название введёт в заблуждение потребителей? Имею основания полагать, что не только знает, но и рассчитывает на это.\n\nВ этом и разница с сушкой кошки в микроволновке.\n\nИ кстати. Имхо те кто полагают, что за сушку кошки будет виноват производитель микроволновки если оный не написал в инструкции «в микроволновке нельзя сушить кошку» — не менее вредны для общества чем мошенники злоупотребляющие доверием. А вообще есть ли такие? Или это был такой способ пиара какого-то производителя, который просто стал мемом?",
  "Заблуждение — достаточно устойчивое состояние. Чтобы оно возникло под влиянием одного только названия, нужно или иметь дело с очень привычным предметом (например, коробкой молока, на которой написано «кефир»), или же быть крайне некритичным, на грани дееспособности.\n\nРазумеется, оператор знает, что название «безлимит» у большинства людей ассоциируется с неограниченными объемом/скоростью, и пользуется этим для привлечения клиентов. Мне самому это не очень нравится, но о введении в заблуждение не может быть и речи, поскольку детали любого тарифа подробно расписаны, и сотрудники никогда не скрывают, что объем и/или скорость ограничены. На этом фоне, чем громче кто-то возмущается — тем сильнее выдает собственную невнимательность и некритичность.\n\nТо, что за кошку в микроволновке кому-то якобы выплатили бешеную компенсацию — действительно байка. Но иски к производителям, насколько я знаю, действительно были, и тем оказалось проще добавить предупреждения в инструкции, чем каждый раз отбиваться от дебилов и их адвокатов.",
  "сотрудники никогда не скрываютВы живёте в мире розовых пони что ли? Ещё как скрывают — от этого будет зависеть их KPI. Лично мне звонил билайн и предлагал перейти на план с большим количеством минут. На прямой вопрос — какие недостатки по сравнению с моим планом — был однозначный ответ — таковых нету. И потом когда я перешёл только оказалось, что минуты внутри сети теперь вычитаются из пакета минут, а до этого много разговаривали именно внутри сети. Заметил я только когда кончились минуты хотя ранее всегда оставалось более чем половина минут из пакета.\n\nДа и касательно безлимита этого пока не опробовали в действии сотрудники вполне себе говорили — что работать будет просто медленно — но по факту настолько медленно, что сайты не открывались обрывая соединение по таймауту. Сейчас уже часто сами продавцы симок говорят: «обратите внимание что будет настолько медленно что по сути работать не будет» — но это только после того как недовольные клиенты поняли что их обманули с этим безлимитом и устраивали скандалы.\n\nОсобенный писк это в договорах скорость: «не быстрее чем XXX» и невинные глазки «на ведь половина от XXX это тоже не быстрее чем XXX» — но эти выкрутасы уже отсудили люди — хотя право у нас не прецедентное…\n\nP.S. А то что дебилы посушив кошку нанимали адвокатов на заведомо проигрышное дело (а адвокаты в США не дешёвые) мне слабо верится. Хотя… может это был такой способ доказать, что ты не имел умысла замучить животное. В любом случае ситуация с тарифом «безлимит» и сушкой в микроволновке — принципиально разные. В одном случае нас заведомо пытаются объегорить — будешь ли ты умён найти уловки? Поймёшь ли что на медленной скорости ты не сможешь пользоваться интернетом? А во втором имеем случай или с живодёром или с дебилом.\n\nP.P.S. Короче. То что Вам кажется нормальным и допустимым мне таковым не кажется — позиция каждого из нас другому вполне ясна — больше не вижу смысла в обмене мнениями.",
  "Интересно, какого еще ответа Вы ожидали от сотрудника оператора на вопрос о «недостатках»? Для него никаких недостатков нет, о Вашем понимании недостатка он вовсе не обязан ничего знать. :) Учитесь задавать конкретные вопросы, которые помогают получить информацию, а не создать ложное убеждение.",
  "какого еще ответа Вы ожидалиВ моём мире информация что минуты внутри сети входят теперь в пакет минут достаточно существенная, что её стоило бы сказать и без моего вопроса о недостатках и уж подавно после оного. Или это, по-вашему, достоинство тарифа? Несущественное условие его изменения? Да и вообще вопрос про недостатки был скорее для проформы — введением в заблуждение было уже то что оператор говорил, что тариф лучше практически во всех отношениях и минут больше и гигабайт только меньше смс не 500 а 300…\nУчитесь задавать...Вы наверное и изнасилованных считаете «сама виновата». И убийцу можете оправдать «надо было жертве научиться не дерзить»…",
  "Хм… Если для акцепта договора на оказание платных услуг достаточно «клика» в некоторой области экрана устройства, а если быть точнее — отправки определенного http-запроса на определенный url тут у меня карта и пошла(с), то наверное можно как-то применить данную фичу в мирных целях.\nСамое простое, что приходит в голову — «зарегистрировать» хостинг платного просмотра скриншотов, и погонять по нему саппорт опсосов. \nВозможно даже оплату реализовать через «подписки» самих же опсосов.\n\nПусть потом судятся друг с другом, а мы посмеемся-))",
  "Это упрощенный порядок заключения договора, и его достаточно лишь при условии, что обе стороны это устраивает. В случае спора, каждой стороне потребуется доказать, что договор был заключен именно на тех условиях, на которых она настаивает, а это практически невозможно за пределам самых общих условий. :)",
  "Использовал корпоративную симку от Мегафона, тоже подключали пару раз платные услуи просто при заходе на сайте. С отключением были проблемы — в ЛК ничего нельзя было сделать, потому что типо аккаунт не полный, с трудом нагуглил коды для отключения всей этой фигни. Но куда более худший опыт у меня с Билайном. Постоянное подключение всякого говна на разные симки. Также часто всплывают сообщения типо «Тупые анекдтоы всего по 1р/сутки. Первая неделя бесплатно.» И с кнопкой «Ок», и никаких кнопкок больше. Также часто билайны подключают сначало бесплатную услугу, а потом через некоторое время делают платной. Отдельно стоит отметить условия подключения типа: «положи 200р на счёт и получи месяц бесплатной хрени, а потом опять всё будет платно». Короче, больших гандонов чем ОПСОСы, а в частности билайн, надо ещё поискать. Давно бы ушёл с билайна на кого-то ещё, но похоже они все такие…\n\nPS\nЗнакомая работала в течении полугода в одном из операторов тройки разработчиком бэка личного кабинета. Рассказывала, как их отругали за то, что они сделали удобное меню для отключения услуг. В общем, из этой параши она уволилась, сказав, что совесть не позволяет там работать.",
  "О, какая молодец!\nПервый раз встречаю информацию, что какой-то разработчик отказался участвовать во всех этих «уловках» опсосов.",
  "Я тут прочла что на жену Путина и пожаловаться то некуда. Ну в принципе есть одна паршивая инстанция Американский регулятор По сути для нас это конкурирующие грабители но ключевое слово здесь «конкурирующие»",
  "Почитал все комментарии, сколько же проблем у людей на ровном месте. :)\nСам раз в полгода тыщу закидываю, все минуты месячного пакета ни разу не выговаривал, и траффик никогда не заканчивался. Лучший тариф на все времена\n",
  "Лучший тариф на все времена\nКоторый, очевидно, уже не подключить.",
  "Проблемы особенно не заметны, за редким исключением, среди самих работников «невидимого фронта» чье самочувствие на прямую зависит от благосостояния и милости многоуважаемого оператора.",
  "Огромное спасибо за статью",
  "Хотела рассказать про свой безоблачный опыт сёрфинга из Франции, но потом погуглила и нашла вполне недавнюю ветку жалоб в саппорт моего оператора. Проблема та же, люди не замечают, что на что-то подписываются, а в конце месяца удивляются квитанции о снятых средствах с расшифровкой услуг. Оказывается, тут эти подписки работают официально. Есть агрегатор медиа-услуг, с которым работают разные операторы (https://www.infoconso-multimedia.fr). И есть сервис по управлению подписками (http://gerer-mes-abonnements.fr). В настройках личного кабинета оператора можно выставить ограничения на сумму микро-платежей. В-общем, на вид культурненько, но...",
  "Заканчиваю вторую статью. До конца недели выложу.",
  "github.com/vkorotenko/kickout-ads\n\nПохоже все интересней. \n\nВ ходе тестирования программного обеспечения (сайта) я обнаружил включение посторонней\nинформации в тело программы. Это действие содержит признаки преступления\nпредусмотренного статьей 273 УК РФ.\nВ данном случае ч. 2 так как рекламный баннер указывает на компанию ТЕЛЕ2 являющейся\nподрядчиком моего интернет провайдера РОСТЕЛЕКОМ.\nВ прикрепленном файле цифрами указана следующая информация:\n1. инструкция которая внедряет посторонний код\n2. исполнимый файл в который производиться запись\n3. позиция в которой это происходит\n4. код и адрес вредоносного скрипта который внедряется (link: p.tlrtb.com/ad/base.js) p.tlrtb.com/ad/base.js\nТак-как данное воздействие происходит на уровне сети, то по видимому имеется сговор\nмежду частью сотрудников для получения прибыли от рекламы показываемой пользователям.\nКроме этого нарушается нормальное функционирование программы.\n\nРегистрация доменного имени\nАО «РСИЦ» является регистратором доменного имени\nвторого уровня (link: tlrtb.com) tlrtb.com.\n\nАО «РСИЦ» не предоставляет услуги хостинга для сайта,\nадресуемого посредством данного доменного имени — lir@di-net.ru:\n(link: apps.db.ripe.net/db-web-ui/#/query?searchtext=95.163.106.7) apps.db.ripe.net/db-web-ui/#/qu…\n\nДиапазон адресов\n95.163.106.6 — 95.163.106.9\n95.163.106.7\n\nРуководитель (СПАРК)\nНекрасов Евгений Александрович\nООО «Квантум а Рус»\nООО «Алгоритм»\n(link: www.rusprofile.ru/arbitr/7809313) rusprofile.ru/arbitr/7809313\nЭкономические споры по гражданским правоотношениям\nСУММА\n \n1 872 572,75 руб.\nСТАТУС\n \nЗавершено\nИНСТАНЦИЯ\n \nАпелляция\nПОСЛЕДНЕЕ ОБНОВЛЕНИЕ:\n \n22.03.2019\nИСТЕЦ\n \nООО «Биг Дата Технолоджи»\nОТВЕТЧИК\n \nООО «Квантум а Рус»\nТРЕТЬЕ ЛИЦО\n \nПАО «Мегафон»\nПОСЛЕДНИЙ ДОКУМЕНТ \nНаправить дело в суд первой инстанции\n\n\n\nЭто и вас касается, насколько я понимаю данный адрес появляется и в вашей выдаче. Возможно вы использовали их услуги на аутсорсе. Во всяком случае интернет выдает ссылки и на вас в связи с этим скриптом www.google.com/search?q=meagafon+http%3A%2F%2Fp.tlrtb.com%2Fad%2Fbase.js \n\n",
  "Буквально сегодня повторно столкнулся с таким же…\nГде-то в начале года стали самостоятельно подключаться разные услуги. Причем, что было замечено, всякие окошки «Продолжить» появлялись даже на https сайтах, что предполагает наличие реверс-прокси… Ну не об этом речь. Подключили мне контентный счет с 0 балансом, все было вроде хорошо, но недавно раньше времени кончились деньги на основном счете, зашел и увидел, что у меня уже довольно долго подключена услуга Видеомир. Но дело в том, что симкарта в модеме, смс я там читаю довольно редко, и уж тем более ничего не отправляю оттуда. Как услуга могла подключиться при наличии контентного счета, ума не приложу.\nТут немного скринов\n\n\n\n\n\n\n\n\nНаписал в чат поддержки, ответа нет. Звонил на линию, ждал оператора — заждался. Нехорошо, MegaFon "
]
